{"Microsoft": {"0": {"title": "Microsoft and OpenAI's AGI Fight Is Bigger Than a Contract - WIRED", "summary": "Microsoft and OpenAI's AGI Fight Is Bigger Than a Contract WIRED", "provider": "Fri, 11 Jul 2025 12:11:00 GMT"}, "1": {"title": "Microsoft Touts $500 Million in AI Savings While Slashing Jobs - Bloomberg", "summary": "Microsoft Touts $500 Million in AI Savings While Slashing Jobs BloombergMicrosoft cuts 15,000 jobs, tells remaining employees to invest in ... Times of IndiaMicrosoft President Brad Smith on AI inv", "provider": "Wed, 09 Jul 2025 18:47:27 GMT"}, "2": {"title": "Microsoft Outlook working normal following widespread outage - USA Today", "summary": "Microsoft Outlook working normal following widespread outage USA TodayMicrosoft Outlook hit with hourslong outage CNBCMicrosoft Outlook Down — Email Outage Confirmed, What We Know So Far Forbes", "provider": "Fri, 11 Jul 2025 11:16:58 GMT"}, "3": {"title": "WPP Names Microsoft Executive as Next CEO - The Wall Street Journal", "summary": "WPP Names Microsoft Executive as Next CEO The Wall Street Journal", "provider": "Thu, 10 Jul 2025 07:18:00 GMT"}, "4": {"title": "Microsoft’s dreaded ‘Blue Screen of Death’ is going away: Here’s what’s replacing it - AL.com", "summary": "Microsoft’s dreaded ‘Blue Screen of Death’ is going away: Here’s what’s replacing it AL.com", "provider": "Thu, 10 Jul 2025 19:14:00 GMT"}, "5": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - TipRanks", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In TipRanks", "provider": "Fri, 11 Jul 2025 10:23:18 GMT"}, "6": {"title": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company - edition.cnn.com", "summary": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company edition.cnn.com", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "7": {"title": "Nvidia becomes world’s first $4T company, topping Apple and Microsoft in remarkable comeback - New York Post", "summary": "Nvidia becomes world’s first $4T company, topping Apple and Microsoft in remarkable comeback New York Post", "provider": "Wed, 09 Jul 2025 14:57:29 GMT"}, "8": {"title": "Windows 11 now lets you remove unwanted Microsoft apps natively - PCWorld", "summary": "Windows 11 now lets you remove unwanted Microsoft apps natively PCWorld", "provider": "Thu, 10 Jul 2025 15:04:00 GMT"}, "9": {"title": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken - BleepingComputer", "summary": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken BleepingComputer", "provider": "Wed, 09 Jul 2025 20:58:34 GMT"}, "10": {"title": "Microsoft (MSFT) Gets $600 Price Target—Oppenheimer Calls It a Long-Term AI Winner - Yahoo Finance", "summary": "Microsoft (MSFT) Gets $600 Price Target—Oppenheimer Calls It a Long-Term AI Winner Yahoo Finance", "provider": "Fri, 11 Jul 2025 10:41:21 GMT"}, "11": {"title": "Microsoft’s Copilot Plus features might arrive on desktop PCs later this year - The Verge", "summary": "Microsoft’s Copilot Plus features might arrive on desktop PCs later this year The Verge", "provider": "Tue, 08 Jul 2025 08:48:19 GMT"}, "12": {"title": "Outlook down? Microsoft email platform recoves after suffering a major outage - here's what happened - TechRadar", "summary": "Outlook down? Microsoft email platform recoves after suffering a major outage - here's what happened TechRadar", "provider": "Fri, 11 Jul 2025 13:56:52 GMT"}, "13": {"title": "Microsoft Elevate: Putting people first - The Official Microsoft Blog", "summary": "Microsoft Elevate: Putting people first The Official Microsoft Blog", "provider": "Wed, 09 Jul 2025 16:32:30 GMT"}, "14": {"title": "Microsoft Edge sets a new standard for speed and responsiveness - Windows Blog", "summary": "Microsoft Edge sets a new standard for speed and responsiveness Windows Blog", "provider": "Mon, 07 Jul 2025 17:21:33 GMT"}, "15": {"title": "Huntress Expands Microsoft Integration to Help MSSPs and SMBs Maximize Security Investments - MSSP Alert", "summary": "Huntress Expands Microsoft Integration to Help MSSPs and SMBs Maximize Security Investments MSSP Alert", "provider": "Fri, 11 Jul 2025 14:06:13 GMT"}, "16": {"title": "Microsoft’s 19-hour Outlook outage exposes fragility in cloud infrastructure - Computerworld", "summary": "Microsoft’s 19-hour Outlook outage exposes fragility in cloud infrastructure Computerworld", "provider": "Fri, 11 Jul 2025 10:18:21 GMT"}, "17": {"title": "Microsoft Pledges $4 Billion Toward A.I. Education - The New York Times", "summary": "Microsoft Pledges $4 Billion Toward A.I. Education The New York Times", "provider": "Wed, 09 Jul 2025 16:29:06 GMT"}, "18": {"title": "Microsoft Patch Tuesday, July 2025 Edition - Krebs on Security", "summary": "Microsoft Patch Tuesday, July 2025 Edition Krebs on Security", "provider": "Wed, 09 Jul 2025 02:59:09 GMT"}, "19": {"title": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports - Reuters", "summary": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports Reuters", "provider": "Wed, 09 Jul 2025 18:58:27 GMT"}, "20": {"title": "Outlook Outage: Microsoft Says Your Email Should Be Working Again - CNET", "summary": "Outlook Outage: Microsoft Says Your Email Should Be Working Again CNET", "provider": "Thu, 10 Jul 2025 20:13:00 GMT"}, "21": {"title": "Microsoft offers Europe new terms after complaint about licensing - Techzine Global", "summary": "Microsoft offers Europe new terms after complaint about licensing Techzine Global", "provider": "Fri, 11 Jul 2025 12:49:11 GMT"}, "22": {"title": "Microsoft (MSFT Stock) Emissions Up 23%, Invests in Waste-to-Energy Project to Capture 3 Million Tons of CO₂ - CarbonCredits.com", "summary": "Microsoft (MSFT Stock) Emissions Up 23%, Invests in Waste-to-Energy Project to Capture 3 Million Tons of CO₂ CarbonCredits.com", "provider": "Fri, 11 Jul 2025 13:30:57 GMT"}, "23": {"title": "Microsoft Outlook users experience hourslong outage impacting email access - AP News", "summary": "Microsoft Outlook users experience hourslong outage impacting email access AP News", "provider": "Thu, 10 Jul 2025 20:46:00 GMT"}, "24": {"title": "Reasoning reimagined: Introducing Phi-4-mini-flash-reasoning - Microsoft Azure", "summary": "Reasoning reimagined: Introducing Phi-4-mini-flash-reasoning Microsoft Azure", "provider": "Wed, 09 Jul 2025 16:00:00 GMT"}, "25": {"title": "Is Microsoft Outlook down? What to know about outage as users report issues - USA Today", "summary": "Is Microsoft Outlook down? What to know about outage as users report issues USA Today", "provider": "Thu, 10 Jul 2025 11:39:47 GMT"}, "26": {"title": "As AI reshapes its workforce, Microsoft commits $4 billion to help others adapt - GeekWire", "summary": "As AI reshapes its workforce, Microsoft commits $4 billion to help others adapt GeekWire", "provider": "Wed, 09 Jul 2025 16:39:14 GMT"}, "27": {"title": "Introducing Deep Research in Azure AI Foundry Agent Service - Microsoft Azure", "summary": "Introducing Deep Research in Azure AI Foundry Agent Service Microsoft Azure", "provider": "Mon, 07 Jul 2025 17:00:00 GMT"}, "28": {"title": "The Microsoft Surface Pro 2024 is one of my favorite tablets ever, no thanks to AI - CNN", "summary": "The Microsoft Surface Pro 2024 is one of my favorite tablets ever, no thanks to AI CNN", "provider": "Tue, 08 Jul 2025 11:58:00 GMT"}, "29": {"title": "Microsoft & Huntress Partner to Extend Security for All - Channel Insider", "summary": "Microsoft & Huntress Partner to Extend Security for All Channel Insider", "provider": "Fri, 11 Jul 2025 12:19:54 GMT"}, "30": {"title": "Accenture, Microsoft join forces to develop AI-driven cybersecurity solutions - Retail Banker International", "summary": "Accenture, Microsoft join forces to develop AI-driven cybersecurity solutions Retail Banker International", "provider": "Fri, 11 Jul 2025 12:05:28 GMT"}, "31": {"title": "Microsoft’s stock gets an upgrade. Why these analysts say it’s underappreciated in AI. - MarketWatch", "summary": "Microsoft’s stock gets an upgrade. Why these analysts say it’s underappreciated in AI. MarketWatch", "provider": "Wed, 09 Jul 2025 13:48:00 GMT"}, "32": {"title": "Microsoft expands Zero Trust workshop to cover network, SecOps, and more - Microsoft", "summary": "Microsoft expands Zero Trust workshop to cover network, SecOps, and more Microsoft", "provider": "Wed, 09 Jul 2025 16:00:00 GMT"}, "33": {"title": "Microsoft Outlook was down — live updates on email outage - Tom's Guide", "summary": "Microsoft Outlook was down — live updates on email outage Tom's Guide", "provider": "Thu, 10 Jul 2025 21:43:58 GMT"}, "34": {"title": "Sorry Apple and Google, Copilot Vision Proves Microsoft’s AI Game Is on a Whole Other Level - PCMag", "summary": "Sorry Apple and Google, Copilot Vision Proves Microsoft’s AI Game Is on a Whole Other Level PCMag", "provider": "Fri, 11 Jul 2025 14:07:53 GMT"}, "35": {"title": "Enhancing Microsoft 365 security by eliminating high-privilege access - Microsoft", "summary": "Enhancing Microsoft 365 security by eliminating high-privilege access Microsoft", "provider": "Tue, 08 Jul 2025 19:00:00 GMT"}, "36": {"title": "Microsoft - The Verge", "summary": "Microsoft The Verge", "provider": "Wed, 09 Jul 2025 08:58:44 GMT"}, "37": {"title": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers - The New York Times", "summary": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers The New York Times", "provider": "Wed, 09 Jul 2025 07:00:00 GMT"}, "38": {"title": "Microsoft and Adobe Patch Tuesday, July 2025 Security Update Review - Qualys", "summary": "Microsoft and Adobe Patch Tuesday, July 2025 Security Update Review Qualys", "provider": "Tue, 08 Jul 2025 18:41:02 GMT"}, "39": {"title": "WPP taps Microsoft exec Rose to rebuild ad group - Reuters", "summary": "WPP taps Microsoft exec Rose to rebuild ad group Reuters", "provider": "Thu, 10 Jul 2025 07:33:57 GMT"}, "40": {"title": "Microsoft (MSFT) Gets $600 Price Target—Oppenheimer Calls It a Long-Term AI Winner - Insider Monkey", "summary": "Microsoft (MSFT) Gets $600 Price Target—Oppenheimer Calls It a Long-Term AI Winner Insider Monkey", "provider": "Fri, 11 Jul 2025 10:42:32 GMT"}, "41": {"title": "Microsoft shares $500M in AI savings internally days after cutting 9,000 jobs - TechCrunch", "summary": "Microsoft shares $500M in AI savings internally days after cutting 9,000 jobs TechCrunch", "provider": "Wed, 09 Jul 2025 23:06:01 GMT"}, "42": {"title": "Replit Collaborates with Microsoft to bring Vibe Coding to Enterprise Customers - PR Newswire", "summary": "Replit Collaborates with Microsoft to bring Vibe Coding to Enterprise Customers PR Newswire", "provider": "Tue, 08 Jul 2025 14:08:00 GMT"}, "43": {"title": "Microsoft Makes AI Mandatory For Employees: What It Means For Your Career - Forbes", "summary": "Microsoft Makes AI Mandatory For Employees: What It Means For Your Career Forbes", "provider": "Tue, 08 Jul 2025 06:30:00 GMT"}, "44": {"title": "‘Who’s training who?’: Tech companies, teachers union partner on national AI academy - Chalkbeat", "summary": "‘Who’s training who?’: Tech companies, teachers union partner on national AI academy Chalkbeat", "provider": "Tue, 08 Jul 2025 23:24:00 GMT"}, "45": {"title": "Improved Demand for Azure Services Boosted Microsoft (MSFT) in Q2 - Yahoo", "summary": "Improved Demand for Azure Services Boosted Microsoft (MSFT) in Q2 Yahoo", "provider": "Fri, 11 Jul 2025 11:43:58 GMT"}, "46": {"title": "Is Outlook down? Microsoft reporting issues with email service. What to know - Cincinnati Enquirer", "summary": "Is Outlook down? Microsoft reporting issues with email service. What to know Cincinnati Enquirer", "provider": "Thu, 10 Jul 2025 12:14:59 GMT"}, "47": {"title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server - The Hacker News", "summary": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server The Hacker News", "provider": "Wed, 09 Jul 2025 07:10:00 GMT"}, "48": {"title": "Microsoft Patches ‘Wormable’ Critical Flaw, Discloses ‘Whopping’ Number Of Bug Fixes - CRN Magazine", "summary": "Microsoft Patches ‘Wormable’ Critical Flaw, Discloses ‘Whopping’ Number Of Bug Fixes CRN Magazine", "provider": "Tue, 08 Jul 2025 19:18:00 GMT"}, "49": {"title": "Carbon Direct releases latest CO2 removal criteria, in partnership with Microsoft - Data Center Dynamics", "summary": "Carbon Direct releases latest CO2 removal criteria, in partnership with Microsoft Data Center Dynamics", "provider": "Fri, 11 Jul 2025 11:08:54 GMT"}, "50": {"title": "Microsoft, OpenAI Partner With AFT to Train Teachers on AI - Education Week", "summary": "Microsoft, OpenAI Partner With AFT to Train Teachers on AI Education Week", "provider": "Tue, 08 Jul 2025 22:25:56 GMT"}, "51": {"title": "Microsoft, OpenAI and Anthropic are investing millions to train teachers how to use AI - CNN", "summary": "Microsoft, OpenAI and Anthropic are investing millions to train teachers how to use AI CNN", "provider": "Tue, 08 Jul 2025 19:26:04 GMT"}, "52": {"title": "Outlook takes another sick day - theregister.com", "summary": "Outlook takes another sick day theregister.com", "provider": "Thu, 10 Jul 2025 10:02:00 GMT"}, "53": {"title": "Microsoft offers EU cloud providers fresh commercial terms, staves off risk of litigation - theregister.com", "summary": "Microsoft offers EU cloud providers fresh commercial terms, staves off risk of litigation theregister.com", "provider": "Fri, 11 Jul 2025 09:30:00 GMT"}, "54": {"title": "Paint it black: Windows 11 crashes no longer have a Blue Screen of Death, but a black one - and I'm not entirely sure about this - TechRadar", "summary": "Paint it black: Windows 11 crashes no longer have a Blue Screen of Death, but a black one - and I'm not entirely sure about this TechRadar", "provider": "Fri, 11 Jul 2025 11:27:04 GMT"}, "55": {"title": "Microsoft, OpenAI, and a US Teachers’ Union Are Hatching a Plan to ‘Bring AI Into the Classroom’ - WIRED", "summary": "Microsoft, OpenAI, and a US Teachers’ Union Are Hatching a Plan to ‘Bring AI Into the Classroom’ WIRED", "provider": "Tue, 08 Jul 2025 11:30:00 GMT"}, "56": {"title": "Microsoft Will Delete Your Passwords in Less Than 4 Weeks. Do This Now - CNET", "summary": "Microsoft Will Delete Your Passwords in Less Than 4 Weeks. Do This Now CNET", "provider": "Tue, 08 Jul 2025 18:30:00 GMT"}, "57": {"title": "Is Outlook down right now? Is Hotmail email server down? When will outage be fixed? What we know - IndyStar", "summary": "Is Outlook down right now? Is Hotmail email server down? When will outage be fixed? What we know IndyStar", "provider": "Thu, 10 Jul 2025 12:31:55 GMT"}, "58": {"title": "Mass Microsoft layoffs hit Maryland-based video game workers - The Baltimore Banner", "summary": "Mass Microsoft layoffs hit Maryland-based video game workers The Baltimore Banner", "provider": "Mon, 07 Jul 2025 22:19:00 GMT"}, "59": {"title": "Microsoft Promotes Naim Yazbeck to President, Middle East and Africa - Microsoft", "summary": "Microsoft Promotes Naim Yazbeck to President, Middle East and Africa Microsoft", "provider": "Mon, 07 Jul 2025 09:17:56 GMT"}}, "Nvidia": {"0": {"title": "Nvidia stock eyes more gains after chipmaker becomes first company to reach $4 trillion market value - Yahoo Finance", "summary": "Nvidia stock eyes more gains after chipmaker becomes first company to reach $4 trillion market value Yahoo FinanceHere are Friday's biggest analyst calls: Nvidia, Apple, Tesla, Netflix, Roblox, Ama", "provider": "Thu, 10 Jul 2025 08:13:39 GMT"}, "1": {"title": "Trump hosts Jensen Huang at White House as Nvidia tops $4 trillion market cap - CNBC", "summary": "Trump hosts Jensen Huang at White House as Nvidia tops $4 trillion market cap CNBC", "provider": "Thu, 10 Jul 2025 20:22:57 GMT"}, "2": {"title": "Nvidia CEO Huang to meet Trump before China trip, source says - Reuters", "summary": "Nvidia CEO Huang to meet Trump before China trip, source says Reuters", "provider": "Thu, 10 Jul 2025 21:29:29 GMT"}, "3": {"title": "Watch Nvidia CEO Meets Trump Ahead of China Trip - Bloomberg", "summary": "Watch Nvidia CEO Meets Trump Ahead of China Trip Bloomberg", "provider": "Fri, 11 Jul 2025 13:46:01 GMT"}, "4": {"title": "AMD's Latest AI Chips Are on Par With Nvidia's Blackwell GPUs, HSBC Says - Investopedia", "summary": "AMD's Latest AI Chips Are on Par With Nvidia's Blackwell GPUs, HSBC Says Investopedia", "provider": "Thu, 10 Jul 2025 16:04:30 GMT"}, "5": {"title": "AMD Stock Popped After Analyst Said New AI Chips Could Take On Nvidia’s—Watch These Key Price Levels - Investopedia", "summary": "AMD Stock Popped After Analyst Said New AI Chips Could Take On Nvidia’s—Watch These Key Price Levels Investopedia", "provider": "Fri, 11 Jul 2025 14:15:48 GMT"}, "6": {"title": "Huawei AI Chip Redesign Aims to Break Nvidia’s China Dominance - The Information", "summary": "Huawei AI Chip Redesign Aims to Break Nvidia’s China Dominance The Information", "provider": "Fri, 11 Jul 2025 13:00:00 GMT"}, "7": {"title": "Nvidia-backed Perplexity launches AI-powered browser to take on Google Chrome - Reuters", "summary": "Nvidia-backed Perplexity launches AI-powered browser to take on Google Chrome Reuters", "provider": "Wed, 09 Jul 2025 15:09:31 GMT"}, "8": {"title": "Nvidia becomes world's first $4tn company - BBC", "summary": "Nvidia becomes world's first $4tn company BBC", "provider": "Wed, 09 Jul 2025 14:56:18 GMT"}, "9": {"title": "Warren Buffett Doesn't Own Nvidia — But His 3 Picks Are Better - Investor's Business Daily", "summary": "Warren Buffett Doesn't Own Nvidia — But His 3 Picks Are Better Investor's Business Daily", "provider": "Fri, 11 Jul 2025 12:00:00 GMT"}, "10": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - TipRanks", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In TipRanks", "provider": "Fri, 11 Jul 2025 10:23:18 GMT"}, "11": {"title": "AWS AI infrastructure with NVIDIA Blackwell: Two powerful compute solutions for the next frontier of AI - Amazon.com", "summary": "AWS AI infrastructure with NVIDIA Blackwell: Two powerful compute solutions for the next frontier of AI Amazon.com", "provider": "Wed, 09 Jul 2025 21:01:52 GMT"}, "12": {"title": "UW prof Dieter Fox leaves Nvidia to lead robotics initiative at Allen Institute for AI - GeekWire", "summary": "UW prof Dieter Fox leaves Nvidia to lead robotics initiative at Allen Institute for AI GeekWire", "provider": "Thu, 10 Jul 2025 16:59:55 GMT"}, "13": {"title": "Nouveau NAK Lands A Big Improvement For NVIDIA Kepler GPUs: As Much As 2.5x Faster - Phoronix", "summary": "Nouveau NAK Lands A Big Improvement For NVIDIA Kepler GPUs: As Much As 2.5x Faster Phoronix", "provider": "Thu, 10 Jul 2025 17:14:00 GMT"}, "14": {"title": "Nvidia Stock Falls From Historic High. Here’s What Gets It Back There. - Barron's", "summary": "Nvidia Stock Falls From Historic High. Here’s What Gets It Back There. Barron's", "provider": "Fri, 11 Jul 2025 14:10:00 GMT"}, "15": {"title": "Nvidia Is the First $4 Trillion Company. Here's Why It Could Still Soar Higher. - The Motley Fool", "summary": "Nvidia Is the First $4 Trillion Company. Here's Why It Could Still Soar Higher. The Motley Fool", "provider": "Fri, 11 Jul 2025 11:00:00 GMT"}, "16": {"title": "Nvidia Becomes First Public Company Worth $4 Trillion - The New York Times", "summary": "Nvidia Becomes First Public Company Worth $4 Trillion The New York Times", "provider": "Thu, 10 Jul 2025 21:32:23 GMT"}, "17": {"title": "DLSS 4 With Multi Frame Generation Coming To RuneScape: Dragonwilds, Mortal Online 2 & Brickadia | GeForce News - NVIDIA", "summary": "DLSS 4 With Multi Frame Generation Coming To RuneScape: Dragonwilds, Mortal Online 2 & Brickadia | GeForce News NVIDIA", "provider": "Tue, 08 Jul 2025 13:01:01 GMT"}, "18": {"title": "NVIDIA (NVDA) Rebounded from the Previous Lows - Yahoo Finance", "summary": "NVIDIA (NVDA) Rebounded from the Previous Lows Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:33:42 GMT"}, "19": {"title": "4 differences between Nvidia and AMD GPUs that I wasn’t prepared for when I swapped - XDA", "summary": "4 differences between Nvidia and AMD GPUs that I wasn’t prepared for when I swapped XDA", "provider": "Mon, 07 Jul 2025 10:00:00 GMT"}, "20": {"title": "Gorilla Technology Secures NVIDIA Partnership, Reveals Massive $5.6B Project Pipeline in Major Growth Update - Stock Titan", "summary": "Gorilla Technology Secures NVIDIA Partnership, Reveals Massive $5.6B Project Pipeline in Major Growth Update Stock Titan", "provider": "Fri, 11 Jul 2025 12:00:00 GMT"}, "21": {"title": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company - edition.cnn.com", "summary": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company edition.cnn.com", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "22": {"title": "Nvidia officially gets its $4 trillion finish. Here’s what could come next. - MarketWatch", "summary": "Nvidia officially gets its $4 trillion finish. Here’s what could come next. MarketWatch", "provider": "Thu, 10 Jul 2025 21:14:00 GMT"}, "23": {"title": "Look Up… It’s A One-Of-A-Kind Superman GeForce RTX 5090! And You Could Win It! - NVIDIA", "summary": "Look Up… It’s A One-Of-A-Kind Superman GeForce RTX 5090! And You Could Win It! NVIDIA", "provider": "Wed, 09 Jul 2025 15:41:06 GMT"}, "24": {"title": "Stock market today: S&P 500, Nasdaq eke out fresh records, Nvidia closes at $4T market cap - Yahoo Finance", "summary": "Stock market today: S&P 500, Nasdaq eke out fresh records, Nvidia closes at $4T market cap Yahoo Finance", "provider": "Thu, 10 Jul 2025 21:44:40 GMT"}, "25": {"title": "Nvidia's market value tops $4 trillion - Reuters", "summary": "Nvidia's market value tops $4 trillion Reuters", "provider": "Fri, 11 Jul 2025 00:42:00 GMT"}, "26": {"title": "Nvidia Stock Wavers After $4 Trillion Milestone. CEO Huang to Meet With China: Report. - Barron's", "summary": "Nvidia Stock Wavers After $4 Trillion Milestone. CEO Huang to Meet With China: Report. Barron's", "provider": "Thu, 10 Jul 2025 20:10:00 GMT"}, "27": {"title": "A Gaming GPU Helps Crack the Code on a Thousand-Year Cultural Conversation - NVIDIA Blog", "summary": "A Gaming GPU Helps Crack the Code on a Thousand-Year Cultural Conversation NVIDIA Blog", "provider": "Fri, 11 Jul 2025 13:08:12 GMT"}, "28": {"title": "Nvidia briefly touched $4 trillion market cap for first time - CNBC", "summary": "Nvidia briefly touched $4 trillion market cap for first time CNBC", "provider": "Wed, 09 Jul 2025 13:42:41 GMT"}, "29": {"title": "Nvidia's Jensen Huang sells more than $36 million in stock, catches Warren Buffett in net worth - CNBC", "summary": "Nvidia's Jensen Huang sells more than $36 million in stock, catches Warren Buffett in net worth CNBC", "provider": "Fri, 11 Jul 2025 14:12:27 GMT"}, "30": {"title": "AI Titan Nvidia Becomes First $4 Trillion Company Ever - Forbes", "summary": "AI Titan Nvidia Becomes First $4 Trillion Company Ever Forbes", "provider": "Wed, 09 Jul 2025 14:07:43 GMT"}, "31": {"title": "Nvidia Recently Flashed a Rare Buy Signal—But Is It Too Late? - 24/7 Wall St.", "summary": "Nvidia Recently Flashed a Rare Buy Signal—But Is It Too Late? 24/7 Wall St.", "provider": "Fri, 11 Jul 2025 12:40:13 GMT"}, "32": {"title": "Nvidia becomes first company to hit $4 trillion valuation - NBC News", "summary": "Nvidia becomes first company to hit $4 trillion valuation NBC News", "provider": "Wed, 09 Jul 2025 20:18:00 GMT"}, "33": {"title": "‘Stop Crying Bubble,’ Says Investor About Nvidia Stock - TipRanks", "summary": "‘Stop Crying Bubble,’ Says Investor About Nvidia Stock TipRanks", "provider": "Thu, 10 Jul 2025 23:42:15 GMT"}, "34": {"title": "Indexes rise, boosted by Nvidia record valuation, strong Delta forecast - Reuters", "summary": "Indexes rise, boosted by Nvidia record valuation, strong Delta forecast Reuters", "provider": "Thu, 10 Jul 2025 22:15:03 GMT"}, "35": {"title": "Nvidia CEO Jensen Huang could soon be richer than Warren Buffett—he's worth $142 billion now - CNBC", "summary": "Nvidia CEO Jensen Huang could soon be richer than Warren Buffett—he's worth $142 billion now CNBC", "provider": "Thu, 10 Jul 2025 19:00:53 GMT"}, "36": {"title": "How Nvidia Became the World’s First $4 Trillion Company - The Wall Street Journal", "summary": "How Nvidia Became the World’s First $4 Trillion Company The Wall Street Journal", "provider": "Wed, 09 Jul 2025 21:07:00 GMT"}, "37": {"title": "Nvidia's Momentum Rises On Taiwan Semiconductor Sales – Is The Most Valuable Company In The World A Buy Now? - Investor's Business Daily", "summary": "Nvidia's Momentum Rises On Taiwan Semiconductor Sales – Is The Most Valuable Company In The World A Buy Now? Investor's Business Daily", "provider": "Thu, 10 Jul 2025 15:11:00 GMT"}, "38": {"title": "Nvidia's stock market value hits $4 trillion on AI dominance - Reuters", "summary": "Nvidia's stock market value hits $4 trillion on AI dominance Reuters", "provider": "Wed, 09 Jul 2025 21:38:42 GMT"}, "39": {"title": "I've built Nvidia RTX 5070 and AMD Radeon 9070XT gaming PCs using last chance deals from Amazon's Prime Day - Rock Paper Shotgun", "summary": "I've built Nvidia RTX 5070 and AMD Radeon 9070XT gaming PCs using last chance deals from Amazon's Prime Day Rock Paper Shotgun", "provider": "Fri, 11 Jul 2025 09:45:54 GMT"}, "40": {"title": "Nvidia Just Became the First Company to Hit a $4 Trillion Market Cap - Barron's", "summary": "Nvidia Just Became the First Company to Hit a $4 Trillion Market Cap Barron's", "provider": "Wed, 09 Jul 2025 20:15:00 GMT"}, "41": {"title": "Nvidia Hits $4 Trillion, BECU Buys AI Firm - WealthManagement.com", "summary": "Nvidia Hits $4 Trillion, BECU Buys AI Firm WealthManagement.com", "provider": "Fri, 11 Jul 2025 13:44:37 GMT"}, "42": {"title": "Nvidia Shows Why It Is Still A Magnificent Seven Name - Investor's Business Daily", "summary": "Nvidia Shows Why It Is Still A Magnificent Seven Name Investor's Business Daily", "provider": "Fri, 11 Jul 2025 12:00:00 GMT"}, "43": {"title": "Nvidia’s Meteoric Rise Has Made Jensen Huang Almost as Rich as Warren Buffett - Investopedia", "summary": "Nvidia’s Meteoric Rise Has Made Jensen Huang Almost as Rich as Warren Buffett Investopedia", "provider": "Thu, 10 Jul 2025 21:11:53 GMT"}, "44": {"title": "Dimon Calls Out Market’s Tariff Complacency. Why Nvidia, Bitcoin Point to a FOMO Trade and 5 Other Things to Know Today. - Barron's", "summary": "Dimon Calls Out Market’s Tariff Complacency. Why Nvidia, Bitcoin Point to a FOMO Trade and 5 Other Things to Know Today. Barron's", "provider": "Fri, 11 Jul 2025 11:04:00 GMT"}, "45": {"title": "Why Nvidia is 'still undervalued' - Yahoo Finance", "summary": "Why Nvidia is 'still undervalued' Yahoo Finance", "provider": "Fri, 11 Jul 2025 10:00:40 GMT"}, "46": {"title": "Performance Vs. Expectations: Rethinking Nvidia And AMD Valuations (NASDAQ:NVDA) - Seeking Alpha", "summary": "Performance Vs. Expectations: Rethinking Nvidia And AMD Valuations (NASDAQ:NVDA) Seeking Alpha", "provider": "Fri, 11 Jul 2025 13:58:00 GMT"}, "47": {"title": "Reach the ‘PEAK’ on GeForce NOW - NVIDIA Blog", "summary": "Reach the ‘PEAK’ on GeForce NOW NVIDIA Blog", "provider": "Thu, 10 Jul 2025 13:03:10 GMT"}, "48": {"title": "Planned Nvidia expansion in Israel prompts multiple offers of sites - Reuters", "summary": "Planned Nvidia expansion in Israel prompts multiple offers of sites Reuters", "provider": "Wed, 09 Jul 2025 14:04:55 GMT"}, "49": {"title": "AI kingpin Nvidia crowned as first public company with a $4 trillion valuation - AP News", "summary": "AI kingpin Nvidia crowned as first public company with a $4 trillion valuation AP News", "provider": "Wed, 09 Jul 2025 20:44:00 GMT"}, "50": {"title": "Nvidia's $4 trillion milestone caps rise of stock market behemoth - Reuters", "summary": "Nvidia's $4 trillion milestone caps rise of stock market behemoth Reuters", "provider": "Wed, 09 Jul 2025 21:33:33 GMT"}, "51": {"title": "S&P 500, Nasdaq post record closes, Nvidia closing valuation $4 trillion - Reuters", "summary": "S&P 500, Nasdaq post record closes, Nvidia closing valuation $4 trillion Reuters", "provider": "Thu, 10 Jul 2025 21:32:07 GMT"}, "52": {"title": "Nvidia becomes first US company to reach $4 trillion market cap - Al Jazeera", "summary": "Nvidia becomes first US company to reach $4 trillion market cap Al Jazeera", "provider": "Wed, 09 Jul 2025 15:33:42 GMT"}, "53": {"title": "Huawei working on new AI chips to compete with Nvidia - Investing.com", "summary": "Huawei working on new AI chips to compete with Nvidia Investing.com", "provider": "Fri, 11 Jul 2025 13:11:32 GMT"}, "54": {"title": "Nvidia’s Jensen Huang Meets With Trump Ahead of CEO’s China Trip - Bloomberg", "summary": "Nvidia’s Jensen Huang Meets With Trump Ahead of CEO’s China Trip Bloomberg", "provider": "Thu, 10 Jul 2025 19:15:53 GMT"}, "55": {"title": "I spend hours every week tracking GPU prices and I've finally found a bunch of Prime Day graphics card deals at or below MSRP. And they're not just the 8 GB models, either - PC Gamer", "summary": "I spend hours every week tracking GPU prices and I've finally found a bunch of Prime Day graphics card deals at or below MSRP. And they're not just the 8 GB models, either PC Gamer", "provider": "Fri, 11 Jul 2025 10:11:51 GMT"}, "56": {"title": "Veteran trader and analysts turn heads with new Nvidia stock price targets - TheStreet", "summary": "Veteran trader and analysts turn heads with new Nvidia stock price targets TheStreet", "provider": "Thu, 10 Jul 2025 18:04:00 GMT"}, "57": {"title": "VIEW Nvidia becomes first company to hit $4 trillion in market value - Reuters", "summary": "VIEW Nvidia becomes first company to hit $4 trillion in market value Reuters", "provider": "Wed, 09 Jul 2025 17:56:41 GMT"}, "58": {"title": "Watch These Nvidia Stock Price Levels as AI Chip Giant Hits $4 Trillion Market Value - Investopedia", "summary": "Watch These Nvidia Stock Price Levels as AI Chip Giant Hits $4 Trillion Market Value Investopedia", "provider": "Wed, 09 Jul 2025 22:18:34 GMT"}, "59": {"title": "Nvidia becomes first $4 trillion company at market close - The Washington Post", "summary": "Nvidia becomes first $4 trillion company at market close The Washington Post", "provider": "Fri, 11 Jul 2025 04:12:01 GMT"}}, "Apple": {"0": {"title": "Apple Plans New MacBook Pro, iPhone 17e and iPads by Early 2026 - Bloomberg", "summary": "Apple Plans New MacBook Pro, iPhone 17e and iPads by Early 2026 Bloomberg", "provider": "Thu, 10 Jul 2025 19:05:09 GMT"}, "1": {"title": "Apple’s packed spring 2026 lineup looks to have something for everyone - Macworld", "summary": "Apple’s packed spring 2026 lineup looks to have something for everyone Macworld", "provider": "Thu, 10 Jul 2025 20:41:00 GMT"}, "2": {"title": "Apple Studio Display Successor Now Expected Early Next Year - MacRumors", "summary": "Apple Studio Display Successor Now Expected Early Next Year MacRumors", "provider": "Fri, 11 Jul 2025 11:47:20 GMT"}, "3": {"title": "AI is turning Apple into a \"loser\" - Axios", "summary": "AI is turning Apple into a \"loser\" Axios", "provider": "Thu, 10 Jul 2025 11:02:14 GMT"}, "4": {"title": "Gene Munster Explains Two Potential Growth Catalysts for Apple (AAPL) Stock - Yahoo Finance", "summary": "Gene Munster Explains Two Potential Growth Catalysts for Apple (AAPL) Stock Yahoo Finance", "provider": "Thu, 10 Jul 2025 13:37:32 GMT"}, "5": {"title": "Apple intends to release slate of updated products in early 2026: report (AAPL:NASDAQ) - Seeking Alpha", "summary": "Apple intends to release slate of updated products in early 2026: report (AAPL:NASDAQ) Seeking Alpha", "provider": "Thu, 10 Jul 2025 19:42:00 GMT"}, "6": {"title": "I found the 28 best Amazon Prime Day Apple deals of 2025 - CNN", "summary": "I found the 28 best Amazon Prime Day Apple deals of 2025 CNNPrime Day Apple deals are the lowest prices of 2025. Here’s what to buy before midnight USA TodayThese 15 Prime Day Deals on AirPods, App", "provider": "Fri, 11 Jul 2025 14:26:00 GMT"}, "7": {"title": "Meta Poached Apple’s Pang With Pay Package Over $200 Million - Yahoo Finance", "summary": "Meta Poached Apple’s Pang With Pay Package Over $200 Million Yahoo Finance", "provider": "Wed, 09 Jul 2025 22:31:35 GMT"}, "8": {"title": "Meta lures Apple AI expert with $200m pay offer - The Times", "summary": "Meta lures Apple AI expert with $200m pay offer The Times", "provider": "Thu, 10 Jul 2025 17:26:21 GMT"}, "9": {"title": "Meta Platforms Enticed Apple AI Executive With $200M Pay Package, Report Says - Investopedia", "summary": "Meta Platforms Enticed Apple AI Executive With $200M Pay Package, Report Says Investopedia", "provider": "Thu, 10 Jul 2025 14:59:26 GMT"}, "10": {"title": "Should Apple replace Tim Cook as CEO? These analysts are calling for dramatic change. - MarketWatch", "summary": "Should Apple replace Tim Cook as CEO? These analysts are calling for dramatic change. MarketWatch", "provider": "Wed, 09 Jul 2025 17:05:00 GMT"}, "11": {"title": "Apple, Visa and Mastercard win dismissal of merchant antitrust lawsuit over payment fees - Reuters", "summary": "Apple, Visa and Mastercard win dismissal of merchant antitrust lawsuit over payment fees Reuters", "provider": "Thu, 10 Jul 2025 15:44:16 GMT"}, "12": {"title": "Apple, Visa and Mastercard Antitrust Lawsuit Tossed by Federal Judge - PYMNTS.com", "summary": "Apple, Visa and Mastercard Antitrust Lawsuit Tossed by Federal Judge PYMNTS.com", "provider": "Fri, 11 Jul 2025 04:26:12 GMT"}, "13": {"title": "Apple, Mastercard, and Visa convince judge to dismiss collusion lawsuit - 9to5Mac", "summary": "Apple, Mastercard, and Visa convince judge to dismiss collusion lawsuit 9to5Mac", "provider": "Thu, 10 Jul 2025 20:23:00 GMT"}, "14": {"title": "I'm excited about this potentially massive Apple Watch AI health upgrade, but serious questions remain - TechRadar", "summary": "I'm excited about this potentially massive Apple Watch AI health upgrade, but serious questions remain TechRadar", "provider": "Fri, 11 Jul 2025 10:40:10 GMT"}, "15": {"title": "New Apple Watch AI Model Can Reveal Hidden Health Conditions - MacRumors", "summary": "New Apple Watch AI Model Can Reveal Hidden Health Conditions MacRumors", "provider": "Fri, 11 Jul 2025 05:53:14 GMT"}, "16": {"title": "Study: Apple’s newest AI model flags health conditions with up to 92% accuracy - 9to5Mac", "summary": "Study: Apple’s newest AI model flags health conditions with up to 92% accuracy 9to5Mac", "provider": "Thu, 10 Jul 2025 22:10:00 GMT"}, "17": {"title": "'Those of us who have backed Apple are worried' — Jim Cramer looks at the challenges - CNBC", "summary": "'Those of us who have backed Apple are worried' — Jim Cramer looks at the challenges CNBC", "provider": "Wed, 09 Jul 2025 19:23:43 GMT"}, "18": {"title": "Apple Maps in iOS 26 gains the proactive feature I’ve long needed - 9to5Mac", "summary": "Apple Maps in iOS 26 gains the proactive feature I’ve long needed 9to5Mac", "provider": "Thu, 10 Jul 2025 16:28:00 GMT"}, "19": {"title": "Apple Readies First Upgrade to Its Struggling Vision Pro Headset - Bloomberg", "summary": "Apple Readies First Upgrade to Its Struggling Vision Pro Headset Bloomberg", "provider": "Wed, 09 Jul 2025 17:10:10 GMT"}, "20": {"title": "Apple’s second-generation Vision Pro might launch this year - The Verge", "summary": "Apple’s second-generation Vision Pro might launch this year The Verge", "provider": "Wed, 09 Jul 2025 20:15:11 GMT"}, "21": {"title": "A cheaper Apple Vision is still a few years away - 9to5Mac", "summary": "A cheaper Apple Vision is still a few years away 9to5Mac", "provider": "Wed, 09 Jul 2025 17:35:00 GMT"}, "22": {"title": "Prime Day Apple deals: We found 19 record-low prices on AirPods, iPads, and Apple Watches - Mashable", "summary": "Prime Day Apple deals: We found 19 record-low prices on AirPods, iPads, and Apple Watches Mashable", "provider": "Fri, 11 Jul 2025 13:06:06 GMT"}, "23": {"title": "The Apple Watch Series 10 is still in stock and cheaper than ever for Prime Day - Engadget", "summary": "The Apple Watch Series 10 is still in stock and cheaper than ever for Prime Day Engadget", "provider": "Fri, 11 Jul 2025 12:11:26 GMT"}, "24": {"title": "Log your weight in Apple Health quickly and cheaply with this iPhone-compatible smart scale - 9to5Mac", "summary": "Log your weight in Apple Health quickly and cheaply with this iPhone-compatible smart scale 9to5Mac", "provider": "Fri, 11 Jul 2025 08:18:00 GMT"}, "25": {"title": "Prime Day Apple Deals: Record-Low Prices on AirPods and iPads - NBC News", "summary": "Prime Day Apple Deals: Record-Low Prices on AirPods and iPads NBC News", "provider": "Thu, 10 Jul 2025 23:54:00 GMT"}, "26": {"title": "Apple Arcade launches four new games in August - Apple", "summary": "Apple Arcade launches four new games in August Apple", "provider": "Tue, 08 Jul 2025 13:59:48 GMT"}, "27": {"title": "Save $200+ with Apple Prime Day deals on Day 3: AirPods, MacBooks, more - New York Post", "summary": "Save $200+ with Apple Prime Day deals on Day 3: AirPods, MacBooks, more New York Post", "provider": "Fri, 11 Jul 2025 13:05:00 GMT"}, "28": {"title": "We found the best Amazon Prime Day deals to shop today on TVs, tablets, headphones and more - Yahoo", "summary": "We found the best Amazon Prime Day deals to shop today on TVs, tablets, headphones and more Yahoo", "provider": "Fri, 11 Jul 2025 14:10:40 GMT"}, "29": {"title": "The clock is ticking on these incredible Prime Day Apple Watch deals - Macworld", "summary": "The clock is ticking on these incredible Prime Day Apple Watch deals Macworld", "provider": "Fri, 11 Jul 2025 06:26:38 GMT"}, "30": {"title": "Apple's upcoming low-cost MacBook: Colorful and affordable - AppleInsider", "summary": "Apple's upcoming low-cost MacBook: Colorful and affordable AppleInsider", "provider": "Fri, 11 Jul 2025 13:04:26 GMT"}, "31": {"title": "These Apple Products Are Coming in Early 2026 - MacRumors", "summary": "These Apple Products Are Coming in Early 2026 MacRumors", "provider": "Thu, 10 Jul 2025 19:24:08 GMT"}, "32": {"title": "Prime Day Apple deals still discount iPads and AirPods at record-low prices today on Amazon - Yahoo", "summary": "Prime Day Apple deals still discount iPads and AirPods at record-low prices today on Amazon Yahoo", "provider": "Fri, 11 Jul 2025 12:53:31 GMT"}, "33": {"title": "The Apple iPad Air M3 is still in stock and $120 off for Prime Day - Engadget", "summary": "The Apple iPad Air M3 is still in stock and $120 off for Prime Day Engadget", "provider": "Fri, 11 Jul 2025 13:05:35 GMT"}, "34": {"title": "The best Prime Day Apple deals on AirPods, iPads, MacBooks and more for the last day of the sale - Engadget", "summary": "The best Prime Day Apple deals on AirPods, iPads, MacBooks and more for the last day of the sale Engadget", "provider": "Fri, 11 Jul 2025 10:24:49 GMT"}, "35": {"title": "It's the last day to snag a 4-pack of Apple AirTags for $65 with this Prime Day deal - Yahoo", "summary": "It's the last day to snag a 4-pack of Apple AirTags for $65 with this Prime Day deal Yahoo", "provider": "Fri, 11 Jul 2025 14:26:00 GMT"}, "36": {"title": "Apple's latest iPad mini is down to a record low price for Prime Day, and still in stock - Engadget", "summary": "Apple's latest iPad mini is down to a record low price for Prime Day, and still in stock Engadget", "provider": "Fri, 11 Jul 2025 13:36:26 GMT"}, "37": {"title": "Apple's AirPods Pro 2 are still on sale for Prime Day and down to a record-low price - Engadget", "summary": "Apple's AirPods Pro 2 are still on sale for Prime Day and down to a record-low price Engadget", "provider": "Fri, 11 Jul 2025 11:46:36 GMT"}, "38": {"title": "Apple TV+ announces seventh season for celebrated spy drama “Slow Horses” - Apple", "summary": "Apple TV+ announces seventh season for celebrated spy drama “Slow Horses” Apple", "provider": "Tue, 08 Jul 2025 15:29:39 GMT"}, "39": {"title": "Apple Prime Day deals: AirPods, iPad, MacBook Air, iPhone 16 Pro, more - 9to5Mac", "summary": "Apple Prime Day deals: AirPods, iPad, MacBook Air, iPhone 16 Pro, more 9to5Mac", "provider": "Fri, 11 Jul 2025 12:00:00 GMT"}, "40": {"title": "Apple to Launch New Low-Cost 11-Inch iPad in the Spring - MacRumors", "summary": "Apple to Launch New Low-Cost 11-Inch iPad in the Spring MacRumors", "provider": "Fri, 11 Jul 2025 10:40:33 GMT"}, "41": {"title": "Best Prime Day Apple deals: My 45+ favorite sales live now - ZDNet", "summary": "Best Prime Day Apple deals: My 45+ favorite sales live now ZDNet", "provider": "Fri, 11 Jul 2025 11:09:00 GMT"}, "42": {"title": "Apple AirTags Make Me a Much Calmer Mom—And They’re on Major Sale Right Now - Parents", "summary": "Apple AirTags Make Me a Much Calmer Mom—And They’re on Major Sale Right Now Parents", "provider": "Thu, 10 Jul 2025 09:00:00 GMT"}, "43": {"title": "17 unmissable Apple deals in the Prime Day sale, chosen by a tech expert - The Independent", "summary": "17 unmissable Apple deals in the Prime Day sale, chosen by a tech expert The Independent", "provider": "Fri, 11 Jul 2025 08:36:25 GMT"}, "44": {"title": "The best Prime Day deals 2025: We found new price drops on Apple, Yeti, and Kindles — score over 60% off - Mashable", "summary": "The best Prime Day deals 2025: We found new price drops on Apple, Yeti, and Kindles — score over 60% off Mashable", "provider": "Fri, 11 Jul 2025 14:09:17 GMT"}, "45": {"title": "Best Prime Day deals still available: Apple AirPods 4 are at their lowest price ever and still in stock for the last day of the Amazon sale - Yahoo", "summary": "Best Prime Day deals still available: Apple AirPods 4 are at their lowest price ever and still in stock for the last day of the Amazon sale Yahoo", "provider": "Fri, 11 Jul 2025 14:35:29 GMT"}, "46": {"title": "You Don’t Need an iPad, but Do You Want One? Then These Prime Day Apple Deals Are for You - WIRED", "summary": "You Don’t Need an iPad, but Do You Want One? Then These Prime Day Apple Deals Are for You WIRED", "provider": "Thu, 10 Jul 2025 11:02:22 GMT"}, "47": {"title": "New AI model uses behavior data from Apple Watch for better health predictions - AppleInsider", "summary": "New AI model uses behavior data from Apple Watch for better health predictions AppleInsider", "provider": "Fri, 11 Jul 2025 12:17:17 GMT"}, "48": {"title": "This 'phenomenal' Apple Watch 10 deal is $120 off for Prime Day's last day, the lowest price ever - Yahoo", "summary": "This 'phenomenal' Apple Watch 10 deal is $120 off for Prime Day's last day, the lowest price ever Yahoo", "provider": "Fri, 11 Jul 2025 14:11:44 GMT"}, "49": {"title": "The Best Prime Day Apple Deals Are Ripe for the Picking - GQ", "summary": "The Best Prime Day Apple Deals Are Ripe for the Picking GQ", "provider": "Thu, 10 Jul 2025 12:48:59 GMT"}, "50": {"title": "Apple - The Verge", "summary": "Apple The Verge", "provider": "Wed, 09 Jul 2025 14:32:31 GMT"}, "51": {"title": "Last Chance Prime Day deals LIVE — 125+ deals still available on Apple, Kindles, TVs and more from the final day of Prime Day sales - Tom's Guide", "summary": "Last Chance Prime Day deals LIVE — 125+ deals still available on Apple, Kindles, TVs and more from the final day of Prime Day sales Tom's Guide", "provider": "Fri, 11 Jul 2025 12:20:32 GMT"}, "52": {"title": "Apple eyes US Formula 1 broadcast rights after 'F1: The Movie' success, FT reports - Reuters", "summary": "Apple eyes US Formula 1 broadcast rights after 'F1: The Movie' success, FT reports Reuters", "provider": "Wed, 09 Jul 2025 11:05:38 GMT"}, "53": {"title": "Apple’s M5 chip could continue an unexpected new trend: report - 9to5Mac", "summary": "Apple’s M5 chip could continue an unexpected new trend: report 9to5Mac", "provider": "Fri, 11 Jul 2025 14:29:00 GMT"}, "54": {"title": "Apple Needs Acquisition To Catch Up In AI Race, Analyst Says - Investor's Business Daily", "summary": "Apple Needs Acquisition To Catch Up In AI Race, Analyst Says Investor's Business Daily", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "55": {"title": "Apple names insider Sabih Khan as COO - Reuters", "summary": "Apple names insider Sabih Khan as COO Reuters", "provider": "Tue, 08 Jul 2025 21:29:03 GMT"}, "56": {"title": "The iPad Is the Tablet to Buy, and It's Under $300 Right Now - WIRED", "summary": "The iPad Is the Tablet to Buy, and It's Under $300 Right Now WIRED", "provider": "Fri, 11 Jul 2025 11:14:13 GMT"}, "57": {"title": "Apple's Formula for F1 - Spyglass.org", "summary": "Apple's Formula for F1 Spyglass.org", "provider": "Wed, 09 Jul 2025 14:14:56 GMT"}, "58": {"title": "These jaw-dropping AirPods Prime Day deals are music to our ears - Macworld", "summary": "These jaw-dropping AirPods Prime Day deals are music to our ears Macworld", "provider": "Fri, 11 Jul 2025 10:11:00 GMT"}, "59": {"title": "Apple Wins Dismissal in Payments Conspiracy Lawsuit - MacRumors", "summary": "Apple Wins Dismissal in Payments Conspiracy Lawsuit MacRumors", "provider": "Fri, 11 Jul 2025 05:27:03 GMT"}}, "Amazon": {"0": {"title": "Amazon Prime Day deals end tonight: It’s the last day to get up to 70% off Apple, Samsung, Dyson and more - Yahoo", "summary": "Amazon Prime Day deals end tonight: It’s the last day to get up to 70% off Apple, Samsung, Dyson and more YahooThe last day of Amazon Prime Day is here. Our experts found the 161 deals worth shoppi", "provider": "Fri, 11 Jul 2025 13:48:28 GMT"}, "1": {"title": "TikTok poached Amazon employees to jump-start its US business. Now it's doubling down on its Chinese roots. - Business Insider", "summary": "TikTok poached Amazon employees to jump-start its US business. Now it's doubling down on its Chinese roots. Business Insider", "provider": "Fri, 11 Jul 2025 14:35:00 GMT"}, "2": {"title": "We found the best Amazon Prime Day deals to shop today on TVs, tablets, headphones and more - Yahoo", "summary": "We found the best Amazon Prime Day deals to shop today on TVs, tablets, headphones and more Yahoo", "provider": "Fri, 11 Jul 2025 14:10:40 GMT"}, "3": {"title": "It's the Final Hours of Prime Day: We're Tracking the Deals + Trends - WIRED", "summary": "It's the Final Hours of Prime Day: We're Tracking the Deals + Trends WIRED", "provider": "Thu, 10 Jul 2025 19:31:29 GMT"}, "4": {"title": "The best Prime Day deals 2025: Our favorite 140+ sales live at the end of the sale - ZDNet", "summary": "The best Prime Day deals 2025: Our favorite 140+ sales live at the end of the sale ZDNet", "provider": "Fri, 11 Jul 2025 14:00:00 GMT"}, "5": {"title": "70 Most Popular Amazon Prime Day Deals You Won't Want to Miss - TODAY.com", "summary": "70 Most Popular Amazon Prime Day Deals You Won't Want to Miss TODAY.com", "provider": "Fri, 11 Jul 2025 12:04:00 GMT"}, "6": {"title": "It's the Last Day to Shop Amazon Prime Day — Here Are the 60 Final Deals We Stand By - Good Housekeeping", "summary": "It's the Last Day to Shop Amazon Prime Day — Here Are the 60 Final Deals We Stand By Good Housekeeping", "provider": "Fri, 11 Jul 2025 13:41:00 GMT"}, "7": {"title": "We’ve Been Tracking Prime Day Deals For Over 58 Hours—Here Are The 137 Best To Shop Before It’s Over - Forbes", "summary": "We’ve Been Tracking Prime Day Deals For Over 58 Hours—Here Are The 137 Best To Shop Before It’s Over Forbes", "provider": "Fri, 11 Jul 2025 12:17:00 GMT"}, "8": {"title": "Don’t Miss 77% Off Must-Have Kitchen Essentials - Bon Appétit", "summary": "Don’t Miss 77% Off Must-Have Kitchen Essentials Bon Appétit", "provider": "Fri, 11 Jul 2025 12:07:00 GMT"}, "9": {"title": "The best Amazon Prime Day deals end tonight. Here are the most popular picks you can still buy - USA Today", "summary": "The best Amazon Prime Day deals end tonight. Here are the most popular picks you can still buy USA Today", "provider": "Fri, 11 Jul 2025 09:33:45 GMT"}, "10": {"title": "Prime Day TV deals are the best I've seen in years - Mashable", "summary": "Prime Day TV deals are the best I've seen in years Mashable", "provider": "Fri, 11 Jul 2025 07:09:30 GMT"}, "11": {"title": "The 150+ best Prime Day deals still available – don't miss these top offers I recommend as a shopping expert - TechRadar", "summary": "The 150+ best Prime Day deals still available – don't miss these top offers I recommend as a shopping expert TechRadar", "provider": "Fri, 11 Jul 2025 14:06:28 GMT"}, "12": {"title": "Last Chance Prime Day deals LIVE — 125+ deals still available on Apple, Kindles, TVs and more from the final day of Prime Day sales - Tom's Guide", "summary": "Last Chance Prime Day deals LIVE — 125+ deals still available on Apple, Kindles, TVs and more from the final day of Prime Day sales Tom's Guide", "provider": "Fri, 11 Jul 2025 12:20:32 GMT"}, "13": {"title": "Amazon Prime Day deals are now up to 70% off: Top finds from Apple, Samsung, Dyson and more - Yahoo", "summary": "Amazon Prime Day deals are now up to 70% off: Top finds from Apple, Samsung, Dyson and more Yahoo", "provider": "Fri, 11 Jul 2025 11:26:18 GMT"}, "14": {"title": "The best Amazon Prime Day Lightning Deals happening now - CNN", "summary": "The best Amazon Prime Day Lightning Deals happening now CNN", "provider": "Fri, 11 Jul 2025 13:48:00 GMT"}, "15": {"title": "I found the 28 best Amazon Prime Day Apple deals of 2025 - CNN", "summary": "I found the 28 best Amazon Prime Day Apple deals of 2025 CNN", "provider": "Fri, 11 Jul 2025 14:26:00 GMT"}, "16": {"title": "I’m over 40, and I swear by these Amazon Prime Day beauty deals to delay the signs of aging - CNN", "summary": "I’m over 40, and I swear by these Amazon Prime Day beauty deals to delay the signs of aging CNN", "provider": "Fri, 11 Jul 2025 00:05:00 GMT"}, "17": {"title": "Amazon Has Tons of Nintendo Switch Games on Sale for Prime Day, But They'll Be Back To Full Price Soon - IGN", "summary": "Amazon Has Tons of Nintendo Switch Games on Sale for Prime Day, But They'll Be Back To Full Price Soon IGN", "provider": "Fri, 11 Jul 2025 08:48:45 GMT"}, "18": {"title": "191+ best Prime Day deals still live on Day 4: Updated before sales end tonight - New York Post", "summary": "191+ best Prime Day deals still live on Day 4: Updated before sales end tonight New York Post", "provider": "Fri, 11 Jul 2025 14:14:00 GMT"}, "19": {"title": "It's Your Last Chance to Score the Best Prime Day Deals Under $100 - GQ", "summary": "It's Your Last Chance to Score the Best Prime Day Deals Under $100 GQ", "provider": "Fri, 11 Jul 2025 13:24:08 GMT"}, "20": {"title": "I've Looked at Nearly Every Amazon Prime Day Laptop Deal and These Are the Best - PCMag", "summary": "I've Looked at Nearly Every Amazon Prime Day Laptop Deal and These Are the Best PCMag", "provider": "Fri, 11 Jul 2025 13:08:42 GMT"}, "21": {"title": "It’s the Final Countdown! Shop Vogue’s Fashion Editors Must-Have Find - Vogue", "summary": "It’s the Final Countdown! Shop Vogue’s Fashion Editors Must-Have Find Vogue", "provider": "Fri, 11 Jul 2025 13:01:00 GMT"}, "22": {"title": "US judge admonishes Amazon over disclosures in FTC lawsuit over Prime service - Reuters", "summary": "US judge admonishes Amazon over disclosures in FTC lawsuit over Prime service Reuters", "provider": "Thu, 10 Jul 2025 23:13:59 GMT"}, "23": {"title": "Is Amazon’s Prime Day sale losing its appeal? Some early data suggest shoppers are spending less this year. - MarketWatch", "summary": "Is Amazon’s Prime Day sale losing its appeal? Some early data suggest shoppers are spending less this year. MarketWatch", "provider": "Thu, 10 Jul 2025 20:52:00 GMT"}, "24": {"title": "We Rarely See Amazon Prime Day Deals This Good - SELF Magazine", "summary": "We Rarely See Amazon Prime Day Deals This Good SELF Magazine", "provider": "Fri, 11 Jul 2025 11:48:11 GMT"}, "25": {"title": "Last Chance to Save Big: I Found 7 Excellent TVs With Major Prime Day Discounts - PCMag", "summary": "Last Chance to Save Big: I Found 7 Excellent TVs With Major Prime Day Discounts PCMag", "provider": "Fri, 11 Jul 2025 14:05:37 GMT"}, "26": {"title": "The last day of Amazon Prime Day deals include Fire Tablets up to 56% off - Yahoo", "summary": "The last day of Amazon Prime Day deals include Fire Tablets up to 56% off Yahoo", "provider": "Fri, 11 Jul 2025 14:27:12 GMT"}, "27": {"title": "Refresh your summer style with the best Amazon Prime Day clothing deals - CNN", "summary": "Refresh your summer style with the best Amazon Prime Day clothing deals CNN", "provider": "Thu, 10 Jul 2025 21:30:00 GMT"}, "28": {"title": "‘Still early in the event’: Amazon defends 41% Prime Day sales drop report - MyNorthwest.com", "summary": "‘Still early in the event’: Amazon defends 41% Prime Day sales drop report MyNorthwest.com", "provider": "Thu, 10 Jul 2025 20:34:41 GMT"}, "29": {"title": "These jaw-dropping AirPods Prime Day deals are music to our ears - Macworld", "summary": "These jaw-dropping AirPods Prime Day deals are music to our ears Macworld", "provider": "Fri, 11 Jul 2025 10:11:00 GMT"}, "30": {"title": "It’s day three of Amazon Prime Day 2025, and the pickings are plentiful - The Verge", "summary": "It’s day three of Amazon Prime Day 2025, and the pickings are plentiful The Verge", "provider": "Fri, 11 Jul 2025 03:40:00 GMT"}, "31": {"title": "240+ Best Prime Day Deals, Painstakingly Handpicked and Vetted - GQ", "summary": "240+ Best Prime Day Deals, Painstakingly Handpicked and Vetted GQ", "provider": "Thu, 10 Jul 2025 21:04:28 GMT"}, "32": {"title": "The 5 best Amazon device deals we're recommending on Prime Day 2025 - Mashable", "summary": "The 5 best Amazon device deals we're recommending on Prime Day 2025 Mashable", "provider": "Fri, 11 Jul 2025 07:08:06 GMT"}, "33": {"title": "Amazon Prime Day is still offering deals on laptops today: Up to 46% off Apple MacBooks, Acer, Dell and more - Yahoo", "summary": "Amazon Prime Day is still offering deals on laptops today: Up to 46% off Apple MacBooks, Acer, Dell and more Yahoo", "provider": "Fri, 11 Jul 2025 14:31:22 GMT"}, "34": {"title": "These are the best Amazon Prime Day TV deals from Sony, LG, Samsung and others to get before the sale ends - Engadget", "summary": "These are the best Amazon Prime Day TV deals from Sony, LG, Samsung and others to get before the sale ends Engadget", "provider": "Fri, 11 Jul 2025 13:05:13 GMT"}, "35": {"title": "Amazon's First Ever Prime Day 3 Is Happening Now — We Found the 100+ Best Deals - People.com", "summary": "Amazon's First Ever Prime Day 3 Is Happening Now — We Found the 100+ Best Deals People.com", "provider": "Thu, 10 Jul 2025 23:00:00 GMT"}, "36": {"title": "Amazon Prime Day Ends Tonight. Here Are 100+ of The Best Deals We've Found. | Reviews by Wirecutter - The New York Times", "summary": "Amazon Prime Day Ends Tonight. Here Are 100+ of The Best Deals We've Found. | Reviews by Wirecutter The New York Times", "provider": "Fri, 11 Jul 2025 14:36:12 GMT"}, "37": {"title": "Amazon Prime Day ends July 11: Here's everything to know before the sale ends - ZDNet", "summary": "Amazon Prime Day ends July 11: Here's everything to know before the sale ends ZDNet", "provider": "Thu, 10 Jul 2025 21:29:00 GMT"}, "38": {"title": "The best Amazon Prime Day deals under $50 that you can get before the event is over - Engadget", "summary": "The best Amazon Prime Day deals under $50 that you can get before the event is over Engadget", "provider": "Fri, 11 Jul 2025 12:24:58 GMT"}, "39": {"title": "It’s the Last Day of Prime Day, and Our Editors Found the Best Deals Still Live - TODAY.com", "summary": "It’s the Last Day of Prime Day, and Our Editors Found the Best Deals Still Live TODAY.com", "provider": "Fri, 11 Jul 2025 08:53:00 GMT"}, "40": {"title": "We found the best Amazon Prime Day deals you may have missed - CNN", "summary": "We found the best Amazon Prime Day deals you may have missed CNN", "provider": "Thu, 10 Jul 2025 21:01:00 GMT"}, "41": {"title": "35 Amazon Prime Day Patio Furniture Deals That Are On Their Way Out - Architectural Digest", "summary": "35 Amazon Prime Day Patio Furniture Deals That Are On Their Way Out Architectural Digest", "provider": "Fri, 11 Jul 2025 10:14:00 GMT"}, "42": {"title": "Our Eyes (and Ears) Can't Believe These Prime Day Earbud and Headphone Deals - PCMag", "summary": "Our Eyes (and Ears) Can't Believe These Prime Day Earbud and Headphone Deals PCMag", "provider": "Fri, 11 Jul 2025 07:34:48 GMT"}, "43": {"title": "I found the 26 best Amazon Prime Day Apple deals of 2025 - CNN", "summary": "I found the 26 best Amazon Prime Day Apple deals of 2025 CNN", "provider": "Thu, 10 Jul 2025 23:40:00 GMT"}, "44": {"title": "Intel Offloads RealSense as Tesla, Amazon Drive Robotics Gold Rush - Yahoo Finance", "summary": "Intel Offloads RealSense as Tesla, Amazon Drive Robotics Gold Rush Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:47:14 GMT"}, "45": {"title": "You can (finally) buy the Nintendo Switch 2 on Amazon (but don't expect a Prime Day deal) - Engadget", "summary": "You can (finally) buy the Nintendo Switch 2 on Amazon (but don't expect a Prime Day deal) Engadget", "provider": "Thu, 10 Jul 2025 22:56:32 GMT"}, "46": {"title": "Our PC expert found the 28 best Amazon Prime Day laptop and computer deals of 2025 - CNN", "summary": "Our PC expert found the 28 best Amazon Prime Day laptop and computer deals of 2025 CNN", "provider": "Fri, 11 Jul 2025 10:44:00 GMT"}, "47": {"title": "Fresh Amazon Prime Day Deals Continue To Surprise Us—We're Tracking Live - WIRED", "summary": "Fresh Amazon Prime Day Deals Continue To Surprise Us—We're Tracking Live WIRED", "provider": "Wed, 09 Jul 2025 18:46:06 GMT"}, "48": {"title": "These Prime Day MacBook deals make it a great time to buy a new laptop - Macworld", "summary": "These Prime Day MacBook deals make it a great time to buy a new laptop Macworld", "provider": "Fri, 11 Jul 2025 11:30:00 GMT"}, "49": {"title": "Amazon’s Prime Day event is back this July - AboutAmazon.com", "summary": "Amazon’s Prime Day event is back this July AboutAmazon.com", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "50": {"title": "27 Menswear Deals You Definitely Won't Find on Amazon in 2025 - GQ", "summary": "27 Menswear Deals You Definitely Won't Find on Amazon in 2025 GQ", "provider": "Fri, 11 Jul 2025 11:45:00 GMT"}, "51": {"title": "Vertiv Stock Is Falling. Amazon Launches a Cooling Competitor for AI Servers. - Barron's", "summary": "Vertiv Stock Is Falling. Amazon Launches a Cooling Competitor for AI Servers. Barron's", "provider": "Thu, 10 Jul 2025 19:01:00 GMT"}, "52": {"title": "Best Prime Day laptop deals 2025: Live updates on MacBooks, Windows, and more discounts - ZDNet", "summary": "Best Prime Day laptop deals 2025: Live updates on MacBooks, Windows, and more discounts ZDNet", "provider": "Fri, 11 Jul 2025 12:55:00 GMT"}, "53": {"title": "The Best Amazon Prime Day Deals Are Actually On Bird Feeders, Cast-Iron Skillets, And More Items For Your Home - Southern Living", "summary": "The Best Amazon Prime Day Deals Are Actually On Bird Feeders, Cast-Iron Skillets, And More Items For Your Home Southern Living", "provider": "Fri, 11 Jul 2025 11:40:00 GMT"}, "54": {"title": "I've tested tons of soundbars, and these are the only ones I'd recommend buying this Prime Day – but the deals end tonight! - TechRadar", "summary": "I've tested tons of soundbars, and these are the only ones I'd recommend buying this Prime Day – but the deals end tonight! TechRadar", "provider": "Fri, 11 Jul 2025 08:07:44 GMT"}, "55": {"title": "How Amazon is helping flood-impacted communities across central Texas - AboutAmazon.com", "summary": "How Amazon is helping flood-impacted communities across central Texas AboutAmazon.com", "provider": "Mon, 07 Jul 2025 23:12:59 GMT"}, "56": {"title": "The Best Amazon Prime Day Deals Under $50 - TODAY.com", "summary": "The Best Amazon Prime Day Deals Under $50 TODAY.com", "provider": "Thu, 10 Jul 2025 16:00:00 GMT"}, "57": {"title": "Live updates: It's the last day of Prime Day sales. The best deals we're finding right now - KOCO", "summary": "Live updates: It's the last day of Prime Day sales. The best deals we're finding right now KOCO", "provider": "Fri, 11 Jul 2025 13:00:00 GMT"}, "58": {"title": "I Swear By These 7 Kitchen Products, and They’re Still on Sale for Amazon Prime Day - Food & Wine", "summary": "I Swear By These 7 Kitchen Products, and They’re Still on Sale for Amazon Prime Day Food & Wine", "provider": "Fri, 11 Jul 2025 10:00:00 GMT"}, "59": {"title": "We Found the Best Prime Day Deals Out of the 300K+ We Tracked - TODAY.com", "summary": "We Found the Best Prime Day Deals Out of the 300K+ We Tracked TODAY.com", "provider": "Wed, 09 Jul 2025 21:31:00 GMT"}}, "Alphabet": {"0": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - TipRanks", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In TipRanks", "provider": "Fri, 11 Jul 2025 10:23:18 GMT"}, "1": {"title": "Alphabet Vs. OpenAI: Why I'm Not Panicking About Chrome (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet Vs. OpenAI: Why I'm Not Panicking About Chrome (NASDAQ:GOOGL) Seeking Alpha", "provider": "Thu, 10 Jul 2025 14:53:00 GMT"}, "2": {"title": "Alphabet: Buying Opportunities Like This Don't Come Often (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet: Buying Opportunities Like This Don't Come Often (NASDAQ:GOOGL) Seeking AlphaAnalyst Explains Why Alphabet (GOOG) is ‘Real Alpha’ for Portfolios Yahoo FinanceWhy Wall Street analysts think", "provider": "Wed, 09 Jul 2025 13:20:00 GMT"}, "3": {"title": "Alphabet-owned company to begin human trials for cancer drug developed using AI - The Indian Express", "summary": "Alphabet-owned company to begin human trials for cancer drug developed using AI The Indian Express", "provider": "Wed, 09 Jul 2025 03:31:00 GMT"}, "4": {"title": "Alphabet's Google Fined $8.9 Million by Turkish Competition Authority - MarketScreener", "summary": "Alphabet's Google Fined $8.9 Million by Turkish Competition Authority MarketScreener", "provider": "Thu, 10 Jul 2025 15:43:24 GMT"}, "5": {"title": "The secret alphabet actors use that lets you pronounce any word in any language or accent - Upworthy", "summary": "The secret alphabet actors use that lets you pronounce any word in any language or accent Upworthy", "provider": "Wed, 09 Jul 2025 01:35:15 GMT"}, "6": {"title": "Google faces threat that could destroy its business - TheStreet", "summary": "Google faces threat that could destroy its business TheStreet", "provider": "Thu, 10 Jul 2025 15:03:00 GMT"}, "7": {"title": "Alphabet Is Rethinking Board Risk Oversight—Should You As Well? - Bloomberg Law News", "summary": "Alphabet Is Rethinking Board Risk Oversight—Should You As Well? Bloomberg Law News", "provider": "Fri, 11 Jul 2025 08:30:00 GMT"}, "8": {"title": "Billionaires Are Buying This Quantum Computing Stock Hand Over Fist (Hint: It's Not IonQ or D-Wave Quantum) - The Motley Fool", "summary": "Billionaires Are Buying This Quantum Computing Stock Hand Over Fist (Hint: It's Not IonQ or D-Wave Quantum) The Motley Fool", "provider": "Tue, 08 Jul 2025 08:51:00 GMT"}, "9": {"title": "Waymo Tests Bring NYC One Step Closer to Autonomous Taxis - Bloomberg", "summary": "Waymo Tests Bring NYC One Step Closer to Autonomous Taxis Bloomberg", "provider": "Tue, 08 Jul 2025 16:47:19 GMT"}, "10": {"title": "Protecting Your Alphabet Position as Regulators Close In - Yahoo Finance", "summary": "Protecting Your Alphabet Position as Regulators Close In Yahoo Finance", "provider": "Fri, 11 Jul 2025 11:26:41 GMT"}, "11": {"title": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why - Insider Monkey", "summary": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why Insider Monkey", "provider": "Fri, 11 Jul 2025 10:37:27 GMT"}, "12": {"title": "Do Options Traders Know Something About Alphabet Stock We Don't? - TradingView", "summary": "Do Options Traders Know Something About Alphabet Stock We Don't? TradingView", "provider": "Fri, 11 Jul 2025 12:34:00 GMT"}, "13": {"title": "A Once-in-a-Decade Opportunity: Alphabet's Stock Looks Like a Brilliant Buy Right Now - The Motley Fool", "summary": "A Once-in-a-Decade Opportunity: Alphabet's Stock Looks Like a Brilliant Buy Right Now The Motley Fool", "provider": "Mon, 07 Jul 2025 09:15:00 GMT"}, "14": {"title": "Check Out Lubbock’s Alphabet Dating Challenge! Here’s Letter J - FMX 94.5", "summary": "Check Out Lubbock’s Alphabet Dating Challenge! Here’s Letter J FMX 94.5", "provider": "Wed, 09 Jul 2025 17:03:03 GMT"}, "15": {"title": "Bitcoin hits new all-time high, outpaces Meta, Alphabet, Saudi Aramco - Informed crypto news", "summary": "Bitcoin hits new all-time high, outpaces Meta, Alphabet, Saudi Aramco Informed crypto news", "provider": "Fri, 11 Jul 2025 10:54:09 GMT"}, "16": {"title": "Alphabet Forges New Cup Base. Is Google Stock A Buy Amid Search Worries? - Investor's Business Daily", "summary": "Alphabet Forges New Cup Base. Is Google Stock A Buy Amid Search Worries? Investor's Business Daily", "provider": "Mon, 07 Jul 2025 11:52:00 GMT"}, "17": {"title": "2 Undervalued AI Stocks Poised for Explosive Growth - The Globe and Mail", "summary": "2 Undervalued AI Stocks Poised for Explosive Growth The Globe and Mail", "provider": "Fri, 11 Jul 2025 12:54:34 GMT"}, "18": {"title": "The Zacks Analyst Blog Highlights Tesla, Alphabet and Amazon - Yahoo Finance", "summary": "The Zacks Analyst Blog Highlights Tesla, Alphabet and Amazon Yahoo Finance", "provider": "Fri, 11 Jul 2025 09:12:00 GMT"}, "19": {"title": "Why Alphabet’s (GOOGL) Valuation Hints at Stock Rebound - TipRanks", "summary": "Why Alphabet’s (GOOGL) Valuation Hints at Stock Rebound TipRanks", "provider": "Thu, 10 Jul 2025 23:47:24 GMT"}, "20": {"title": "Why Alphabet Stock Popped Today - The Motley Fool", "summary": "Why Alphabet Stock Popped Today The Motley Fool", "provider": "Wed, 09 Jul 2025 19:34:00 GMT"}, "21": {"title": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors - Yahoo Finance", "summary": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors Yahoo Finance", "provider": "Tue, 08 Jul 2025 21:45:04 GMT"}, "22": {"title": "Alphabet price target raised to $200 from $195 at JPMorgan - TipRanks", "summary": "Alphabet price target raised to $200 from $195 at JPMorgan TipRanks", "provider": "Fri, 11 Jul 2025 11:28:02 GMT"}, "23": {"title": "Prediction: Alphabet's Stock Will Deliver Monster Performance Over the Next 2 Years - The Motley Fool", "summary": "Prediction: Alphabet's Stock Will Deliver Monster Performance Over the Next 2 Years The Motley Fool", "provider": "Sun, 06 Jul 2025 09:30:00 GMT"}, "24": {"title": "The Zacks Analyst Blog Highlights Alphabet, Microsoft, Amazon and NVIDIA - Yahoo Finance", "summary": "The Zacks Analyst Blog Highlights Alphabet, Microsoft, Amazon and NVIDIA Yahoo Finance", "provider": "Wed, 09 Jul 2025 10:02:00 GMT"}, "25": {"title": "Alphabet's Growth Catalysts Overly Discounted - Double-Down Strong Buy Opportunity - Seeking Alpha", "summary": "Alphabet's Growth Catalysts Overly Discounted - Double-Down Strong Buy Opportunity Seeking Alpha", "provider": "Wed, 09 Jul 2025 13:30:00 GMT"}, "26": {"title": "Lawmakers Just Accidentally Made Alphabet Irresistibly Attractive (NASDAQ:GOOG) - Seeking Alpha", "summary": "Lawmakers Just Accidentally Made Alphabet Irresistibly Attractive (NASDAQ:GOOG) Seeking Alpha", "provider": "Sat, 05 Jul 2025 08:21:00 GMT"}, "27": {"title": "Mixed options sentiment in Alphabet Class A with shares up 0.57% - TipRanks", "summary": "Mixed options sentiment in Alphabet Class A with shares up 0.57% TipRanks", "provider": "Thu, 10 Jul 2025 20:45:56 GMT"}, "28": {"title": "Alphabet: Being Optimistic When Others Are Pessimistic - Seeking Alpha", "summary": "Alphabet: Being Optimistic When Others Are Pessimistic Seeking Alpha", "provider": "Mon, 07 Jul 2025 09:54:00 GMT"}, "29": {"title": "Alphabet Breakup Could Unleash Cloud Growth -- Analyst Calls It a 'Top Pick' - Yahoo Finance", "summary": "Alphabet Breakup Could Unleash Cloud Growth -- Analyst Calls It a 'Top Pick' Yahoo Finance", "provider": "Thu, 03 Jul 2025 19:30:57 GMT"}, "30": {"title": "Google’s Unloved Stock Makes It a Big Tech Bargain - WSJ - The Wall Street Journal", "summary": "Google’s Unloved Stock Makes It a Big Tech Bargain - WSJ The Wall Street Journal", "provider": "Wed, 09 Jul 2025 09:30:00 GMT"}, "31": {"title": "Legends Live @Citi: Ruth Porat - Citigroup", "summary": "Legends Live @Citi: Ruth Porat Citigroup", "provider": "Wed, 09 Jul 2025 18:23:29 GMT"}, "32": {"title": "Alphabet: Technical Momentum Is Starting to Turn - TradingView", "summary": "Alphabet: Technical Momentum Is Starting to Turn TradingView", "provider": "Thu, 10 Jul 2025 19:55:00 GMT"}, "33": {"title": "Alphabet (GOOGL) Declines More Than Market: Some Information for Investors - Yahoo Finance", "summary": "Alphabet (GOOGL) Declines More Than Market: Some Information for Investors Yahoo Finance", "provider": "Tue, 08 Jul 2025 21:45:04 GMT"}, "34": {"title": "Isomorphic Labs has grand ambitions to 'solve all diseases' with AI. Now, it's gearing up for its first human trials - Fortune", "summary": "Isomorphic Labs has grand ambitions to 'solve all diseases' with AI. Now, it's gearing up for its first human trials Fortune", "provider": "Sun, 06 Jul 2025 13:00:00 GMT"}, "35": {"title": "Her 15-year-old son died subway surfing. Now this Alphabet City mother is taking TikTok and Instagram to court - amNewYork", "summary": "Her 15-year-old son died subway surfing. Now this Alphabet City mother is taking TikTok and Instagram to court amNewYork", "provider": "Wed, 09 Jul 2025 21:00:49 GMT"}, "36": {"title": "Alphabet: Quiet AI Edge Wall Street Shouldn't Ignore (NASDAQ:GOOG) - Seeking Alpha", "summary": "Alphabet: Quiet AI Edge Wall Street Shouldn't Ignore (NASDAQ:GOOG) Seeking Alpha", "provider": "Mon, 07 Jul 2025 01:51:00 GMT"}, "37": {"title": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 - Yahoo Finance", "summary": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 Yahoo Finance", "provider": "Wed, 09 Jul 2025 21:27:01 GMT"}, "38": {"title": "Alphabet's $500M Investor Deal Over Compliance Gets 1st OK - Law360", "summary": "Alphabet's $500M Investor Deal Over Compliance Gets 1st OK Law360", "provider": "Wed, 09 Jul 2025 02:25:00 GMT"}, "39": {"title": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 - Insider Monkey", "summary": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 Insider Monkey", "provider": "Wed, 09 Jul 2025 21:31:05 GMT"}, "40": {"title": "Why Alphabet Stock Popped Today - AOL.com", "summary": "Why Alphabet Stock Popped Today AOL.com", "provider": "Wed, 09 Jul 2025 20:34:14 GMT"}, "41": {"title": "Why Alphabet Stock Popped Today - MSN", "summary": "Why Alphabet Stock Popped Today MSN", "provider": "Wed, 09 Jul 2025 20:12:33 GMT"}, "42": {"title": "EU Releases AI Code As Alphabet, OpenAI, Review Participation - Stocktwits", "summary": "EU Releases AI Code As Alphabet, OpenAI, Review Participation Stocktwits", "provider": "Wed, 09 Jul 2025 01:04:43 GMT"}, "43": {"title": "Alphabet's Internet Startup Eyes Federal Funding to Help It Compete With Starlink - PCMag", "summary": "Alphabet's Internet Startup Eyes Federal Funding to Help It Compete With Starlink PCMag", "provider": "Mon, 07 Jul 2025 18:28:26 GMT"}, "44": {"title": "Alphabet Inc. (GOOG) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "Alphabet Inc. (GOOG) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Mon, 07 Jul 2025 13:00:02 GMT"}, "45": {"title": "Why Wall Street Still Trusts Alphabet’s (GOOGL) Google Search, Even With ChatGPT on the Rise - Yahoo Finance", "summary": "Why Wall Street Still Trusts Alphabet’s (GOOGL) Google Search, Even With ChatGPT on the Rise Yahoo Finance", "provider": "Sat, 05 Jul 2025 16:58:08 GMT"}, "46": {"title": "Alphabet price target raised on strong AI adoption, Waymo valuation - Proactive financial news", "summary": "Alphabet price target raised on strong AI adoption, Waymo valuation Proactive financial news", "provider": "Wed, 09 Jul 2025 18:29:00 GMT"}, "47": {"title": "Vacant Alphabet Streets Lot Lists for $1.99M After Price Cuts - Yo! Venice!", "summary": "Vacant Alphabet Streets Lot Lists for $1.99M After Price Cuts Yo! Venice!", "provider": "Mon, 07 Jul 2025 18:41:44 GMT"}, "48": {"title": "Alphabet (GOOGL) Rolls out Gemini 2.5 - Insider Monkey", "summary": "Alphabet (GOOGL) Rolls out Gemini 2.5 Insider Monkey", "provider": "Wed, 09 Jul 2025 04:51:03 GMT"}, "49": {"title": "British Antitrust Case Threatens to Derail Alphabet’s (GOOGL) Monopoly - TipRanks", "summary": "British Antitrust Case Threatens to Derail Alphabet’s (GOOGL) Monopoly TipRanks", "provider": "Wed, 09 Jul 2025 01:27:23 GMT"}, "50": {"title": "Expect Solid Earnings From Alphabet. AI Search Is ‘Google’s War to Lose.’ - Barron's", "summary": "Expect Solid Earnings From Alphabet. AI Search Is ‘Google’s War to Lose.’ Barron's", "provider": "Wed, 02 Jul 2025 16:23:00 GMT"}, "51": {"title": "Alphabet stock jumps as this analyst maintain buy rating - TradingView", "summary": "Alphabet stock jumps as this analyst maintain buy rating TradingView", "provider": "Wed, 09 Jul 2025 19:52:59 GMT"}, "52": {"title": "TD Cowen reiterates Buy rating on Alphabet stock, citing AI Mode rollout - Investing.com", "summary": "TD Cowen reiterates Buy rating on Alphabet stock, citing AI Mode rollout Investing.com", "provider": "Wed, 09 Jul 2025 10:19:36 GMT"}, "53": {"title": "Alphabet unit using AI to design medicines faster, plans human trials - Pharmacy Business", "summary": "Alphabet unit using AI to design medicines faster, plans human trials Pharmacy Business", "provider": "Fri, 11 Jul 2025 08:28:41 GMT"}, "54": {"title": "How Alphabet (GOOGL) is Poised to Dominate the Driverless Car Revolution Through Waymo - TipRanks", "summary": "How Alphabet (GOOGL) is Poised to Dominate the Driverless Car Revolution Through Waymo TipRanks", "provider": "Tue, 08 Jul 2025 23:41:49 GMT"}, "55": {"title": "Mixed options sentiment in Alphabet Class A with shares up 2.01% - TipRanks", "summary": "Mixed options sentiment in Alphabet Class A with shares up 2.01% TipRanks", "provider": "Wed, 09 Jul 2025 16:17:39 GMT"}, "56": {"title": "I'm Sorry To Break This To You, But There's Only A 75% Chance You'll Pass This Disney A–Z Character Quiz - BuzzFeed", "summary": "I'm Sorry To Break This To You, But There's Only A 75% Chance You'll Pass This Disney A–Z Character Quiz BuzzFeed", "provider": "Sat, 28 Jun 2025 07:00:00 GMT"}, "57": {"title": "Alphabet: Patience Pays When Waymo Will Likely Be Huge By 2040 (NASDAQ:GOOG) - Seeking Alpha", "summary": "Alphabet: Patience Pays When Waymo Will Likely Be Huge By 2040 (NASDAQ:GOOG) Seeking Alpha", "provider": "Tue, 01 Jul 2025 07:00:00 GMT"}, "58": {"title": "Alphabet price target raised to $220 from $200 at Oppenheimer - TipRanks", "summary": "Alphabet price target raised to $220 from $200 at Oppenheimer TipRanks", "provider": "Wed, 09 Jul 2025 14:03:11 GMT"}, "59": {"title": "Did OpenAI and Perplexity Say \"Checkmate\" to Google?! - MSN", "summary": "Did OpenAI and Perplexity Say \"Checkmate\" to Google?! MSN", "provider": "Thu, 10 Jul 2025 16:13:46 GMT"}}, "Tesla": {"0": {"title": "Tesla Stock Drops. There’s Bad News on Batteries for Musk's EV Maker. - Barron's", "summary": "Tesla Stock Drops. There’s Bad News on Batteries for Musk's EV Maker. Barron's", "provider": "Fri, 11 Jul 2025 14:04:00 GMT"}, "1": {"title": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says - Reuters", "summary": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says Reuters", "provider": "Fri, 11 Jul 2025 03:49:00 GMT"}, "2": {"title": "Tesla is no longer a car company: China just paid it $557 million to build the country's largest battery - The News Wheel", "summary": "Tesla is no longer a car company: China just paid it $557 million to build the country's largest battery The News Wheel", "provider": "Wed, 09 Jul 2025 12:00:00 GMT"}, "3": {"title": "Tesla has not yet applied for robotaxi permits in California, state regulators say - Reuters", "summary": "Tesla has not yet applied for robotaxi permits in California, state regulators say ReutersTesla moves to expand Robotaxi to Phoenix, following rival Waymo CNBCTesla Hasn’t Even Applied For Permits ", "provider": "Fri, 11 Jul 2025 00:22:00 GMT"}, "4": {"title": "Tesla slashes prices in Canada despite tariffs as sales basically go to 0 - Electrek", "summary": "Tesla slashes prices in Canada despite tariffs as sales basically go to 0 Electrek", "provider": "Fri, 11 Jul 2025 13:14:00 GMT"}, "5": {"title": "Intel Offloads RealSense as Tesla, Amazon Drive Robotics Gold Rush - Yahoo Finance", "summary": "Intel Offloads RealSense as Tesla, Amazon Drive Robotics Gold Rush Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:47:14 GMT"}, "6": {"title": "Elon Musk faces a new threat in Canada - Politico", "summary": "Elon Musk faces a new threat in Canada Politico", "provider": "Thu, 10 Jul 2025 15:48:00 GMT"}, "7": {"title": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says - Fox Business", "summary": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says Fox Business", "provider": "Thu, 10 Jul 2025 20:42:00 GMT"}, "8": {"title": "Grok AI to be available in Tesla vehicles next week, Musk says - Reuters", "summary": "Grok AI to be available in Tesla vehicles next week, Musk says Reuters", "provider": "Thu, 10 Jul 2025 10:31:17 GMT"}, "9": {"title": "Musk says Tesla is expanding Austin robotaxi service, adding Grok to cars - CNBC", "summary": "Musk says Tesla is expanding Austin robotaxi service, adding Grok to cars CNBC", "provider": "Thu, 10 Jul 2025 14:44:49 GMT"}, "10": {"title": "Tesla Is Days Away From Violating a Texas Law. What’s Going On? - The New York Times", "summary": "Tesla Is Days Away From Violating a Texas Law. What’s Going On? The New York Times", "provider": "Wed, 09 Jul 2025 11:00:05 GMT"}, "11": {"title": "Tesla to hold annual shareholder meeting in November as investor scrutiny mounts - Reuters", "summary": "Tesla to hold annual shareholder meeting in November as investor scrutiny mounts Reuters", "provider": "Thu, 10 Jul 2025 20:59:35 GMT"}, "12": {"title": "Tesla - finally - announces when it will face its shareholders - CNN", "summary": "Tesla - finally - announces when it will face its shareholders CNN", "provider": "Thu, 10 Jul 2025 17:35:00 GMT"}, "13": {"title": "Tesla to officially launch in India with planned showroom opening - CNBC", "summary": "Tesla to officially launch in India with planned showroom opening CNBC", "provider": "Fri, 11 Jul 2025 12:03:25 GMT"}, "14": {"title": "Tesla Likely to Begin First Deliveries in India From August - Bloomberg", "summary": "Tesla Likely to Begin First Deliveries in India From August Bloomberg", "provider": "Fri, 11 Jul 2025 11:35:45 GMT"}, "15": {"title": "Musk's Tesla marks formal India entry with Mumbai launch event - Reuters", "summary": "Musk's Tesla marks formal India entry with Mumbai launch event Reuters", "provider": "Fri, 11 Jul 2025 06:20:00 GMT"}, "16": {"title": "Tesla: The Worst Is Yet To Come (Earnings Preview) (NASDAQ:TSLA) - Seeking Alpha", "summary": "Tesla: The Worst Is Yet To Come (Earnings Preview) (NASDAQ:TSLA) Seeking Alpha", "provider": "Thu, 10 Jul 2025 14:10:00 GMT"}, "17": {"title": "Elon Musk tells tech analyst Dan Ives to \"shut up\" after he makes recommendations to Tesla board - CBS News", "summary": "Elon Musk tells tech analyst Dan Ives to \"shut up\" after he makes recommendations to Tesla board CBS News", "provider": "Wed, 09 Jul 2025 18:51:28 GMT"}, "18": {"title": "Norway’s Tesla obsession defies Europe’s Musk backlash - CNBC", "summary": "Norway’s Tesla obsession defies Europe’s Musk backlash CNBC", "provider": "Fri, 11 Jul 2025 05:08:57 GMT"}, "19": {"title": "Billionaire Dan Loeb of Third Point Sold His Entire Stake in Tesla in Favor of a Stock That's Climbed More Than 420,000% Since Its IPO - Yahoo Finance", "summary": "Billionaire Dan Loeb of Third Point Sold His Entire Stake in Tesla in Favor of a Stock That's Climbed More Than 420,000% Since Its IPO Yahoo Finance", "provider": "Fri, 11 Jul 2025 07:06:00 GMT"}, "20": {"title": "The Deep Story On The Waymo Vs Tesla Robotaxi Battle, With Video - Forbes", "summary": "The Deep Story On The Waymo Vs Tesla Robotaxi Battle, With Video Forbes", "provider": "Wed, 09 Jul 2025 12:30:00 GMT"}, "21": {"title": "Tesla: Pigeon CEO, Overcompensated Captive & Useless Board, Failed Targets - CleanTechnica", "summary": "Tesla: Pigeon CEO, Overcompensated Captive & Useless Board, Failed Targets CleanTechnica", "provider": "Fri, 11 Jul 2025 03:58:02 GMT"}, "22": {"title": "I Planned to Post a Glowing Tesla Model Y Review After My Remote Western Australia Road Trip, But 700 Miles Away I Am Run Into a Sensor Issue - Torque News", "summary": "I Planned to Post a Glowing Tesla Model Y Review After My Remote Western Australia Road Trip, But 700 Miles Away I Am Run Into a Sensor Issue Torque News", "provider": "Fri, 11 Jul 2025 10:04:50 GMT"}, "23": {"title": "Tesla Stock Is Down This Month But Elon Musk Just Said Robotaxi Expansion Is Coming - Investor's Business Daily", "summary": "Tesla Stock Is Down This Month But Elon Musk Just Said Robotaxi Expansion Is Coming Investor's Business Daily", "provider": "Thu, 10 Jul 2025 20:06:00 GMT"}, "24": {"title": "I’m a Veteran of Auto Boycotts. My Advice to Tesla: Dump Musk - Counterpunch", "summary": "I’m a Veteran of Auto Boycotts. My Advice to Tesla: Dump Musk Counterpunch", "provider": "Fri, 11 Jul 2025 05:55:32 GMT"}, "25": {"title": "Grok coming to Tesla vehicles 'next week at the latest,' Musk says - USA Today", "summary": "Grok coming to Tesla vehicles 'next week at the latest,' Musk says USA Today", "provider": "Thu, 10 Jul 2025 18:31:51 GMT"}, "26": {"title": "Tesla Sets Date for Shareholders Meeting After Protests - The New York Times", "summary": "Tesla Sets Date for Shareholders Meeting After Protests The New York Times", "provider": "Thu, 10 Jul 2025 16:20:49 GMT"}, "27": {"title": "Elon Musk’s Tesla finally sets a shareholder meeting date amid doubts about his long-denied $56 billion pay package - Fortune", "summary": "Elon Musk’s Tesla finally sets a shareholder meeting date amid doubts about his long-denied $56 billion pay package Fortune", "provider": "Thu, 10 Jul 2025 19:07:00 GMT"}, "28": {"title": "Tesla Expands Robo-Taxi Service. What It Means for the Stock. - Barron's", "summary": "Tesla Expands Robo-Taxi Service. What It Means for the Stock. Barron's", "provider": "Thu, 10 Jul 2025 20:15:00 GMT"}, "29": {"title": "Tesla applies for autonomous vehicle ride-sharing services in the Valley - ABC15 Arizona", "summary": "Tesla applies for autonomous vehicle ride-sharing services in the Valley ABC15 Arizona", "provider": "Fri, 11 Jul 2025 12:19:39 GMT"}, "30": {"title": "Tesla (TSLA) pushes its shareholders annual meeting all the way to November, but why? - Electrek", "summary": "Tesla (TSLA) pushes its shareholders annual meeting all the way to November, but why? Electrek", "provider": "Thu, 10 Jul 2025 20:35:00 GMT"}, "31": {"title": "Cathie Wood drops bold message on Apple, Tesla stock - TheStreet", "summary": "Cathie Wood drops bold message on Apple, Tesla stock TheStreet", "provider": "Thu, 10 Jul 2025 22:03:00 GMT"}, "32": {"title": "Elon Musk says AI Grok is coming to Tesla vehicles, days after it unleashed antisemitic rant - CBS News", "summary": "Elon Musk says AI Grok is coming to Tesla vehicles, days after it unleashed antisemitic rant CBS News", "provider": "Thu, 10 Jul 2025 20:37:00 GMT"}, "33": {"title": "Tesla’s feckless board needs to rein in Elon Musk before it’s too late - New York Post", "summary": "Tesla’s feckless board needs to rein in Elon Musk before it’s too late New York Post", "provider": "Fri, 11 Jul 2025 11:00:00 GMT"}, "34": {"title": "Trump nominates a Tesla critic to lead NHTSA - Electrek", "summary": "Trump nominates a Tesla critic to lead NHTSA Electrek", "provider": "Thu, 10 Jul 2025 17:45:00 GMT"}, "35": {"title": "Tesla’s Sales Just Dropped by 60,000 Cars. And the Cybertruck Couldn’t Stop the Bleed. - Popular Mechanics", "summary": "Tesla’s Sales Just Dropped by 60,000 Cars. And the Cybertruck Couldn’t Stop the Bleed. Popular Mechanics", "provider": "Tue, 08 Jul 2025 18:00:00 GMT"}, "36": {"title": "Elon Musk Says Grok Is Coming to Tesla EVs - WIRED", "summary": "Elon Musk Says Grok Is Coming to Tesla EVs WIRED", "provider": "Thu, 10 Jul 2025 13:48:42 GMT"}, "37": {"title": "Elon Musk plans to bring Tesla robotaxis to San Francisco this year - San Francisco Chronicle", "summary": "Elon Musk plans to bring Tesla robotaxis to San Francisco this year San Francisco Chronicle", "provider": "Thu, 10 Jul 2025 19:10:44 GMT"}, "38": {"title": "Refreshed Tesla Semi Spotted: Production Ramp Imminent? - Not a Tesla App", "summary": "Refreshed Tesla Semi Spotted: Production Ramp Imminent? Not a Tesla App", "provider": "Fri, 11 Jul 2025 11:37:00 GMT"}, "39": {"title": "Canada Clears Tesla in iZEV Rebate Investigation, $43M Payment Unfrozen - driveteslacanada.ca", "summary": "Canada Clears Tesla in iZEV Rebate Investigation, $43M Payment Unfrozen driveteslacanada.ca", "provider": "Fri, 11 Jul 2025 04:05:11 GMT"}, "40": {"title": "Tesla is in deeper trouble than you think - CNN", "summary": "Tesla is in deeper trouble than you think CNN", "provider": "Tue, 08 Jul 2025 20:03:00 GMT"}, "41": {"title": "Elon Musk’s Tesla to open first showroom in Mumbai; EV maker set to inaugurate store next week: Report - Times of India", "summary": "Elon Musk’s Tesla to open first showroom in Mumbai; EV maker set to inaugurate store next week: Report Times of India", "provider": "Fri, 11 Jul 2025 04:25:00 GMT"}, "42": {"title": "Tesla Robotaxi to Expand Service Area / Geofence This Weekend - Not a Tesla App", "summary": "Tesla Robotaxi to Expand Service Area / Geofence This Weekend Not a Tesla App", "provider": "Thu, 10 Jul 2025 17:51:00 GMT"}, "43": {"title": "'I Don't Think I Ever Want To Go To a Normal Dealership': Man Buys Tesla. Then He Says Buying One Is a 'Next Level' Experience - InsideEVs", "summary": "'I Don't Think I Ever Want To Go To a Normal Dealership': Man Buys Tesla. Then He Says Buying One Is a 'Next Level' Experience InsideEVs", "provider": "Fri, 11 Jul 2025 14:00:35 GMT"}, "44": {"title": "This Could Save Tesla - Will Lockett – Medium", "summary": "This Could Save Tesla Will Lockett – Medium", "provider": "Wed, 09 Jul 2025 12:07:35 GMT"}, "45": {"title": "Tesla lowers Model Y price in Canada by $20,000, adds Diamond Black paint - driveteslacanada.ca", "summary": "Tesla lowers Model Y price in Canada by $20,000, adds Diamond Black paint driveteslacanada.ca", "provider": "Fri, 11 Jul 2025 03:03:53 GMT"}, "46": {"title": "Tesla wants to bring its robotaxi ridesharing service to Phoenix. What to know - The Arizona Republic", "summary": "Tesla wants to bring its robotaxi ridesharing service to Phoenix. What to know The Arizona Republic", "provider": "Fri, 11 Jul 2025 13:48:47 GMT"}, "47": {"title": "Grok is coming to Tesla vehicles ‘next week,’ says Elon Musk - TechCrunch", "summary": "Grok is coming to Tesla vehicles ‘next week,’ says Elon Musk TechCrunch", "provider": "Thu, 10 Jul 2025 14:22:24 GMT"}, "48": {"title": "Tesla India’s First ‘Experience Center’ to Open in Mumbai on July 15 - TipRanks", "summary": "Tesla India’s First ‘Experience Center’ to Open in Mumbai on July 15 TipRanks", "provider": "Fri, 11 Jul 2025 12:50:30 GMT"}, "49": {"title": "The Numbers Are In: Volkswagen Smokes Tesla Again - InsideEVs", "summary": "The Numbers Are In: Volkswagen Smokes Tesla Again InsideEVs", "provider": "Wed, 09 Jul 2025 14:37:00 GMT"}, "50": {"title": "Tesla's India Gambit: Luxury EVs and Regulatory Crosscurrents in a Growing Market - AInvest", "summary": "Tesla's India Gambit: Luxury EVs and Regulatory Crosscurrents in a Growing Market AInvest", "provider": "Fri, 11 Jul 2025 13:15:46 GMT"}, "51": {"title": "Tesla to expand robotaxis to San Francisco area within two months, Musk says - Reuters", "summary": "Tesla to expand robotaxis to San Francisco area within two months, Musk says Reuters", "provider": "Thu, 10 Jul 2025 04:35:00 GMT"}, "52": {"title": "Tesla is already trying to expand its robotaxi service to Arizona - TechCrunch", "summary": "Tesla is already trying to expand its robotaxi service to Arizona TechCrunch", "provider": "Thu, 10 Jul 2025 23:58:12 GMT"}, "53": {"title": "Elon Musk says Grok is coming to Tesla vehicles just after it went full Hitler - Electrek", "summary": "Elon Musk says Grok is coming to Tesla vehicles just after it went full Hitler Electrek", "provider": "Thu, 10 Jul 2025 13:32:00 GMT"}, "54": {"title": "Tesla Stock Bull Says 'Tesla Board Needs To Act Now' But Elon Musk Says This - Investor's Business Daily", "summary": "Tesla Stock Bull Says 'Tesla Board Needs To Act Now' But Elon Musk Says This Investor's Business Daily", "provider": "Wed, 09 Jul 2025 20:10:00 GMT"}, "55": {"title": "Tesla makes moves to expand robotaxis in the Bay Area and Phoenix - Business Insider", "summary": "Tesla makes moves to expand robotaxis in the Bay Area and Phoenix Business Insider", "provider": "Fri, 11 Jul 2025 00:14:00 GMT"}, "56": {"title": "Tesla investors ask board to set date for overdue annual shareholder meeting - Reuters", "summary": "Tesla investors ask board to set date for overdue annual shareholder meeting Reuters", "provider": "Wed, 09 Jul 2025 19:03:47 GMT"}, "57": {"title": "Tesla sold precisely zero cars in Turkey in January—now it’s Elon Musk’s hottest market. Here’s why - Fortune", "summary": "Tesla sold precisely zero cars in Turkey in January—now it’s Elon Musk’s hottest market. Here’s why Fortune", "provider": "Tue, 08 Jul 2025 14:49:00 GMT"}, "58": {"title": "Tesla, EV buyers need to act now if they want $7,500 tax credit - Yahoo Finance", "summary": "Tesla, EV buyers need to act now if they want $7,500 tax credit Yahoo Finance", "provider": "Fri, 11 Jul 2025 14:20:28 GMT"}, "59": {"title": "Experts Predict Whether Tesla Stock Can Make You Rich by 2035 - Yahoo Finance", "summary": "Experts Predict Whether Tesla Stock Can Make You Rich by 2035 Yahoo Finance", "provider": "Fri, 11 Jul 2025 14:00:51 GMT"}}}