{"Microsoft": {"0": {"title": "Microsoft announced 9,000 layoffs. What does that mean for WA state? - The Olympian", "summary": "Microsoft announced 9,000 layoffs. What does that mean for WA state? The Olympian", "provider": "Sun, 13 Jul 2025 12:00:00 GMT"}, "1": {"title": "Microsoft and OpenAI's AGI Fight Is Bigger Than a Contract - WIRED", "summary": "Microsoft and OpenAI's AGI Fight Is Bigger Than a Contract WIRED", "provider": "Fri, 11 Jul 2025 12:11:00 GMT"}, "2": {"title": "I'm a software engineer at Microsoft who was diagnosed with autism and ADHD at 30. It's changed how I see myself and show up at work. - Business Insider", "summary": "I'm a software engineer at Microsoft who was diagnosed with autism and ADHD at 30. It's changed how I see myself and show up at work. Business Insider", "provider": "Sun, 13 Jul 2025 09:21:00 GMT"}, "3": {"title": "Monthly Microsoft 365 fees are so over — own Office forever with this offer - SFGATE", "summary": "Monthly Microsoft 365 fees are so over — own Office forever with this offer SFGATE", "provider": "Sat, 12 Jul 2025 17:37:18 GMT"}, "4": {"title": "Microsoft president talks $4B AI investment amid sweeping layoffs: ‘We have to prioritize’ - KING5.com", "summary": "Microsoft president talks $4B AI investment amid sweeping layoffs: ‘We have to prioritize’ KING5.com", "provider": "Fri, 11 Jul 2025 01:07:00 GMT"}, "5": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - Yahoo Finance", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In Yahoo Finance", "provider": "Sat, 12 Jul 2025 10:20:39 GMT"}, "6": {"title": "Microsoft Outlook hit with hourslong outage - CNBC", "summary": "Microsoft Outlook hit with hourslong outage CNBC", "provider": "Thu, 10 Jul 2025 17:14:28 GMT"}, "7": {"title": "Why Every AI Agent Will Likely Run On Microsoft (NASDAQ:MSFT) - Seeking Alpha", "summary": "Why Every AI Agent Will Likely Run On Microsoft (NASDAQ:MSFT) Seeking Alpha", "provider": "Sun, 13 Jul 2025 10:51:00 GMT"}, "8": {"title": "OpenAI Can’t Windsurf Anymore as Microsoft Helps Google Steal the CEO - Analytics India Magazine", "summary": "OpenAI Can’t Windsurf Anymore as Microsoft Helps Google Steal the CEO Analytics India Magazine", "provider": "Sat, 12 Jul 2025 06:36:02 GMT"}, "9": {"title": "5 big analyst AI moves: Microsoft upgraded; Micron, MongoDB started at Buy - Investing.com", "summary": "5 big analyst AI moves: Microsoft upgraded; Micron, MongoDB started at Buy Investing.com", "provider": "Sun, 13 Jul 2025 09:00:36 GMT"}, "10": {"title": "Microsoft Elevate: Putting people first - The Official Microsoft Blog", "summary": "Microsoft Elevate: Putting people first The Official Microsoft Blog", "provider": "Wed, 09 Jul 2025 16:32:30 GMT"}, "11": {"title": "Microsoft Edge sets a new standard for speed and responsiveness - Windows Blog", "summary": "Microsoft Edge sets a new standard for speed and responsiveness Windows Blog", "provider": "Mon, 07 Jul 2025 17:21:33 GMT"}, "12": {"title": "Is Microsoft Outlook down? Thousands of users report issues with email - PBS", "summary": "Is Microsoft Outlook down? Thousands of users report issues with email PBS", "provider": "Thu, 10 Jul 2025 14:33:53 GMT"}, "13": {"title": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports - Reuters", "summary": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports Reuters", "provider": "Wed, 09 Jul 2025 18:58:27 GMT"}, "14": {"title": "Microsoft Pledges $4 Billion Toward A.I. Education - The New York Times", "summary": "Microsoft Pledges $4 Billion Toward A.I. Education The New York Times", "provider": "Wed, 09 Jul 2025 16:29:06 GMT"}, "15": {"title": "Microsoft announces $4 billion AI training initiative amid recent layoffs - KOMO", "summary": "Microsoft announces $4 billion AI training initiative amid recent layoffs KOMO", "provider": "Fri, 11 Jul 2025 01:39:49 GMT"}, "16": {"title": "Microsoft’s 19-hour Outlook outage exposes fragility in cloud infrastructure - Computerworld", "summary": "Microsoft’s 19-hour Outlook outage exposes fragility in cloud infrastructure Computerworld", "provider": "Fri, 11 Jul 2025 10:18:21 GMT"}, "17": {"title": "Why and how Microsoft may have 'killed' OpenAI's $3 billion acquisition of WindSurf - Times of India", "summary": "Why and how Microsoft may have 'killed' OpenAI's $3 billion acquisition of WindSurf Times of India", "provider": "Sun, 13 Jul 2025 19:00:00 GMT"}, "18": {"title": "As AI reshapes its workforce, Microsoft commits $4 billion to help others adapt - GeekWire", "summary": "As AI reshapes its workforce, Microsoft commits $4 billion to help others adapt GeekWire", "provider": "Wed, 09 Jul 2025 16:39:14 GMT"}, "19": {"title": "Microsoft Patch Tuesday, July 2025 Edition - Krebs on Security", "summary": "Microsoft Patch Tuesday, July 2025 Edition Krebs on Security", "provider": "Wed, 09 Jul 2025 02:59:09 GMT"}, "20": {"title": "Is Microsoft Outlook down? What to know about outage as users report issues - USA Today", "summary": "Is Microsoft Outlook down? What to know about outage as users report issues USA Today", "provider": "Thu, 10 Jul 2025 11:39:47 GMT"}, "21": {"title": "A week after layoffs linked to AI cost, Microsoft pledges $4B to AI education - The Seattle Times", "summary": "A week after layoffs linked to AI cost, Microsoft pledges $4B to AI education The Seattle Times", "provider": "Thu, 10 Jul 2025 13:00:00 GMT"}, "22": {"title": "The Microsoft Surface Pro 2024 is one of my favorite tablets ever, no thanks to AI - CNN", "summary": "The Microsoft Surface Pro 2024 is one of my favorite tablets ever, no thanks to AI CNN", "provider": "Tue, 08 Jul 2025 11:58:00 GMT"}, "23": {"title": "Reasoning reimagined: Introducing Phi-4-mini-flash-reasoning - Microsoft Azure", "summary": "Reasoning reimagined: Introducing Phi-4-mini-flash-reasoning Microsoft Azure", "provider": "Wed, 09 Jul 2025 16:00:00 GMT"}, "24": {"title": "Microsoft cuts 15,000 jobs, tells remaining employees to invest in ... - Times of India", "summary": "Microsoft cuts 15,000 jobs, tells remaining employees to invest in ... Times of India", "provider": "Sun, 13 Jul 2025 14:17:00 GMT"}, "25": {"title": "​​Forrester names Microsoft a Leader in the 2025 Zero Trust Platforms Wave™ report - Microsoft", "summary": "​​Forrester names Microsoft a Leader in the 2025 Zero Trust Platforms Wave™ report Microsoft", "provider": "Thu, 10 Jul 2025 16:00:00 GMT"}, "26": {"title": "Outlook down? Microsoft email platform back online after suffering a major outage - here's what happened - TechRadar", "summary": "Outlook down? Microsoft email platform back online after suffering a major outage - here's what happened TechRadar", "provider": "Sat, 12 Jul 2025 10:00:12 GMT"}, "27": {"title": "Microsoft expands Zero Trust workshop to cover network, SecOps, and more - Microsoft", "summary": "Microsoft expands Zero Trust workshop to cover network, SecOps, and more Microsoft", "provider": "Wed, 09 Jul 2025 16:00:00 GMT"}, "28": {"title": "What’s new in Copilot Studio: June 2025 - Microsoft", "summary": "What’s new in Copilot Studio: June 2025 Microsoft", "provider": "Thu, 10 Jul 2025 16:00:00 GMT"}, "29": {"title": "Microsoft Outlook working normal following widespread outage - USA Today", "summary": "Microsoft Outlook working normal following widespread outage USA Today", "provider": "Thu, 10 Jul 2025 07:00:00 GMT"}, "30": {"title": "Introducing Deep Research in Azure AI Foundry Agent Service - Microsoft Azure", "summary": "Introducing Deep Research in Azure AI Foundry Agent Service Microsoft Azure", "provider": "Mon, 07 Jul 2025 17:00:00 GMT"}, "31": {"title": "Microsoft’s stock gets an upgrade. Why these analysts say it’s underappreciated in AI. - MarketWatch", "summary": "Microsoft’s stock gets an upgrade. Why these analysts say it’s underappreciated in AI. MarketWatch", "provider": "Wed, 09 Jul 2025 13:48:00 GMT"}, "32": {"title": "Microsoft develops Copilot 3D experiment targeting creators - TestingCatalog", "summary": "Microsoft develops Copilot 3D experiment targeting creators TestingCatalog", "provider": "Sun, 13 Jul 2025 16:18:45 GMT"}, "33": {"title": "WPP taps Microsoft exec Rose to rebuild ad group - Reuters", "summary": "WPP taps Microsoft exec Rose to rebuild ad group Reuters", "provider": "Thu, 10 Jul 2025 07:33:57 GMT"}, "34": {"title": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers - The New York Times", "summary": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers The New York Times", "provider": "Wed, 09 Jul 2025 07:00:00 GMT"}, "35": {"title": "Microsoft Outlook Down — Email Outage Confirmed, What We Know So Far - Forbes", "summary": "Microsoft Outlook Down — Email Outage Confirmed, What We Know So Far Forbes", "provider": "Thu, 10 Jul 2025 10:49:39 GMT"}, "36": {"title": "Veteran analyst issues eye-popping Microsoft stock price target - TheStreet", "summary": "Veteran analyst issues eye-popping Microsoft stock price target TheStreet", "provider": "Fri, 11 Jul 2025 22:03:00 GMT"}, "37": {"title": "Microsoft Plans to Purge Passwords — Here's How to Protect Yours - CNET", "summary": "Microsoft Plans to Purge Passwords — Here's How to Protect Yours CNET", "provider": "Sun, 13 Jul 2025 10:00:00 GMT"}, "38": {"title": "Is Outlook down? Microsoft reporting issues with email service. What to know - Cincinnati Enquirer", "summary": "Is Outlook down? Microsoft reporting issues with email service. What to know Cincinnati Enquirer", "provider": "Thu, 10 Jul 2025 12:14:59 GMT"}, "39": {"title": "Is Microsoft Stock A Buy In July? What The Fundamentals, Chart Say As MSFT Aims At 7th Straight Weekly Gain - Investor's Business Daily", "summary": "Is Microsoft Stock A Buy In July? What The Fundamentals, Chart Say As MSFT Aims At 7th Straight Weekly Gain Investor's Business Daily", "provider": "Thu, 10 Jul 2025 18:14:00 GMT"}, "40": {"title": "Microsoft shares $500M in AI savings internally days after cutting 9,000 jobs - TechCrunch", "summary": "Microsoft shares $500M in AI savings internally days after cutting 9,000 jobs TechCrunch", "provider": "Wed, 09 Jul 2025 23:06:01 GMT"}, "41": {"title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server - The Hacker News", "summary": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server The Hacker News", "provider": "Wed, 09 Jul 2025 07:10:00 GMT"}, "42": {"title": "WPP Names Microsoft Executive as Next CEO - The Wall Street Journal", "summary": "WPP Names Microsoft Executive as Next CEO The Wall Street Journal", "provider": "Thu, 10 Jul 2025 07:18:00 GMT"}, "43": {"title": "‘Who’s training who?’: Tech companies, teachers union partner on national AI academy - Chalkbeat", "summary": "‘Who’s training who?’: Tech companies, teachers union partner on national AI academy Chalkbeat", "provider": "Tue, 08 Jul 2025 23:24:00 GMT"}, "44": {"title": "Microsoft and Adobe Patch Tuesday, July 2025 Security Update Review - Qualys", "summary": "Microsoft and Adobe Patch Tuesday, July 2025 Security Update Review Qualys", "provider": "Tue, 08 Jul 2025 18:41:02 GMT"}, "45": {"title": "Microsoft Touts $500 Million in AI Savings While Slashing Jobs - Bloomberg", "summary": "Microsoft Touts $500 Million in AI Savings While Slashing Jobs Bloomberg", "provider": "Wed, 09 Jul 2025 18:47:27 GMT"}, "46": {"title": "Microsoft, OpenAI Partner With AFT to Train Teachers on AI - Education Week", "summary": "Microsoft, OpenAI Partner With AFT to Train Teachers on AI Education Week", "provider": "Tue, 08 Jul 2025 22:25:56 GMT"}, "47": {"title": "What’s new in Power Apps: June 2025 Feature Update - Microsoft", "summary": "What’s new in Power Apps: June 2025 Feature Update Microsoft", "provider": "Tue, 08 Jul 2025 15:48:21 GMT"}, "48": {"title": "Microsoft Makes AI Mandatory For Employees: What It Means For Your Career - Forbes", "summary": "Microsoft Makes AI Mandatory For Employees: What It Means For Your Career Forbes", "provider": "Tue, 08 Jul 2025 06:30:00 GMT"}, "49": {"title": "Outlook takes another sick day - theregister.com", "summary": "Outlook takes another sick day theregister.com", "provider": "Thu, 10 Jul 2025 10:02:00 GMT"}, "50": {"title": "Outlook Outage: Microsoft Says Your Email Should Be Working Again - CNET", "summary": "Outlook Outage: Microsoft Says Your Email Should Be Working Again CNET", "provider": "Thu, 10 Jul 2025 20:13:00 GMT"}, "51": {"title": "Stay secure with Windows 11, Copilot+ PCs and Windows 365 before support ends for Windows 10 - Windows Blog", "summary": "Stay secure with Windows 11, Copilot+ PCs and Windows 365 before support ends for Windows 10 Windows Blog", "provider": "Tue, 24 Jun 2025 07:00:00 GMT"}, "52": {"title": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company - CNN", "summary": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company CNN", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "53": {"title": "Is Outlook down right now? Is Hotmail email server down? When will outage be fixed? What we know - IndyStar", "summary": "Is Outlook down right now? Is Hotmail email server down? When will outage be fixed? What we know IndyStar", "provider": "Thu, 10 Jul 2025 12:31:55 GMT"}, "54": {"title": "Microsoft Announces 15,000 Layoffs, Asks Remaining Employees to Invest in AI Skills - The CSR Journal", "summary": "Microsoft Announces 15,000 Layoffs, Asks Remaining Employees to Invest in AI Skills The CSR Journal", "provider": "Sun, 13 Jul 2025 23:40:45 GMT"}, "55": {"title": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken - BleepingComputer", "summary": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken BleepingComputer", "provider": "Wed, 09 Jul 2025 20:58:34 GMT"}, "56": {"title": "WPP Taps Microsoft’s Cindy Rose as CEO, Hoping for New Era - Variety", "summary": "WPP Taps Microsoft’s Cindy Rose as CEO, Hoping for New Era Variety", "provider": "Thu, 10 Jul 2025 10:42:00 GMT"}, "57": {"title": "How to delete the Microsoft account that Windows made you set up - PCWorld", "summary": "How to delete the Microsoft account that Windows made you set up PCWorld", "provider": "Wed, 09 Jul 2025 14:30:00 GMT"}, "58": {"title": "Replit Collaborates with Microsoft to bring Vibe Coding to Enterprise Customers - PR Newswire", "summary": "Replit Collaborates with Microsoft to bring Vibe Coding to Enterprise Customers PR Newswire", "provider": "Tue, 08 Jul 2025 14:08:00 GMT"}, "59": {"title": "Thousands report issues with Microsoft Outlook email in apparent outage - New York Post", "summary": "Thousands report issues with Microsoft Outlook email in apparent outage New York Post", "provider": "Thu, 10 Jul 2025 14:52:00 GMT"}}, "Nvidia": {"0": {"title": "US senators warn Nvidia CEO about upcoming China trip - Reuters", "summary": "US senators warn Nvidia CEO about upcoming China trip ReutersNvidia CEO to hold media briefing in Beijing on July 16 ReutersNvidia’s CEO says the US should ‘reduce’ dependency on other countries, o", "provider": "Fri, 11 Jul 2025 21:08:48 GMT"}, "1": {"title": "Meet Nvidia’s big new customers: governments - The Economist", "summary": "Meet Nvidia’s big new customers: governments The Economist", "provider": "Sun, 13 Jul 2025 17:58:38 GMT"}, "2": {"title": "Nvidia (NVDA) Just Got a Buy Rating From Goldman—Here’s Why Analysts Are Bullish - Yahoo Finance", "summary": "Nvidia (NVDA) Just Got a Buy Rating From Goldman—Here’s Why Analysts Are Bullish Yahoo FinanceNvidia's Jensen Huang sells more than $36 million in stock, catching up with Warren Buffett in net wort", "provider": "Sun, 13 Jul 2025 15:44:02 GMT"}, "3": {"title": "World's first $4 trillion company unruffled by Trump tariff threat - USA Today", "summary": "World's first $4 trillion company unruffled by Trump tariff threat USA Today", "provider": "Fri, 11 Jul 2025 23:11:51 GMT"}, "4": {"title": "Warren Buffett Doesn't Own Nvidia — But His 3 Picks Are Better - Investor's Business Daily", "summary": "Warren Buffett Doesn't Own Nvidia — But His 3 Picks Are Better Investor's Business Daily", "provider": "Fri, 11 Jul 2025 12:00:00 GMT"}, "5": {"title": "Nvidia CEO dismisses Trump tariff concerns: ‘We’ll work through it’ - The Hill", "summary": "Nvidia CEO dismisses Trump tariff concerns: ‘We’ll work through it’ The Hill", "provider": "Fri, 11 Jul 2025 14:59:00 GMT"}, "6": {"title": "Nvidia's new driver update finally brings Smooth Motion to RTX 40-series GPUs, works like AMD's Fluid Motion Frames and claims to double your FPS with a single click in any game - Tom's Hardware", "summary": "Nvidia's new driver update finally brings Smooth Motion to RTX 40-series GPUs, works like AMD's Fluid Motion Frames and claims to double your FPS with a single click in any game Tom's Hardware", "provider": "Sun, 13 Jul 2025 14:12:12 GMT"}, "7": {"title": "GPUHammer: New RowHammer Attack Variant Degrades AI Models on NVIDIA GPUs - The Hacker News", "summary": "GPUHammer: New RowHammer Attack Variant Degrades AI Models on NVIDIA GPUs The Hacker News", "provider": "Sat, 12 Jul 2025 17:14:00 GMT"}, "8": {"title": "Nvidia defines power electronics future - Yole Group", "summary": "Nvidia defines power electronics future Yole Group", "provider": "Fri, 11 Jul 2025 10:20:39 GMT"}, "9": {"title": "NVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks - BleepingComputer", "summary": "NVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks BleepingComputer", "provider": "Fri, 11 Jul 2025 15:39:05 GMT"}, "10": {"title": "Nvidia or AMD: Goldman Sachs Picks the Superior AI Stock to Buy - TipRanks", "summary": "Nvidia or AMD: Goldman Sachs Picks the Superior AI Stock to Buy TipRanks", "provider": "Sun, 13 Jul 2025 20:46:04 GMT"}, "11": {"title": "Look Up… It’s A One-Of-A-Kind Superman GeForce RTX 5090! And You Could Win It! - NVIDIA", "summary": "Look Up… It’s A One-Of-A-Kind Superman GeForce RTX 5090! And You Could Win It! NVIDIA", "provider": "Wed, 09 Jul 2025 15:41:06 GMT"}, "12": {"title": "Nvidia briefly touched $4 trillion market cap for first time - CNBC", "summary": "Nvidia briefly touched $4 trillion market cap for first time CNBC", "provider": "Wed, 09 Jul 2025 13:42:41 GMT"}, "13": {"title": "NVIDIA Introduces “Smooth Motion” Frame Generation for RTX 40 Series GPUs in Latest Preview Driver, Proven to Double In-Game FPS - Wccftech", "summary": "NVIDIA Introduces “Smooth Motion” Frame Generation for RTX 40 Series GPUs in Latest Preview Driver, Proven to Double In-Game FPS Wccftech", "provider": "Sun, 13 Jul 2025 10:56:00 GMT"}, "14": {"title": "Nvidia: A complete guide to the hardware company behind the AI boom - Business Insider", "summary": "Nvidia: A complete guide to the hardware company behind the AI boom Business Insider", "provider": "Wed, 09 Jul 2025 17:10:00 GMT"}, "15": {"title": "NVIDIA 590.26 preview drivers introduce Smooth Motion frame generation for GeForce RTX 40 Series - VideoCardz.com", "summary": "NVIDIA 590.26 preview drivers introduce Smooth Motion frame generation for GeForce RTX 40 Series VideoCardz.com", "provider": "Sun, 13 Jul 2025 09:14:00 GMT"}, "16": {"title": "Nvidia Becomes First Public Company Worth $4 Trillion - The New York Times", "summary": "Nvidia Becomes First Public Company Worth $4 Trillion The New York Times", "provider": "Thu, 10 Jul 2025 20:18:09 GMT"}, "17": {"title": "The CEO of Nvidia Admits What Everybody Is Afraid of About AI - Gizmodo", "summary": "The CEO of Nvidia Admits What Everybody Is Afraid of About AI Gizmodo", "provider": "Sun, 13 Jul 2025 22:34:00 GMT"}, "18": {"title": "On GPS: Nvidia CEO on the US-China AI race - CNN", "summary": "On GPS: Nvidia CEO on the US-China AI race CNN", "provider": "Sun, 13 Jul 2025 15:02:53 GMT"}, "19": {"title": "DLSS 4 With Multi Frame Generation Coming To RuneScape: Dragonwilds, Mortal Online 2 & Brickadia | GeForce News - NVIDIA", "summary": "DLSS 4 With Multi Frame Generation Coming To RuneScape: Dragonwilds, Mortal Online 2 & Brickadia | GeForce News NVIDIA", "provider": "Tue, 08 Jul 2025 13:01:01 GMT"}, "20": {"title": "On GPS: Nvidia CEO on whether AI will lead to job losses - CNN", "summary": "On GPS: Nvidia CEO on whether AI will lead to job losses CNN", "provider": "Sun, 13 Jul 2025 15:03:36 GMT"}, "21": {"title": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company - CNN", "summary": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company CNN", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "22": {"title": "Nvidia becomes first company to close above $4 trillion mark - Yahoo Finance", "summary": "Nvidia becomes first company to close above $4 trillion mark Yahoo Finance", "provider": "Fri, 11 Jul 2025 08:25:47 GMT"}, "23": {"title": "Nvidia’s Jensen Huang says AI could lead to job losses ‘if the world runs out of ideas’ - CNN", "summary": "Nvidia’s Jensen Huang says AI could lead to job losses ‘if the world runs out of ideas’ CNN", "provider": "Fri, 11 Jul 2025 21:06:00 GMT"}, "24": {"title": "Nvidia's market value tops $4 trillion - Reuters", "summary": "Nvidia's market value tops $4 trillion Reuters", "provider": "Fri, 11 Jul 2025 00:42:00 GMT"}, "25": {"title": "Jensen Huang's Nvidia Owns 6 Stocks. Here's the Best of the Bunch. - The Motley Fool", "summary": "Jensen Huang's Nvidia Owns 6 Stocks. Here's the Best of the Bunch. The Motley Fool", "provider": "Sat, 12 Jul 2025 08:30:00 GMT"}, "26": {"title": "Nvidia stock eyes more gains after chipmaker becomes first company to reach $4 trillion market value - Yahoo Finance", "summary": "Nvidia stock eyes more gains after chipmaker becomes first company to reach $4 trillion market value Yahoo Finance", "provider": "Thu, 10 Jul 2025 08:13:39 GMT"}, "27": {"title": "Nvidia Stock Is Way Cheaper Than You Think. Here's 1 Reason Why. - The Motley Fool", "summary": "Nvidia Stock Is Way Cheaper Than You Think. Here's 1 Reason Why. The Motley Fool", "provider": "Sat, 12 Jul 2025 11:15:00 GMT"}, "28": {"title": "How some pros use options to trade Nvidia and other tech stocks while limiting risk - MarketWatch", "summary": "How some pros use options to trade Nvidia and other tech stocks while limiting risk MarketWatch", "provider": "Fri, 11 Jul 2025 13:14:00 GMT"}, "29": {"title": "Nvidia becomes first company to hit $4 trillion valuation - NBC News", "summary": "Nvidia becomes first company to hit $4 trillion valuation NBC News", "provider": "Wed, 09 Jul 2025 20:18:00 GMT"}, "30": {"title": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services - Amazon.com", "summary": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services Amazon.com", "provider": "Wed, 09 Jul 2025 20:55:03 GMT"}, "31": {"title": "These 2 Magnificent 7 Stocks are Top Picks for the Second Half of 2025 According to Wall Street Pro - 24/7 Wall St.", "summary": "These 2 Magnificent 7 Stocks are Top Picks for the Second Half of 2025 According to Wall Street Pro 24/7 Wall St.", "provider": "Sun, 13 Jul 2025 12:11:33 GMT"}, "32": {"title": "Reach the ‘PEAK’ on GeForce NOW - NVIDIA Blog", "summary": "Reach the ‘PEAK’ on GeForce NOW NVIDIA Blog", "provider": "Thu, 10 Jul 2025 13:03:10 GMT"}, "33": {"title": "AI Titan Nvidia Becomes First $4 Trillion Company Ever - Forbes", "summary": "AI Titan Nvidia Becomes First $4 Trillion Company Ever Forbes", "provider": "Wed, 09 Jul 2025 14:07:43 GMT"}, "34": {"title": "Prediction: These 2 AI Chip Stocks Will Outperform Nvidia Over the Next 5 Years - The Motley Fool", "summary": "Prediction: These 2 AI Chip Stocks Will Outperform Nvidia Over the Next 5 Years The Motley Fool", "provider": "Sun, 13 Jul 2025 13:15:00 GMT"}, "35": {"title": "How Nvidia's rise is minting so many millionaires among its relatively small workforce - Business Insider", "summary": "How Nvidia's rise is minting so many millionaires among its relatively small workforce Business Insider", "provider": "Fri, 11 Jul 2025 15:58:00 GMT"}, "36": {"title": "Nvidia’s Huang Says China’s Military Unlikely to Use US AI Chips - Bloomberg", "summary": "Nvidia’s Huang Says China’s Military Unlikely to Use US AI Chips Bloomberg", "provider": "Sun, 13 Jul 2025 15:21:13 GMT"}, "37": {"title": "Nvidia's stock market value hits $4 trillion on AI dominance - Reuters", "summary": "Nvidia's stock market value hits $4 trillion on AI dominance Reuters", "provider": "Wed, 09 Jul 2025 21:38:42 GMT"}, "38": {"title": "How Nvidia Became the World’s First $4 Trillion Company - The Wall Street Journal", "summary": "How Nvidia Became the World’s First $4 Trillion Company The Wall Street Journal", "provider": "Wed, 09 Jul 2025 21:07:00 GMT"}, "39": {"title": "Nvidia officially gets its $4 trillion finish. Here’s what could come next. - MarketWatch", "summary": "Nvidia officially gets its $4 trillion finish. Here’s what could come next. MarketWatch", "provider": "Thu, 10 Jul 2025 21:14:00 GMT"}, "40": {"title": "AWS AI infrastructure with NVIDIA Blackwell: Two powerful compute solutions for the next frontier of AI - Amazon.com", "summary": "AWS AI infrastructure with NVIDIA Blackwell: Two powerful compute solutions for the next frontier of AI Amazon.com", "provider": "Wed, 09 Jul 2025 21:01:52 GMT"}, "41": {"title": "Nvidia Stock: Analyst Eyes $6 Trillion Market Cap – Is The AI Titan A Buy Now? - Investor's Business Daily", "summary": "Nvidia Stock: Analyst Eyes $6 Trillion Market Cap – Is The AI Titan A Buy Now? Investor's Business Daily", "provider": "Fri, 11 Jul 2025 14:16:00 GMT"}, "42": {"title": "Nvidia Is the First $4 Trillion Company. Here's Why It Could Still Soar Higher. - The Motley Fool", "summary": "Nvidia Is the First $4 Trillion Company. Here's Why It Could Still Soar Higher. The Motley Fool", "provider": "Fri, 11 Jul 2025 11:00:00 GMT"}, "43": {"title": "Nvidia’s Meteoric Rise Has Made Jensen Huang Almost as Rich as Warren Buffett - Investopedia", "summary": "Nvidia’s Meteoric Rise Has Made Jensen Huang Almost as Rich as Warren Buffett Investopedia", "provider": "Thu, 10 Jul 2025 21:11:53 GMT"}, "44": {"title": "Nvidia CEO Huang to meet Trump before China trip, source says - Reuters", "summary": "Nvidia CEO Huang to meet Trump before China trip, source says Reuters", "provider": "Thu, 10 Jul 2025 21:29:29 GMT"}, "45": {"title": "Nvidia Just Became the First Company to Hit a $4 Trillion Market Cap - Barron's", "summary": "Nvidia Just Became the First Company to Hit a $4 Trillion Market Cap Barron's", "provider": "Wed, 09 Jul 2025 20:15:00 GMT"}, "46": {"title": "Nvidia's $4 trillion milestone caps rise of stock market behemoth - Reuters", "summary": "Nvidia's $4 trillion milestone caps rise of stock market behemoth Reuters", "provider": "Wed, 09 Jul 2025 21:33:33 GMT"}, "47": {"title": "Stock market today: S&P 500, Nasdaq eke out fresh records, Nvidia closes at $4T market cap - Yahoo Finance", "summary": "Stock market today: S&P 500, Nasdaq eke out fresh records, Nvidia closes at $4T market cap Yahoo Finance", "provider": "Thu, 10 Jul 2025 21:44:40 GMT"}, "48": {"title": "Trump hosts Jensen Huang at White House as Nvidia tops $4 trillion market cap - CNBC", "summary": "Trump hosts Jensen Huang at White House as Nvidia tops $4 trillion market cap CNBC", "provider": "Thu, 10 Jul 2025 20:22:57 GMT"}, "49": {"title": "Nvidia becomes first company to reach $4tn in market value - The Guardian", "summary": "Nvidia becomes first company to reach $4tn in market value The Guardian", "provider": "Thu, 10 Jul 2025 09:12:00 GMT"}, "50": {"title": "Nvidia CEO Jensen Huang could soon be richer than Warren Buffett—he's worth $142 billion now - CNBC", "summary": "Nvidia CEO Jensen Huang could soon be richer than Warren Buffett—he's worth $142 billion now CNBC", "provider": "Thu, 10 Jul 2025 19:00:53 GMT"}, "51": {"title": "Nvidia becomes first US company to reach $4 trillion market cap - Al Jazeera", "summary": "Nvidia becomes first US company to reach $4 trillion market cap Al Jazeera", "provider": "Wed, 09 Jul 2025 15:33:42 GMT"}, "52": {"title": "AI kingpin Nvidia crowned as first public company with a $4 trillion valuation - AP News", "summary": "AI kingpin Nvidia crowned as first public company with a $4 trillion valuation AP News", "provider": "Wed, 09 Jul 2025 20:44:00 GMT"}, "53": {"title": "Nvidia Stock May Double in the Next 3 Years. Here's Why. - The Motley Fool", "summary": "Nvidia Stock May Double in the Next 3 Years. Here's Why. The Motley Fool", "provider": "Fri, 11 Jul 2025 08:45:00 GMT"}, "54": {"title": "Planned Nvidia expansion in Israel prompts multiple offers of sites - Reuters", "summary": "Planned Nvidia expansion in Israel prompts multiple offers of sites Reuters", "provider": "Wed, 09 Jul 2025 14:04:55 GMT"}, "55": {"title": "Nvidia makes history as first $4 trillion company, Jensen Huang's net worth surges $25 billion year-to-date - Fortune", "summary": "Nvidia makes history as first $4 trillion company, Jensen Huang's net worth surges $25 billion year-to-date Fortune", "provider": "Wed, 09 Jul 2025 17:12:00 GMT"}, "56": {"title": "4 differences between Nvidia and AMD GPUs that I wasn’t prepared for when I swapped - XDA", "summary": "4 differences between Nvidia and AMD GPUs that I wasn’t prepared for when I swapped XDA", "provider": "Mon, 07 Jul 2025 10:00:00 GMT"}, "57": {"title": "Nvidia reportedly plans to release new AI chip designed for China - TechCrunch", "summary": "Nvidia reportedly plans to release new AI chip designed for China TechCrunch", "provider": "Thu, 10 Jul 2025 15:29:32 GMT"}, "58": {"title": "Here are Friday's biggest analyst calls: Nvidia, Apple, Tesla, Netflix, Roblox, Amazon, Chipotle, Delta, AMC and more - CNBC", "summary": "Here are Friday's biggest analyst calls: Nvidia, Apple, Tesla, Netflix, Roblox, Amazon, Chipotle, Delta, AMC and more CNBC", "provider": "Fri, 11 Jul 2025 12:15:39 GMT"}, "59": {"title": "VIEW Nvidia becomes first company to hit $4 trillion in market value - Reuters", "summary": "VIEW Nvidia becomes first company to hit $4 trillion in market value Reuters", "provider": "Wed, 09 Jul 2025 17:56:41 GMT"}}, "Apple": {"0": {"title": "Apple CEO Tim Cook has created more shareholder value than Steve Jobs. But suddenly his weaknesses are on display in the AI era - Fortune", "summary": "Apple CEO Tim Cook has created more shareholder value than Steve Jobs. But suddenly his weaknesses are on display in the AI era Fortune", "provider": "Sat, 12 Jul 2025 09:00:00 GMT"}, "1": {"title": "Tim Cook Isn’t Going Anywhere Soon, But an Apple Shake-Up Looms - Bloomberg", "summary": "Tim Cook Isn’t Going Anywhere Soon, But an Apple Shake-Up Looms Bloomberg", "provider": "Sun, 13 Jul 2025 12:00:00 GMT"}, "2": {"title": "Tim Cook won't get fired by Apple's board of directors — and is likely to be chairman soon - AppleInsider", "summary": "Tim Cook won't get fired by Apple's board of directors — and is likely to be chairman soon AppleInsider", "provider": "Sun, 13 Jul 2025 12:47:00 GMT"}, "3": {"title": "These are the pros and cons of buying from Apple’s refurbished store: Is it worth it? - 9to5Mac", "summary": "These are the pros and cons of buying from Apple’s refurbished store: Is it worth it? 9to5Mac", "provider": "Sun, 13 Jul 2025 19:17:00 GMT"}, "4": {"title": "Apple is poised to win the rights to stream F1 races in the US. ESPN is bowing out. - Business Insider", "summary": "Apple is poised to win the rights to stream F1 races in the US. ESPN is bowing out. Business Insider", "provider": "Fri, 11 Jul 2025 20:00:00 GMT"}, "5": {"title": "Apple reportedly outbids ESPN for F1 U.S. broadcast rights as coverage could move to streaming platform in 2026 - Yahoo Sports", "summary": "Apple reportedly outbids ESPN for F1 U.S. broadcast rights as coverage could move to streaming platform in 2026 Yahoo Sports", "provider": "Sat, 12 Jul 2025 03:03:00 GMT"}, "6": {"title": "F1 leaning toward Apple for U.S. TV rights as bid tops ESPN offer: Sources - The New York Times", "summary": "F1 leaning toward Apple for U.S. TV rights as bid tops ESPN offer: Sources The New York Times", "provider": "Fri, 11 Jul 2025 23:19:39 GMT"}, "7": {"title": "Apple’s China Risks Are Real, But the Market Is Missing the Bigger Picture - Yahoo Finance", "summary": "Apple’s China Risks Are Real, But the Market Is Missing the Bigger Picture Yahoo Finance", "provider": "Sat, 12 Jul 2025 12:00:02 GMT"}, "8": {"title": "Apple insider says to expect iPhone 17 unveiling to take place during this particular week - PhoneArena", "summary": "Apple insider says to expect iPhone 17 unveiling to take place during this particular week PhoneArena", "provider": "Sun, 13 Jul 2025 20:22:04 GMT"}, "9": {"title": "Apple iPhone 17 Release Date: New Clue Revealed In Latest Leak - Forbes", "summary": "Apple iPhone 17 Release Date: New Clue Revealed In Latest Leak Forbes", "provider": "Sun, 13 Jul 2025 20:45:09 GMT"}, "10": {"title": "iPhone 17 release date: Here’s when to expect Apple’s big launch - 9to5Mac", "summary": "iPhone 17 release date: Here’s when to expect Apple’s big launch 9to5Mac", "provider": "Wed, 09 Jul 2025 14:03:00 GMT"}, "11": {"title": "Government breaks silence on Chinese engineers leaving iPhone maker Foxconn’s plant: ‘Apple has alternati - Times of India", "summary": "Government breaks silence on Chinese engineers leaving iPhone maker Foxconn’s plant: ‘Apple has alternati Times of India", "provider": "Sun, 13 Jul 2025 12:06:00 GMT"}, "12": {"title": "Will a Leadership Change Be Enough to Turn Apple Around? - The Motley Fool", "summary": "Will a Leadership Change Be Enough to Turn Apple Around? The Motley Fool", "provider": "Sun, 13 Jul 2025 08:35:00 GMT"}, "13": {"title": "New Apple TV Expected Later This Year With These New Features - MacRumors", "summary": "New Apple TV Expected Later This Year With These New Features MacRumors", "provider": "Sat, 12 Jul 2025 22:09:24 GMT"}, "14": {"title": "I found the 26 best Amazon Prime Day Apple deals of 2025 - CNN", "summary": "I found the 26 best Amazon Prime Day Apple deals of 2025 CNN", "provider": "Fri, 11 Jul 2025 08:21:00 GMT"}, "15": {"title": "The best Prime Day Apple deals on iPads, AirPods, MacBooks and more still available today - Engadget", "summary": "The best Prime Day Apple deals on iPads, AirPods, MacBooks and more still available today Engadget", "provider": "Sat, 12 Jul 2025 12:58:41 GMT"}, "16": {"title": "Here Are The Best Apple Deals You Can Still Get Before Amazon Prime Day Ends - MacRumors", "summary": "Here Are The Best Apple Deals You Can Still Get Before Amazon Prime Day Ends MacRumors", "provider": "Fri, 11 Jul 2025 16:13:06 GMT"}, "17": {"title": "Beelink Mate Mini Add Dual M.2 Storage to an Apple Mac Mini - ServeTheHome", "summary": "Beelink Mate Mini Add Dual M.2 Storage to an Apple Mac Mini ServeTheHome", "provider": "Sun, 13 Jul 2025 17:00:14 GMT"}}, "Amazon": {"0": {"title": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more - Yahoo", "summary": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more YahooAmazon Prime Day Ends Tonight — 259 Best Deals You Don’t Want to Miss NBC NewsAmazon Prime Day ", "provider": "Sat, 12 Jul 2025 13:33:15 GMT"}, "1": {"title": "Trump’s Purge of Foreign Workers Arrives at Amazon’s Warehouses - The New York Times", "summary": "Trump’s Purge of Foreign Workers Arrives at Amazon’s Warehouses The New York Times", "provider": "Fri, 11 Jul 2025 16:03:17 GMT"}, "2": {"title": "We Found a Beach Tote (and Accessories!) That Will Actually Keep Your Stuff Dry All Summer Long - People.com", "summary": "We Found a Beach Tote (and Accessories!) That Will Actually Keep Your Stuff Dry All Summer Long People.com", "provider": "Mon, 14 Jul 2025 00:00:00 GMT"}, "3": {"title": "Amazon Prime Day 2025 delivers record sales and savings in expanded four-day shopping event - AboutAmazon.com", "summary": "Amazon Prime Day 2025 delivers record sales and savings in expanded four-day shopping event AboutAmazon.com", "provider": "Sat, 12 Jul 2025 16:01:42 GMT"}, "4": {"title": "Best Amazon Deals Still Available After Prime Day 2025 - NBC News", "summary": "Best Amazon Deals Still Available After Prime Day 2025 NBC News", "provider": "Sat, 12 Jul 2025 10:42:42 GMT"}, "5": {"title": "I've been on Amazon for 5 months and haven't sold anything. After talking to experts, I'm planning to make 2 changes. - Business Insider", "summary": "I've been on Amazon for 5 months and haven't sold anything. After talking to experts, I'm planning to make 2 changes. Business Insider", "provider": "Sun, 13 Jul 2025 09:05:00 GMT"}, "6": {"title": "My Doctor Dad Tells Me to Never Forget These 15 Crucial Items When I Travel—All Under $40 at Amazon - Travel + Leisure", "summary": "My Doctor Dad Tells Me to Never Forget These 15 Crucial Items When I Travel—All Under $40 at Amazon Travel + Leisure", "provider": "Fri, 11 Jul 2025 09:00:00 GMT"}, "7": {"title": "Prime Day Regrets? My Secret to Returning Amazon Items for Free - CNET", "summary": "Prime Day Regrets? My Secret to Returning Amazon Items for Free CNET", "provider": "Sun, 13 Jul 2025 09:30:00 GMT"}, "8": {"title": "Amazon Is Selling a 'Lightweight' $30 Dress for Just $15, and Shoppers Say It's 'Ideal for Warm Weather' - parade.com", "summary": "Amazon Is Selling a 'Lightweight' $30 Dress for Just $15, and Shoppers Say It's 'Ideal for Warm Weather' parade.com", "provider": "Sun, 13 Jul 2025 17:00:28 GMT"}, "9": {"title": "44 Products From Amazon's \"Most Wished For\" Section That Definitely Deserve A Spot On *Your* Wishlist - BuzzFeed", "summary": "44 Products From Amazon's \"Most Wished For\" Section That Definitely Deserve A Spot On *Your* Wishlist BuzzFeed", "provider": "Sun, 13 Jul 2025 00:31:03 GMT"}, "10": {"title": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more - Yahoo", "summary": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more Yahoo", "provider": "Mon, 14 Jul 2025 01:03:03 GMT"}, "11": {"title": "Amazon Prime Day deals end soon! Shop the 250+ best last-minute deals still available from brands like Apple and Yeti - AboutAmazon.com", "summary": "Amazon Prime Day deals end soon! Shop the 250+ best last-minute deals still available from brands like Apple and Yeti AboutAmazon.com", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "12": {"title": "Former Amazon principal engineer says he spent '1-4 hours' reading daily — and it's part of the company's 'secret sauce' - Business Insider", "summary": "Former Amazon principal engineer says he spent '1-4 hours' reading daily — and it's part of the company's 'secret sauce' Business Insider", "provider": "Sun, 13 Jul 2025 15:17:00 GMT"}, "13": {"title": "Amazon: Expect Big AWS Updates Next Week - Seeking Alpha", "summary": "Amazon: Expect Big AWS Updates Next Week Seeking Alpha", "provider": "Sun, 13 Jul 2025 14:25:00 GMT"}, "14": {"title": "30+ Most Popular Amazon Prime Day 2025 Deals That Won’t Last Long - TODAY.com", "summary": "30+ Most Popular Amazon Prime Day 2025 Deals That Won’t Last Long TODAY.com", "provider": "Sat, 12 Jul 2025 14:41:00 GMT"}, "15": {"title": "Amazon Prime Day 2025 racks up record sales figures, company says - USA Today", "summary": "Amazon Prime Day 2025 racks up record sales figures, company says USA Today", "provider": "Sat, 12 Jul 2025 20:11:52 GMT"}, "16": {"title": "What GQ Editors Are Actually Buying On Amazon Prime Day 2025 - GQ", "summary": "What GQ Editors Are Actually Buying On Amazon Prime Day 2025 GQ", "provider": "Fri, 11 Jul 2025 13:35:37 GMT"}, "17": {"title": "Summer discounts at Amazon, Walmart and other retailers aren't always as deep as they look - NBC News", "summary": "Summer discounts at Amazon, Walmart and other retailers aren't always as deep as they look NBC News", "provider": "Sun, 13 Jul 2025 11:00:40 GMT"}, "18": {"title": "I’m over 40, and I swear by these Amazon Prime Day beauty deals to delay the signs of aging - CNN", "summary": "I’m over 40, and I swear by these Amazon Prime Day beauty deals to delay the signs of aging CNN", "provider": "Sat, 12 Jul 2025 02:25:00 GMT"}, "19": {"title": "Missed Prime Day? These Amazon Deals Are Still Live Today - TODAY.com", "summary": "Missed Prime Day? These Amazon Deals Are Still Live Today TODAY.com", "provider": "Sat, 12 Jul 2025 13:33:43 GMT"}, "20": {"title": "JPMorgan Lifts PT on Amazon.com (AMZN) Stock, Keeps Overweight - Yahoo Finance", "summary": "JPMorgan Lifts PT on Amazon.com (AMZN) Stock, Keeps Overweight Yahoo Finance", "provider": "Sun, 13 Jul 2025 19:25:15 GMT"}, "21": {"title": "How Amazon is helping flood-impacted communities across central Texas - AboutAmazon.com", "summary": "How Amazon is helping flood-impacted communities across central Texas AboutAmazon.com", "provider": "Wed, 09 Jul 2025 23:12:40 GMT"}, "22": {"title": "The 157+ Best Prime Day Deals Actually Worth Your Money - NBC News", "summary": "The 157+ Best Prime Day Deals Actually Worth Your Money NBC News", "provider": "Thu, 10 Jul 2025 02:00:00 GMT"}, "23": {"title": "Only hours remain of Amazon Prime Day: Grab these last-minute deals before it's too late - SFGATE", "summary": "Only hours remain of Amazon Prime Day: Grab these last-minute deals before it's too late SFGATE", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "24": {"title": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services - Amazon.com", "summary": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services Amazon.com", "provider": "Wed, 09 Jul 2025 20:55:03 GMT"}, "25": {"title": "Amazon CEO sparks backlash after announcing major company shift in mass email: 'Should change the way our work is done' - The Cool Down", "summary": "Amazon CEO sparks backlash after announcing major company shift in mass email: 'Should change the way our work is done' The Cool Down", "provider": "Sun, 13 Jul 2025 06:30:00 GMT"}, "26": {"title": "Amazon Dodges 35% Prime Day Sales Drop by Stretching It to Four Days - Adweek", "summary": "Amazon Dodges 35% Prime Day Sales Drop by Stretching It to Four Days Adweek", "provider": "Fri, 11 Jul 2025 20:50:21 GMT"}, "27": {"title": "The best Amazon Prime Day deals you can still shop today (yes, really!) - USA Today", "summary": "The best Amazon Prime Day deals you can still shop today (yes, really!) USA Today", "provider": "Sat, 12 Jul 2025 21:51:15 GMT"}, "28": {"title": "Amazon boasts futuristic robots have 'a sense of touch.' Teradyne is key supplier behind this new innovation. - Yahoo Finance", "summary": "Amazon boasts futuristic robots have 'a sense of touch.' Teradyne is key supplier behind this new innovation. Yahoo Finance", "provider": "Sun, 13 Jul 2025 16:02:13 GMT"}, "29": {"title": "The 100+ Best Prime Day Deals You Can Still Buy Right Now - GQ", "summary": "The 100+ Best Prime Day Deals You Can Still Buy Right Now GQ", "provider": "Sat, 12 Jul 2025 15:30:12 GMT"}, "30": {"title": "When does Amazon Prime Day end? What you need to know about the summer sales event - USA Today", "summary": "When does Amazon Prime Day end? What you need to know about the summer sales event USA Today", "provider": "Fri, 11 Jul 2025 17:21:48 GMT"}, "31": {"title": "Amazon Is Surprising Shoppers With an Extra Day of Prime Day Deals—Up to 86% Off - Travel + Leisure", "summary": "Amazon Is Surprising Shoppers With an Extra Day of Prime Day Deals—Up to 86% Off Travel + Leisure", "provider": "Sat, 12 Jul 2025 10:00:00 GMT"}, "32": {"title": "‘Scamazon’ – how fake emails are targeting Prime subscribers - The Guardian", "summary": "‘Scamazon’ – how fake emails are targeting Prime subscribers The Guardian", "provider": "Sun, 13 Jul 2025 07:01:00 GMT"}, "33": {"title": "Amazon Stock Gets Price Target Hike As Analyst Sees AI Boosting Cloud Growth - Investor's Business Daily", "summary": "Amazon Stock Gets Price Target Hike As Analyst Sees AI Boosting Cloud Growth Investor's Business Daily", "provider": "Fri, 11 Jul 2025 15:54:00 GMT"}, "34": {"title": "It's the Final Hours of Prime Day: We're Tracking the Deals + Trends - WIRED", "summary": "It's the Final Hours of Prime Day: We're Tracking the Deals + Trends WIRED", "provider": "Thu, 10 Jul 2025 19:31:29 GMT"}, "35": {"title": "Amazon looking to hire 1,000 full-time workers at Elkhart County fulfillment center - WNDU", "summary": "Amazon looking to hire 1,000 full-time workers at Elkhart County fulfillment center WNDU", "provider": "Fri, 11 Jul 2025 15:55:00 GMT"}, "36": {"title": "I spent an hour digging through the land mine that is Amazon Haul — Here's what's worth buying, and how you can save an extra 40% off during Prime Day - Business Insider", "summary": "I spent an hour digging through the land mine that is Amazon Haul — Here's what's worth buying, and how you can save an extra 40% off during Prime Day Business Insider", "provider": "Sat, 12 Jul 2025 00:09:00 GMT"}, "37": {"title": "Is Amazon’s Prime Day sale still clicking with shoppers? Some early data suggest people are spending less this year. - MarketWatch", "summary": "Is Amazon’s Prime Day sale still clicking with shoppers? Some early data suggest people are spending less this year. MarketWatch", "provider": "Thu, 10 Jul 2025 20:52:00 GMT"}, "38": {"title": "Amazon (AMZN)’s AI Push Could Fuel AWS Growth—And Wall Street Is Finally Noticing - Yahoo Finance", "summary": "Amazon (AMZN)’s AI Push Could Fuel AWS Growth—And Wall Street Is Finally Noticing Yahoo Finance", "provider": "Sun, 13 Jul 2025 15:50:42 GMT"}, "39": {"title": "Amazon’s Prime Day event is back this July - AboutAmazon.com", "summary": "Amazon’s Prime Day event is back this July AboutAmazon.com", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "40": {"title": "Amazon Prime Day Ends Tonight. Here Are 100+ of The Best Deals We've Found. | Reviews by Wirecutter - The New York Times", "summary": "Amazon Prime Day Ends Tonight. Here Are 100+ of The Best Deals We've Found. | Reviews by Wirecutter The New York Times", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "41": {"title": "Amazon Prime Day 2025: These products are seeing their lowest price of the year - WGAL", "summary": "Amazon Prime Day 2025: These products are seeing their lowest price of the year WGAL", "provider": "Thu, 10 Jul 2025 09:51:34 GMT"}, "42": {"title": "What It Takes to Be a Thriving Amazon Seller Making Seven Figures - Business Insider", "summary": "What It Takes to Be a Thriving Amazon Seller Making Seven Figures Business Insider", "provider": "Sun, 13 Jul 2025 10:39:00 GMT"}, "43": {"title": "TikTok poached Amazon employees to jump-start its US business. Now it's doubling down on its Chinese roots. - Business Insider", "summary": "TikTok poached Amazon employees to jump-start its US business. Now it's doubling down on its Chinese roots. Business Insider", "provider": "Fri, 11 Jul 2025 14:35:00 GMT"}, "44": {"title": "The 50 Best Extended Amazon Prime Day Deals You Can Still Shop - People.com", "summary": "The 50 Best Extended Amazon Prime Day Deals You Can Still Shop People.com", "provider": "Sat, 12 Jul 2025 10:30:00 GMT"}, "45": {"title": "Summer savings: How Prime Day 2025 and competing sales are actually going - Axios", "summary": "Summer savings: How Prime Day 2025 and competing sales are actually going Axios", "provider": "Wed, 09 Jul 2025 21:25:37 GMT"}, "46": {"title": "Our Amazon Reviewer Found the Best Kindle and Echo Device Deals - WIRED", "summary": "Our Amazon Reviewer Found the Best Kindle and Echo Device Deals WIRED", "provider": "Fri, 11 Jul 2025 18:59:47 GMT"}, "47": {"title": "Amazon considers another multibillion-dollar investment in Anthropic, FT reports - Reuters", "summary": "Amazon considers another multibillion-dollar investment in Anthropic, FT reports Reuters", "provider": "Thu, 10 Jul 2025 14:46:31 GMT"}, "48": {"title": "Amazon Prime Day Ends TONIGHT: Here Are 24 Items Still Worth Buying - House Beautiful", "summary": "Amazon Prime Day Ends TONIGHT: Here Are 24 Items Still Worth Buying House Beautiful", "provider": "Fri, 11 Jul 2025 17:30:00 GMT"}, "49": {"title": "'It's been hell': Hundreds of Amazon packages fill up San Jose woman's garage after year-long mishap with overseas seller - ABC7 San Francisco", "summary": "'It's been hell': Hundreds of Amazon packages fill up San Jose woman's garage after year-long mishap with overseas seller ABC7 San Francisco", "provider": "Wed, 09 Jul 2025 03:55:39 GMT"}, "50": {"title": "Amazon Stock Has Room to Run. 2 Analysts Raise Price Targets Before Earnings. - Barron's", "summary": "Amazon Stock Has Room to Run. 2 Analysts Raise Price Targets Before Earnings. Barron's", "provider": "Fri, 11 Jul 2025 16:56:00 GMT"}, "51": {"title": "The Best Amazon Prime Day Deals Under $25 on Everyday Essentials - The New York Times", "summary": "The Best Amazon Prime Day Deals Under $25 on Everyday Essentials The New York Times", "provider": "Fri, 11 Jul 2025 19:35:13 GMT"}, "52": {"title": "104 Prime Day Deals Under $100, Curated By a Broke Shopping Editor - Architectural Digest", "summary": "104 Prime Day Deals Under $100, Curated By a Broke Shopping Editor Architectural Digest", "provider": "Fri, 11 Jul 2025 10:03:00 GMT"}, "53": {"title": "It's the Final Prime Day! Shop Now, Before the Best Deals Are Gone - The Spruce", "summary": "It's the Final Prime Day! Shop Now, Before the Best Deals Are Gone The Spruce", "provider": "Sat, 12 Jul 2025 00:25:00 GMT"}, "54": {"title": "Amazon to hire over 1,000 full-time workers for Elkhart fulfillment center - WSBT", "summary": "Amazon to hire over 1,000 full-time workers for Elkhart fulfillment center WSBT", "provider": "Sat, 12 Jul 2025 04:06:02 GMT"}, "55": {"title": "Amazon delivery driver dies as train strikes van in Teynham - BBC", "summary": "Amazon delivery driver dies as train strikes van in Teynham BBC", "provider": "Sun, 13 Jul 2025 20:52:20 GMT"}, "56": {"title": "It's Your Last Day to Grab These Under-the-Radar Amazon Prime Day Outlet Deals - Allrecipes", "summary": "It's Your Last Day to Grab These Under-the-Radar Amazon Prime Day Outlet Deals Allrecipes", "provider": "Fri, 11 Jul 2025 09:35:07 GMT"}, "57": {"title": "It's Your Last Chance to Score 77% Off Kitchen Essentials - Bon Appétit", "summary": "It's Your Last Chance to Score 77% Off Kitchen Essentials Bon Appétit", "provider": "Fri, 11 Jul 2025 22:03:00 GMT"}, "58": {"title": "Over 50 Best Prime Day Deals Under $25: Here Are the Leftover Budget Deals You Can Still Grab - CNET", "summary": "Over 50 Best Prime Day Deals Under $25: Here Are the Leftover Budget Deals You Can Still Grab CNET", "provider": "Sat, 12 Jul 2025 11:17:57 GMT"}, "59": {"title": "Amazon launches a new AI foundation model to power its robotic fleet and deploys its 1 millionth robot - AboutAmazon.com", "summary": "Amazon launches a new AI foundation model to power its robotic fleet and deploys its 1 millionth robot AboutAmazon.com", "provider": "Mon, 30 Jun 2025 07:00:00 GMT"}}, "Alphabet": {"0": {"title": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock - Business Insider", "summary": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock Business Insider", "provider": "Fri, 11 Jul 2025 13:01:00 GMT"}, "1": {"title": "Alphabet Stock Looks Like a Big Tech Bargain - Yahoo Finance", "summary": "Alphabet Stock Looks Like a Big Tech Bargain Yahoo Finance", "provider": "Sat, 12 Jul 2025 12:05:00 GMT"}, "2": {"title": "Alphabet: The Cheapest 'Magnificent 7' Stock Into The Q2 Earnings Season (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet: The Cheapest 'Magnificent 7' Stock Into The Q2 Earnings Season (NASDAQ:GOOGL) Seeking Alpha", "provider": "Fri, 11 Jul 2025 15:35:00 GMT"}, "3": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - Yahoo Finance", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In Yahoo Finance", "provider": "Sat, 12 Jul 2025 10:20:39 GMT"}, "4": {"title": "Warren Buffett’s hidden quantum play: Berkshire Hathaway’s bet on Alphabet and Microsoft’s next big fronti - The Economic Times", "summary": "Warren Buffett’s hidden quantum play: Berkshire Hathaway’s bet on Alphabet and Microsoft’s next big fronti The Economic Times", "provider": "Sat, 12 Jul 2025 09:06:44 GMT"}, "5": {"title": "Alphabet Class C: YouTube’s AI Clampdown and Stock Surge - TipRanks", "summary": "Alphabet Class C: YouTube’s AI Clampdown and Stock Surge TipRanks", "provider": "Sat, 12 Jul 2025 15:14:09 GMT"}, "6": {"title": "Protecting Your Alphabet Position as Regulators Close In - Yahoo Finance", "summary": "Protecting Your Alphabet Position as Regulators Close In Yahoo Finance", "provider": "Fri, 11 Jul 2025 11:26:41 GMT"}, "7": {"title": "Google strikes $2.4 bn deal with Windsurf, to hire CEO Varun Mohan, get AI licensing rights after OpenAI talks collapse - Mint", "summary": "Google strikes $2.4 bn deal with Windsurf, to hire CEO Varun Mohan, get AI licensing rights after OpenAI talks collapse Mint", "provider": "Sat, 12 Jul 2025 12:27:03 GMT"}, "8": {"title": "Do Options Traders Know Something About Alphabet Stock We Don't? - TradingView", "summary": "Do Options Traders Know Something About Alphabet Stock We Don't? TradingView", "provider": "Fri, 11 Jul 2025 12:34:00 GMT"}, "9": {"title": "Google faces threat that could destroy its business - TheStreet", "summary": "Google faces threat that could destroy its business TheStreet", "provider": "Thu, 10 Jul 2025 15:03:00 GMT"}, "10": {"title": "3 Artificial Intelligence (AI) Stocks That Are Hands-Down Better Picks Than Palantir Right Now - Yahoo Finance", "summary": "3 Artificial Intelligence (AI) Stocks That Are Hands-Down Better Picks Than Palantir Right Now Yahoo Finance", "provider": "Sun, 13 Jul 2025 08:25:00 GMT"}, "11": {"title": "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now. - Yahoo Finance", "summary": "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now. Yahoo Finance", "provider": "Sun, 13 Jul 2025 07:15:00 GMT"}, "12": {"title": "Alphabet, Inc. - Britannica", "summary": "Alphabet, Inc. Britannica", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "13": {"title": "Alphabet Stock Looks Like a Big Tech Bargain - The Motley Fool", "summary": "Alphabet Stock Looks Like a Big Tech Bargain The Motley Fool", "provider": "Sat, 12 Jul 2025 12:05:00 GMT"}, "14": {"title": "Why Alphabet’s (GOOGL) Valuation Hints at Stock Rebound - TipRanks", "summary": "Why Alphabet’s (GOOGL) Valuation Hints at Stock Rebound TipRanks", "provider": "Thu, 10 Jul 2025 23:47:24 GMT"}, "15": {"title": "Check Out Lubbock’s Alphabet Dating Challenge! Here’s Letter J - FMX 94.5", "summary": "Check Out Lubbock’s Alphabet Dating Challenge! Here’s Letter J FMX 94.5", "provider": "Wed, 09 Jul 2025 17:03:03 GMT"}, "16": {"title": "Alphabet: Technical Momentum Is Starting to Turn - MarketBeat", "summary": "Alphabet: Technical Momentum Is Starting to Turn MarketBeat", "provider": "Thu, 10 Jul 2025 19:58:56 GMT"}, "17": {"title": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why - Insider Monkey", "summary": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why Insider Monkey", "provider": "Fri, 11 Jul 2025 10:37:27 GMT"}, "18": {"title": "Why Alphabet Stock Popped Today - The Motley Fool", "summary": "Why Alphabet Stock Popped Today The Motley Fool", "provider": "Wed, 09 Jul 2025 19:34:00 GMT"}, "19": {"title": "Alphabet Vs. OpenAI: Why I'm Not Panicking About Chrome (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet Vs. OpenAI: Why I'm Not Panicking About Chrome (NASDAQ:GOOGL) Seeking Alpha", "provider": "Thu, 10 Jul 2025 14:53:00 GMT"}, "20": {"title": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors - Yahoo Finance", "summary": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors Yahoo Finance", "provider": "Tue, 08 Jul 2025 21:45:04 GMT"}, "21": {"title": "Alphabet: Buying Opportunities Like This Don't Come Often (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet: Buying Opportunities Like This Don't Come Often (NASDAQ:GOOGL) Seeking Alpha", "provider": "Wed, 09 Jul 2025 13:20:00 GMT"}, "22": {"title": "Analyst Explains Why Alphabet (GOOG) is ‘Real Alpha’ for Portfolios - Yahoo Finance", "summary": "Analyst Explains Why Alphabet (GOOG) is ‘Real Alpha’ for Portfolios Yahoo Finance", "provider": "Thu, 10 Jul 2025 13:39:35 GMT"}, "23": {"title": "Alphabet's Growth Catalysts Overly Discounted - Double-Down Strong Buy Opportunity - Seeking Alpha", "summary": "Alphabet's Growth Catalysts Overly Discounted - Double-Down Strong Buy Opportunity Seeking Alpha", "provider": "Wed, 09 Jul 2025 13:30:00 GMT"}, "24": {"title": "Why Alphabet Stock Popped Today - Yahoo Finance", "summary": "Why Alphabet Stock Popped Today Yahoo Finance", "provider": "Wed, 09 Jul 2025 19:34:00 GMT"}, "25": {"title": "The Zacks Analyst Blog Highlights Alphabet, Microsoft, Amazon and NVIDIA - Yahoo Finance", "summary": "The Zacks Analyst Blog Highlights Alphabet, Microsoft, Amazon and NVIDIA Yahoo Finance", "provider": "Wed, 09 Jul 2025 10:02:00 GMT"}, "26": {"title": "Do Options Traders Know Something About Alphabet Stock We Don't? - Yahoo Finance", "summary": "Do Options Traders Know Something About Alphabet Stock We Don't? Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:34:00 GMT"}, "27": {"title": "The Zacks Analyst Blog Highlights Tesla, Alphabet and Amazon - Yahoo Finance", "summary": "The Zacks Analyst Blog Highlights Tesla, Alphabet and Amazon Yahoo Finance", "provider": "Fri, 11 Jul 2025 09:12:00 GMT"}, "28": {"title": "Love Is In The Air As Couples Tackle The A To Z Of Lubbock Nights - FMX 94.5", "summary": "Love Is In The Air As Couples Tackle The A To Z Of Lubbock Nights FMX 94.5", "provider": "Fri, 11 Jul 2025 17:01:29 GMT"}, "29": {"title": "Why Alphabet May Be the Most Misunderstood Big Tech Stock - Investing.com", "summary": "Why Alphabet May Be the Most Misunderstood Big Tech Stock Investing.com", "provider": "Fri, 11 Jul 2025 15:06:52 GMT"}, "30": {"title": "A Once-in-a-Decade Opportunity: Alphabet's Stock Looks Like a Brilliant Buy Right Now - The Motley Fool", "summary": "A Once-in-a-Decade Opportunity: Alphabet's Stock Looks Like a Brilliant Buy Right Now The Motley Fool", "provider": "Mon, 07 Jul 2025 09:15:00 GMT"}, "31": {"title": "Lovebirds In Lubbock Are Taking Date Night To The Next Level With A Quirky New Challenge - FMX 94.5", "summary": "Lovebirds In Lubbock Are Taking Date Night To The Next Level With A Quirky New Challenge FMX 94.5", "provider": "Fri, 11 Jul 2025 14:45:07 GMT"}, "32": {"title": "Alecta Pensionsforsakring Reduces Stake in Alphabet Inc. - TipRanks", "summary": "Alecta Pensionsforsakring Reduces Stake in Alphabet Inc. TipRanks", "provider": "Sat, 12 Jul 2025 03:26:16 GMT"}, "33": {"title": "Alphabet Class A: AI Innovations and Stock Prospects - TipRanks", "summary": "Alphabet Class A: AI Innovations and Stock Prospects TipRanks", "provider": "Sat, 12 Jul 2025 15:14:11 GMT"}, "34": {"title": "Google’s Unloved Stock Makes It a Big Tech Bargain - WSJ - The Wall Street Journal", "summary": "Google’s Unloved Stock Makes It a Big Tech Bargain - WSJ The Wall Street Journal", "provider": "Wed, 09 Jul 2025 09:30:00 GMT"}, "35": {"title": "2 Undervalued AI Stocks Poised for Explosive Growth - Yahoo Finance", "summary": "2 Undervalued AI Stocks Poised for Explosive Growth Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:45:00 GMT"}, "36": {"title": "Her 15-year-old son died subway surfing. Now this Alphabet City mother is taking TikTok and Instagram to court - amNewYork", "summary": "Her 15-year-old son died subway surfing. Now this Alphabet City mother is taking TikTok and Instagram to court amNewYork", "provider": "Wed, 09 Jul 2025 21:00:49 GMT"}, "37": {"title": "Alphabet Breakup Could Unleash Cloud Growth -- Analyst Calls It a 'Top Pick' - Yahoo Finance", "summary": "Alphabet Breakup Could Unleash Cloud Growth -- Analyst Calls It a 'Top Pick' Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}, "38": {"title": "Lawmakers Just Accidentally Made Alphabet Irresistibly Attractive (NASDAQ:GOOG) - Seeking Alpha", "summary": "Lawmakers Just Accidentally Made Alphabet Irresistibly Attractive (NASDAQ:GOOG) Seeking Alpha", "provider": "Sat, 05 Jul 2025 07:00:00 GMT"}, "39": {"title": "Prediction: Alphabet's Stock Will Deliver Monster Performance Over the Next 2 Years - The Motley Fool", "summary": "Prediction: Alphabet's Stock Will Deliver Monster Performance Over the Next 2 Years The Motley Fool", "provider": "Sun, 06 Jul 2025 09:30:00 GMT"}, "40": {"title": "Why Is Alphabet Stock Worth Less Than Nvidia, Microsoft, Apple, and Amazon Even Though It Is the Most Profitable S&P 500 Company? - Yahoo Finance", "summary": "Why Is Alphabet Stock Worth Less Than Nvidia, Microsoft, Apple, and Amazon Even Though It Is the Most Profitable S&P 500 Company? Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}, "41": {"title": "US Communications Services: Growth at Alphabet and Meta May Slow, but They Should Maintain Ad Dominance - Morningstar", "summary": "US Communications Services: Growth at Alphabet and Meta May Slow, but They Should Maintain Ad Dominance Morningstar", "provider": "Thu, 10 Jul 2025 10:41:23 GMT"}, "42": {"title": "Nike, Boeing and Alphabet upgraded: Wall Street’s top analyst calls - Yahoo Finance", "summary": "Nike, Boeing and Alphabet upgraded: Wall Street’s top analyst calls Yahoo Finance", "provider": "Sat, 28 Jun 2025 07:00:00 GMT"}, "43": {"title": "AI Names the Greatest Footballer For Every Letter of the Alphabet - No Ronaldo or Maradona - GiveMeSport", "summary": "AI Names the Greatest Footballer For Every Letter of the Alphabet - No Ronaldo or Maradona GiveMeSport", "provider": "Sun, 13 Jul 2025 18:30:00 GMT"}, "44": {"title": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock - MSN", "summary": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock MSN", "provider": "Fri, 11 Jul 2025 15:36:46 GMT"}, "45": {"title": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 - Yahoo Finance", "summary": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 Yahoo Finance", "provider": "Wed, 09 Jul 2025 21:27:01 GMT"}, "46": {"title": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 - Insider Monkey", "summary": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 Insider Monkey", "provider": "Wed, 09 Jul 2025 21:31:05 GMT"}, "47": {"title": "3 Artificial Intelligence (AI) Stocks That Are Hands-Down Better Picks Than Palantir Right Now - The Globe and Mail", "summary": "3 Artificial Intelligence (AI) Stocks That Are Hands-Down Better Picks Than Palantir Right Now The Globe and Mail", "provider": "Sun, 13 Jul 2025 09:28:50 GMT"}, "48": {"title": "Why Alphabet Stock Popped Today - MSN", "summary": "Why Alphabet Stock Popped Today MSN", "provider": "Wed, 09 Jul 2025 20:12:33 GMT"}, "49": {"title": "British Antitrust Case Threatens to Derail Alphabet’s (GOOGL) Monopoly - TipRanks", "summary": "British Antitrust Case Threatens to Derail Alphabet’s (GOOGL) Monopoly TipRanks", "provider": "Wed, 09 Jul 2025 01:27:23 GMT"}, "50": {"title": "10 Reasons to Buy Alphabet Stock Like There's No Tomorrow - Yahoo Finance", "summary": "10 Reasons to Buy Alphabet Stock Like There's No Tomorrow Yahoo Finance", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "51": {"title": "Alphabet price target raised on strong AI adoption, Waymo valuation - Proactive financial news", "summary": "Alphabet price target raised on strong AI adoption, Waymo valuation Proactive financial news", "provider": "Wed, 09 Jul 2025 18:29:00 GMT"}, "52": {"title": "Bitcoin hits new all-time high, outpaces Meta, Alphabet, Saudi Aramco - Informed crypto news", "summary": "Bitcoin hits new all-time high, outpaces Meta, Alphabet, Saudi Aramco Informed crypto news", "provider": "Fri, 11 Jul 2025 10:55:25 GMT"}, "53": {"title": "Isomorphic Labs has grand ambitions to 'solve all diseases' with AI. Now, it's gearing up for its first human trials - Fortune", "summary": "Isomorphic Labs has grand ambitions to 'solve all diseases' with AI. Now, it's gearing up for its first human trials Fortune", "provider": "Sun, 06 Jul 2025 13:00:00 GMT"}, "54": {"title": "EU Releases AI Code As Alphabet, OpenAI, Review Participation - Stocktwits", "summary": "EU Releases AI Code As Alphabet, OpenAI, Review Participation Stocktwits", "provider": "Wed, 09 Jul 2025 01:04:43 GMT"}, "55": {"title": "Alphabet Inc. (GOOGL): I Sold Too Soon, Says Jim Cramer - Yahoo Finance", "summary": "Alphabet Inc. (GOOGL): I Sold Too Soon, Says Jim Cramer Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "56": {"title": "Alphabet, Palantir, AMC, Excellon Resources: What brokers said this week - Proactive financial news", "summary": "Alphabet, Palantir, AMC, Excellon Resources: What brokers said this week Proactive financial news", "provider": "Fri, 11 Jul 2025 15:41:00 GMT"}, "57": {"title": "Is OpenAI's Deal With Alphabet a Game Changer? - The Motley Fool", "summary": "Is OpenAI's Deal With Alphabet a Game Changer? The Motley Fool", "provider": "Sat, 21 Jun 2025 07:00:00 GMT"}, "58": {"title": "Alphabet stock jumps as this analyst maintain buy rating - TradingView", "summary": "Alphabet stock jumps as this analyst maintain buy rating TradingView", "provider": "Wed, 09 Jul 2025 19:52:59 GMT"}, "59": {"title": "The secret alphabet actors use that lets you pronounce any word in any language or accent - Upworthy", "summary": "The secret alphabet actors use that lets you pronounce any word in any language or accent Upworthy", "provider": "Wed, 09 Jul 2025 01:25:17 GMT"}}, "Tesla": {"0": {"title": "Elon Musk’s Companies Had a Busy Weekend. Tesla Investors Should Take Note. - Barron's", "summary": "Elon Musk’s Companies Had a Busy Weekend. Tesla Investors Should Take Note. Barron's", "provider": "Sun, 13 Jul 2025 17:13:00 GMT"}, "1": {"title": "Tesla debuts hands-free Grok AI with update 2025.26: What you need to know - Teslarati", "summary": "Tesla debuts hands-free Grok AI with update 2025.26: What you need to know Teslarati", "provider": "Sat, 12 Jul 2025 19:41:15 GMT"}, "2": {"title": "Musk Suggests Tesla Shareholders Will Vote on xAI Investment - Bloomberg", "summary": "Musk Suggests Tesla Shareholders Will Vote on xAI Investment Bloomberg", "provider": "Mon, 14 Jul 2025 00:09:00 GMT"}, "3": {"title": "The Tesla leaks: what it’s really like to work for Elon Musk - The Times", "summary": "The Tesla leaks: what it’s really like to work for Elon Musk The Times", "provider": "Sat, 12 Jul 2025 21:00:00 GMT"}, "4": {"title": "JPMorgan's top short ideas for the second half including Tesla - CNBC", "summary": "JPMorgan's top short ideas for the second half including Tesla CNBC", "provider": "Sun, 13 Jul 2025 11:40:16 GMT"}, "5": {"title": "Tesla: No Longer Just An Automotive Company But An AI Leader (Rating Upgrade) - Seeking Alpha", "summary": "Tesla: No Longer Just An Automotive Company But An AI Leader (Rating Upgrade) Seeking Alpha", "provider": "Sat, 12 Jul 2025 13:00:00 GMT"}, "6": {"title": "As Tesla Stumbles, SpaceX’s Finances Go From Strength to Strength - The Wall Street Journal", "summary": "As Tesla Stumbles, SpaceX’s Finances Go From Strength to Strength The Wall Street Journal", "provider": "Sat, 12 Jul 2025 01:00:00 GMT"}, "7": {"title": "Why Elon Musk may have reached the end of the road at Tesla - The Telegraph", "summary": "Why Elon Musk may have reached the end of the road at Tesla The Telegraph", "provider": "Sun, 13 Jul 2025 11:00:00 GMT"}, "8": {"title": "'I Don't Think I Ever Want To Go To a Normal Dealership': Man Buys Tesla. Then He Says Buying One Is a 'Next Level' Experience - InsideEVs", "summary": "'I Don't Think I Ever Want To Go To a Normal Dealership': Man Buys Tesla. Then He Says Buying One Is a 'Next Level' Experience InsideEVs", "provider": "Fri, 11 Jul 2025 14:00:00 GMT"}, "9": {"title": "Tesla, EV buyers need to act now if they want $7,500 tax credit - Yahoo Finance", "summary": "Tesla, EV buyers need to act now if they want $7,500 tax credit Yahoo Finance", "provider": "Sat, 12 Jul 2025 11:55:57 GMT"}, "10": {"title": "Tesla's Grok AI Has Landed. Here's What We Know - InsideEVs", "summary": "Tesla's Grok AI Has Landed. Here's What We Know InsideEVs", "provider": "Sun, 13 Jul 2025 16:18:00 GMT"}, "11": {"title": "I've Got a Green Matte Wrap on My Tesla. I Recently Took It to a Detailer, and Now the Hood Looks Blotchy, Uneven, and Has Patches Where the Matte Finish Is Basically Ruined. Any Help or Suggestion...", "summary": "I've Got a Green Matte Wrap on My Tesla. I Recently Took It to a Detailer, and Now the Hood Looks Blotchy, Uneven, and Has Patches Where the Matte Finish Is Basically Ruined. Any Help or Suggestion", "provider": "Sun, 13 Jul 2025 21:50:52 GMT"}, "12": {"title": "Tesla: Here's What People Are Misunderstanding - Seeking Alpha", "summary": "Tesla: Here's What People Are Misunderstanding Seeking Alpha", "provider": "Sun, 13 Jul 2025 09:21:00 GMT"}, "13": {"title": "Tesla, Inc. - Britannica", "summary": "Tesla, Inc. Britannica", "provider": "Thu, 10 Jul 2025 14:55:00 GMT"}, "14": {"title": "The Deep Story On The Waymo Vs Tesla Robotaxi Battle, With Video - Forbes", "summary": "The Deep Story On The Waymo Vs Tesla Robotaxi Battle, With Video Forbes", "provider": "Wed, 09 Jul 2025 12:30:00 GMT"}, "15": {"title": "Tesla vandalism at Maryland school recorded by built-in cameras - NBC4 Washington", "summary": "Tesla vandalism at Maryland school recorded by built-in cameras NBC4 Washington", "provider": "Fri, 11 Jul 2025 17:58:21 GMT"}, "16": {"title": "JPMorgan Says to Short Tesla (TSLA), Moderna (MRNA), and 7 Other Stocks in 2025 - TipRanks", "summary": "JPMorgan Says to Short Tesla (TSLA), Moderna (MRNA), and 7 Other Stocks in 2025 TipRanks", "provider": "Sun, 13 Jul 2025 13:47:08 GMT"}, "17": {"title": "Norway’s Tesla obsession defies Europe’s Musk backlash - CNBC", "summary": "Norway’s Tesla obsession defies Europe’s Musk backlash CNBC", "provider": "Fri, 11 Jul 2025 05:08:57 GMT"}, "18": {"title": "Tesla Sets Date for Shareholders Meeting After Protests - The New York Times", "summary": "Tesla Sets Date for Shareholders Meeting After Protests The New York Times", "provider": "Thu, 10 Jul 2025 15:20:23 GMT"}, "19": {"title": "Tesla Is Headed to Trial Over Another Deadly Autopilot Crash - Business Insider", "summary": "Tesla Is Headed to Trial Over Another Deadly Autopilot Crash Business Insider", "provider": "Sat, 12 Jul 2025 09:02:00 GMT"}, "20": {"title": "Tesla’s rule-breaking board expressing ‘almost a contempt for lawful and accepted procedure’, says governance expert - Fortune", "summary": "Tesla’s rule-breaking board expressing ‘almost a contempt for lawful and accepted procedure’, says governance expert Fortune", "provider": "Fri, 11 Jul 2025 11:08:00 GMT"}, "21": {"title": "Tesla has not yet applied for robotaxi permits in California, state regulators say - Reuters", "summary": "Tesla has not yet applied for robotaxi permits in California, state regulators say Reuters", "provider": "Fri, 11 Jul 2025 00:22:00 GMT"}, "22": {"title": "Man Checks Out Los Angeles’ New, 75-Stall Tesla Supercharging Station. Then He Sees Its Movie Theaters - InsideEVs", "summary": "Man Checks Out Los Angeles’ New, 75-Stall Tesla Supercharging Station. Then He Sees Its Movie Theaters InsideEVs", "provider": "Sun, 13 Jul 2025 14:13:28 GMT"}, "23": {"title": "I Planned to Post a Glowing Tesla Model Y Review After My Remote Western Australia Road Trip, But 700 Miles Away I Ran Into a Sensor Issue - Torque News", "summary": "I Planned to Post a Glowing Tesla Model Y Review After My Remote Western Australia Road Trip, But 700 Miles Away I Ran Into a Sensor Issue Torque News", "provider": "Fri, 11 Jul 2025 10:04:50 GMT"}, "24": {"title": "Tesla’s Sales In The U.S. Market Should Decline Sharply: New Law (NASDAQ:TSLA) - Seeking Alpha", "summary": "Tesla’s Sales In The U.S. Market Should Decline Sharply: New Law (NASDAQ:TSLA) Seeking Alpha", "provider": "Fri, 11 Jul 2025 19:24:00 GMT"}, "25": {"title": "Tesla supplier CATL has potential beyond just batteries, analysts say - CNBC", "summary": "Tesla supplier CATL has potential beyond just batteries, analysts say CNBC", "provider": "Sun, 13 Jul 2025 11:41:31 GMT"}, "26": {"title": "Used Tesla Prices Were Expected To Crash. Then They Didn't - InsideEVs", "summary": "Used Tesla Prices Were Expected To Crash. Then They Didn't InsideEVs", "provider": "Thu, 10 Jul 2025 19:36:00 GMT"}, "27": {"title": "Grok AI to be available in Tesla vehicles next week, Musk says - Reuters", "summary": "Grok AI to be available in Tesla vehicles next week, Musk says Reuters", "provider": "Thu, 10 Jul 2025 10:31:17 GMT"}, "28": {"title": "Tesla to hold annual shareholder meeting in November as investor scrutiny mounts - Reuters", "summary": "Tesla to hold annual shareholder meeting in November as investor scrutiny mounts Reuters", "provider": "Thu, 10 Jul 2025 20:59:35 GMT"}, "29": {"title": "‘Update?!’: Couple Takes Florida Road Trip In A Tesla. Then The Screen Says They’ll Arrive With ‘-2%’ Charge - InsideEVs", "summary": "‘Update?!’: Couple Takes Florida Road Trip In A Tesla. Then The Screen Says They’ll Arrive With ‘-2%’ Charge InsideEVs", "provider": "Sun, 13 Jul 2025 20:33:25 GMT"}, "30": {"title": "Tesla CFO offloads another $1.7M in stock - CFO Dive", "summary": "Tesla CFO offloads another $1.7M in stock CFO Dive", "provider": "Thu, 10 Jul 2025 21:03:54 GMT"}, "31": {"title": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says - Reuters", "summary": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says Reuters", "provider": "Fri, 11 Jul 2025 03:49:00 GMT"}, "32": {"title": "This Could Save Tesla - Medium", "summary": "This Could Save Tesla Medium", "provider": "Wed, 09 Jul 2025 12:07:35 GMT"}, "33": {"title": "Elon Musk Says Grok Is Coming to Tesla EVs - WIRED", "summary": "Elon Musk Says Grok Is Coming to Tesla EVs WIRED", "provider": "Thu, 10 Jul 2025 13:48:42 GMT"}, "34": {"title": "Grok is coming to Tesla vehicles ‘next week,’ says Elon Musk - TechCrunch", "summary": "Grok is coming to Tesla vehicles ‘next week,’ says Elon Musk TechCrunch", "provider": "Thu, 10 Jul 2025 14:22:24 GMT"}, "35": {"title": "Tesla Is Days Away From Violating a Texas Law. What’s Going On? - The New York Times", "summary": "Tesla Is Days Away From Violating a Texas Law. What’s Going On? The New York Times", "provider": "Wed, 09 Jul 2025 11:00:05 GMT"}, "36": {"title": "Tesla slashes prices in Canada despite tariffs as sales basically go to 0 - Electrek", "summary": "Tesla slashes prices in Canada despite tariffs as sales basically go to 0 Electrek", "provider": "Fri, 11 Jul 2025 13:14:00 GMT"}, "37": {"title": "Musk's Tesla marks formal India entry with Mumbai launch event - Reuters", "summary": "Musk's Tesla marks formal India entry with Mumbai launch event Reuters", "provider": "Fri, 11 Jul 2025 06:20:00 GMT"}, "38": {"title": "Tesla Stock Is Down This Month But Elon Musk Just Said Robotaxi Expansion Is Coming - Investor's Business Daily", "summary": "Tesla Stock Is Down This Month But Elon Musk Just Said Robotaxi Expansion Is Coming Investor's Business Daily", "provider": "Thu, 10 Jul 2025 20:06:00 GMT"}, "39": {"title": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says - Fox Business", "summary": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says Fox Business", "provider": "Thu, 10 Jul 2025 20:42:00 GMT"}, "40": {"title": "Billionaire Dan Loeb of Third Point Sold His Entire Stake in Tesla in Favor of a Stock That's Climbed More Than 420,000% Since Its IPO - The Motley Fool", "summary": "Billionaire Dan Loeb of Third Point Sold His Entire Stake in Tesla in Favor of a Stock That's Climbed More Than 420,000% Since Its IPO The Motley Fool", "provider": "Fri, 11 Jul 2025 07:06:00 GMT"}, "41": {"title": "Tesla - finally - announces when it will face its shareholders - CNN", "summary": "Tesla - finally - announces when it will face its shareholders CNN", "provider": "Thu, 10 Jul 2025 17:35:00 GMT"}, "42": {"title": "Tesla introduces new subscription service with major benefits: 'This is a huge jump up in customer protection' - The Cool Down", "summary": "Tesla introduces new subscription service with major benefits: 'This is a huge jump up in customer protection' The Cool Down", "provider": "Sat, 05 Jul 2025 07:00:00 GMT"}, "43": {"title": "Tesla sales soar in Norway with new Model Y leading the charge - Teslarati", "summary": "Tesla sales soar in Norway with new Model Y leading the charge Teslarati", "provider": "Fri, 11 Jul 2025 16:39:07 GMT"}, "44": {"title": "Grok coming to Tesla vehicles 'next week at the latest,' Musk says - USA Today", "summary": "Grok coming to Tesla vehicles 'next week at the latest,' Musk says USA Today", "provider": "Thu, 10 Jul 2025 18:31:51 GMT"}, "45": {"title": "Tesla sold precisely zero cars in Turkey in January—now it’s Elon Musk’s hottest market. Here’s why - Fortune", "summary": "Tesla sold precisely zero cars in Turkey in January—now it’s Elon Musk’s hottest market. Here’s why Fortune", "provider": "Tue, 08 Jul 2025 14:49:00 GMT"}, "46": {"title": "Tesla moves to expand Robotaxi to Phoenix, following rival Waymo - CNBC", "summary": "Tesla moves to expand Robotaxi to Phoenix, following rival Waymo CNBC", "provider": "Thu, 10 Jul 2025 21:16:22 GMT"}, "47": {"title": "Tesla Software Update 2025.26: Grok, Light Sync, Audio Presets and More [VIDEO] - Not a Tesla App", "summary": "Tesla Software Update 2025.26: Grok, Light Sync, Audio Presets and More [VIDEO] Not a Tesla App", "provider": "Sat, 12 Jul 2025 16:24:00 GMT"}, "48": {"title": "Tesla’s Robotaxi Expansion: Tesla Applies in Arizona and Creates Job Postings - Not a Tesla App", "summary": "Tesla’s Robotaxi Expansion: Tesla Applies in Arizona and Creates Job Postings Not a Tesla App", "provider": "Sat, 12 Jul 2025 13:35:00 GMT"}, "49": {"title": "xAI explains the Grok Nazi meltdown, as Tesla puts Elon’s bot in its cars - The Verge", "summary": "xAI explains the Grok Nazi meltdown, as Tesla puts Elon’s bot in its cars The Verge", "provider": "Sun, 13 Jul 2025 00:54:00 GMT"}, "50": {"title": "Elon Musk says Grok is coming to Tesla vehicles just after it went full Hitler - Electrek", "summary": "Elon Musk says Grok is coming to Tesla vehicles just after it went full Hitler Electrek", "provider": "Thu, 10 Jul 2025 13:32:00 GMT"}, "51": {"title": "Elon Musk plans to bring Tesla robotaxis to San Francisco this year - San Francisco Chronicle", "summary": "Elon Musk plans to bring Tesla robotaxis to San Francisco this year San Francisco Chronicle", "provider": "Thu, 10 Jul 2025 19:10:44 GMT"}, "52": {"title": "Tesla to expand robotaxis to San Francisco area within two months, Musk says - Reuters", "summary": "Tesla to expand robotaxis to San Francisco area within two months, Musk says Reuters", "provider": "Thu, 10 Jul 2025 04:35:00 GMT"}, "53": {"title": "Driver who bought 2023 Tesla Model X Plaid for $98,000 shocked after checking value of car 18,000 miles later - supercarblondie.com", "summary": "Driver who bought 2023 Tesla Model X Plaid for $98,000 shocked after checking value of car 18,000 miles later supercarblondie.com", "provider": "Sun, 13 Jul 2025 18:07:00 GMT"}, "54": {"title": "Tesla investors ask board to set date for overdue annual shareholder meeting - Reuters", "summary": "Tesla investors ask board to set date for overdue annual shareholder meeting Reuters", "provider": "Wed, 09 Jul 2025 19:03:47 GMT"}, "55": {"title": "Elon Musk’s Tesla finally sets a shareholder meeting date amid doubts about his long-denied $56 billion pay package - Fortune", "summary": "Elon Musk’s Tesla finally sets a shareholder meeting date amid doubts about his long-denied $56 billion pay package Fortune", "provider": "Thu, 10 Jul 2025 19:13:17 GMT"}, "56": {"title": "Tesla: The Worst Is Yet To Come (Earnings Preview) (NASDAQ:TSLA) - Seeking Alpha", "summary": "Tesla: The Worst Is Yet To Come (Earnings Preview) (NASDAQ:TSLA) Seeking Alpha", "provider": "Thu, 10 Jul 2025 14:10:00 GMT"}, "57": {"title": "Tesla is in deeper trouble than you think - CNN", "summary": "Tesla is in deeper trouble than you think CNN", "provider": "Tue, 08 Jul 2025 20:03:00 GMT"}, "58": {"title": "Tesla makes moves to expand robotaxis in the Bay Area and Phoenix - Business Insider", "summary": "Tesla makes moves to expand robotaxis in the Bay Area and Phoenix Business Insider", "provider": "Fri, 11 Jul 2025 00:14:00 GMT"}, "59": {"title": "Tesla Stock Drops. There’s Bad News on Batteries for Musk's EV Maker. - Barron's", "summary": "Tesla Stock Drops. There’s Bad News on Batteries for Musk's EV Maker. Barron's", "provider": "Fri, 11 Jul 2025 20:20:00 GMT"}}, "UnitedHealth Group Incorporated": {"0": {"title": "Taking on Goliath: Brain surgeon's clash with UnitedHealthcare shows insurer's hardball tactics - NBC News", "summary": "Taking on Goliath: Brain surgeon's clash with UnitedHealthcare shows insurer's hardball tactics NBC News", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "1": {"title": "UnitedHealth Group Incorporated (UNH): \"Medicare Fraud Is Prison,\" Warns Jim Cramer - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH): \"Medicare Fraud Is Prison,\" Warns Jim Cramer Yahoo Finance", "provider": "Sat, 12 Jul 2025 18:43:21 GMT"}, "2": {"title": "UnitedHealth names new Medicaid CEO as part of executive reshuffle - Bloomberg - Investing.com", "summary": "UnitedHealth names new Medicaid CEO as part of executive reshuffle - Bloomberg Investing.com", "provider": "Wed, 09 Jul 2025 21:21:45 GMT"}, "3": {"title": "UnitedHealth Names New Medicaid CEO in Latest Executive Move - Bloomberg", "summary": "UnitedHealth Names New Medicaid CEO in Latest Executive Move Bloomberg", "provider": "Wed, 09 Jul 2025 19:58:35 GMT"}, "4": {"title": "UnitedHealth appoints new CEO to run health services division - Reuters", "summary": "UnitedHealth appoints new CEO to run health services division Reuters", "provider": "Thu, 26 Jun 2025 07:00:00 GMT"}, "5": {"title": "UnitedHealth names new leader of Medicaid unit - report - Seeking Alpha", "summary": "UnitedHealth names new leader of Medicaid unit - report Seeking Alpha", "provider": "Wed, 09 Jul 2025 20:24:00 GMT"}, "6": {"title": "UnitedHealth Group Incorporated Announces Executive Appointments - MarketScreener", "summary": "UnitedHealth Group Incorporated Announces Executive Appointments MarketScreener", "provider": "Thu, 10 Jul 2025 06:50:21 GMT"}, "7": {"title": "UnitedHealth names new chief of government programs, Medicaid unit - Healthcare Dive", "summary": "UnitedHealth names new chief of government programs, Medicaid unit Healthcare Dive", "provider": "Thu, 10 Jul 2025 14:56:26 GMT"}, "8": {"title": "Exclusive | Prosecutors Question Doctors About UnitedHealth’s Medicare Billing Practices - WSJ - The Wall Street Journal", "summary": "Exclusive | Prosecutors Question Doctors About UnitedHealth’s Medicare Billing Practices - WSJ The Wall Street Journal", "provider": "Wed, 09 Jul 2025 14:00:00 GMT"}, "9": {"title": "UnitedHealth’s Campaign to Quiet Critics - The New York Times", "summary": "UnitedHealth’s Campaign to Quiet Critics The New York Times", "provider": "Sat, 12 Jul 2025 09:00:51 GMT"}, "10": {"title": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:00:02 GMT"}, "11": {"title": "UnitedHealth: Pivotal Changes Underway (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth: Pivotal Changes Underway (NYSE:UNH) Seeking Alpha", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "12": {"title": "UnitedHealth Group's Q2 2025 Earnings: What to Expect - MSN", "summary": "UnitedHealth Group's Q2 2025 Earnings: What to Expect MSN", "provider": "Tue, 08 Jul 2025 07:40:10 GMT"}, "13": {"title": "Is UnitedHealth (UNH) a Buy as Wall Street Analysts Look Optimistic? - Yahoo Finance", "summary": "Is UnitedHealth (UNH) a Buy as Wall Street Analysts Look Optimistic? Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:30:03 GMT"}, "14": {"title": "Why The Market Is Wrong About UnitedHealth Group (NYSE:UNH) - Seeking Alpha", "summary": "Why The Market Is Wrong About UnitedHealth Group (NYSE:UNH) Seeking Alpha", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "15": {"title": "Watch the Surge of Insider Buying at UnitedHealth Group - Yahoo Finance", "summary": "Watch the Surge of Insider Buying at UnitedHealth Group Yahoo Finance", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "16": {"title": "UnitedHealth’s Q2 Could Get Messy: Will July 29 Bring Answers? (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth’s Q2 Could Get Messy: Will July 29 Bring Answers? (NYSE:UNH) Seeking Alpha", "provider": "Thu, 10 Jul 2025 13:15:00 GMT"}, "17": {"title": "UnitedHealth Group (UNH) Advances While Market Declines: Some Information for Investors - Yahoo Finance", "summary": "UnitedHealth Group (UNH) Advances While Market Declines: Some Information for Investors Yahoo Finance", "provider": "Tue, 08 Jul 2025 21:50:06 GMT"}, "18": {"title": "UnitedHealth Group's Q2 2025 Earnings: What To Expect - Barchart.com", "summary": "UnitedHealth Group's Q2 2025 Earnings: What To Expect Barchart.com", "provider": "Tue, 08 Jul 2025 07:12:31 GMT"}, "19": {"title": "3 Reasons Warren Buffett Might Buy UnitedHealth Group Stock - The Motley Fool", "summary": "3 Reasons Warren Buffett Might Buy UnitedHealth Group Stock The Motley Fool", "provider": "Thu, 26 Jun 2025 07:00:00 GMT"}, "20": {"title": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers | US Medicare - The Guardian", "summary": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers | US Medicare The Guardian", "provider": "Wed, 21 May 2025 07:00:00 GMT"}, "21": {"title": "UnitedHealth's Rebound: Hidden Strength or Hiding Weakness? - Yahoo Finance", "summary": "UnitedHealth's Rebound: Hidden Strength or Hiding Weakness? Yahoo Finance", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "22": {"title": "Exclusive | UnitedHealth Group Is Under Criminal Investigation for Possible Medicare Fraud - WSJ - The Wall Street Journal", "summary": "Exclusive | UnitedHealth Group Is Under Criminal Investigation for Possible Medicare Fraud - WSJ The Wall Street Journal", "provider": "Thu, 15 May 2025 07:00:00 GMT"}, "23": {"title": "New UnitedHealth CEO Shakes Up Management at Major Division - Bloomberg", "summary": "New UnitedHealth CEO Shakes Up Management at Major Division Bloomberg", "provider": "Thu, 26 Jun 2025 07:00:00 GMT"}, "24": {"title": "Several Headwinds Pulled Down UnitedHealth Group’s (UNH) in Q2 - Yahoo Finance", "summary": "Several Headwinds Pulled Down UnitedHealth Group’s (UNH) in Q2 Yahoo Finance", "provider": "Mon, 07 Jul 2025 11:19:27 GMT"}, "25": {"title": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Fri, 13 Jun 2025 07:00:00 GMT"}, "26": {"title": "UnitedHealth Stock: Margins Are Under Pressure From All Sides (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth Stock: Margins Are Under Pressure From All Sides (NYSE:UNH) Seeking Alpha", "provider": "Sun, 22 Jun 2025 07:00:00 GMT"}, "27": {"title": "UnitedHealth Hits Reset: New Head Of Medicaid Appointed As CEO Reshapes Team - Benzinga", "summary": "UnitedHealth Hits Reset: New Head Of Medicaid Appointed As CEO Reshapes Team Benzinga", "provider": "Thu, 10 Jul 2025 20:22:09 GMT"}, "28": {"title": "DOJ Interviewing Doctors in UnitedHealth Medicare Advantage Probe, Report Says - Investopedia", "summary": "DOJ Interviewing Doctors in UnitedHealth Medicare Advantage Probe, Report Says Investopedia", "provider": "Wed, 09 Jul 2025 15:10:33 GMT"}, "29": {"title": "UnitedHealth Group Incorporated (UNH) Faces Mounting Backlash Amid Billing Disputes, CEO Resignation, and Criminal Probe - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) Faces Mounting Backlash Amid Billing Disputes, CEO Resignation, and Criminal Probe Yahoo Finance", "provider": "Thu, 22 May 2025 07:00:00 GMT"}, "30": {"title": "Is United Health Stock a Buy, Hold or Sell for July 2025? - Yahoo Finance", "summary": "Is United Health Stock a Buy, Hold or Sell for July 2025? Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "31": {"title": "UnitedHealth mandates 4-day office return for hybrid workers in Minnesota and D.C. - The Business Journals", "summary": "UnitedHealth mandates 4-day office return for hybrid workers in Minnesota and D.C. The Business Journals", "provider": "Tue, 24 Jun 2025 07:00:00 GMT"}, "32": {"title": "UnitedHealth names new CEO for Optum Health (UNH:NYSE) - Seeking Alpha", "summary": "UnitedHealth names new CEO for Optum Health (UNH:NYSE) Seeking Alpha", "provider": "Fri, 27 Jun 2025 07:00:00 GMT"}, "33": {"title": "DOJ questions former UnitedHealth staff on Medicare billing practices - report (UNH:NYSE) - Seeking Alpha", "summary": "DOJ questions former UnitedHealth staff on Medicare billing practices - report (UNH:NYSE) Seeking Alpha", "provider": "Wed, 09 Jul 2025 12:34:00 GMT"}, "34": {"title": "Bragar Eagel & Squire, P.C. Reminds Investors That Class - GlobeNewswire", "summary": "Bragar Eagel & Squire, P.C. Reminds Investors That Class GlobeNewswire", "provider": "Sat, 12 Jul 2025 19:27:10 GMT"}, "35": {"title": "One of America’s biggest companies is imploding - CNN", "summary": "One of America’s biggest companies is imploding CNN", "provider": "Thu, 15 May 2025 07:00:00 GMT"}, "36": {"title": "UnitedHealth Group Is In Chaos (UNH) - Seeking Alpha", "summary": "UnitedHealth Group Is In Chaos (UNH) Seeking Alpha", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "37": {"title": "What UnitedHealth Can Do to Revive Its Battered Stock - The Wall Street Journal", "summary": "What UnitedHealth Can Do to Revive Its Battered Stock The Wall Street Journal", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "38": {"title": "Kaskela Law LLC Announces Investigation of UnitedHealth Group Inc. (NYSE: UNH) on Behalf of Long-Term UNH - EIN News", "summary": "Kaskela Law LLC Announces Investigation of UnitedHealth Group Inc. (NYSE: UNH) on Behalf of Long-Term UNH EIN News", "provider": "Wed, 09 Jul 2025 17:33:00 GMT"}, "39": {"title": "Wolfe Adjusts Price Target on UnitedHealth Group to $330 From $363, Maintains Outperform Rating - MarketScreener", "summary": "Wolfe Adjusts Price Target on UnitedHealth Group to $330 From $363, Maintains Outperform Rating MarketScreener", "provider": "Thu, 10 Jul 2025 10:02:53 GMT"}, "40": {"title": "UnitedHealth: Poised For A Rebound (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth: Poised For A Rebound (NYSE:UNH) Seeking Alpha", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "41": {"title": "UnitedHealth Group (UNH) Rises Higher Than Market: Key Facts - Yahoo Finance", "summary": "UnitedHealth Group (UNH) Rises Higher Than Market: Key Facts Yahoo Finance", "provider": "Tue, 24 Jun 2025 07:00:00 GMT"}, "42": {"title": "Is UnitedHealth Group Incorporated (UNH) One of the Best Falling Stocks to Buy According to Analysts? - Yahoo Finance", "summary": "Is UnitedHealth Group Incorporated (UNH) One of the Best Falling Stocks to Buy According to Analysts? Yahoo Finance", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "43": {"title": "UnitedHealth vs. Elevance: Which Healthcare Stock Has More Upside? - Yahoo Finance", "summary": "UnitedHealth vs. Elevance: Which Healthcare Stock Has More Upside? Yahoo Finance", "provider": "Fri, 23 May 2025 07:00:00 GMT"}, "44": {"title": "DOJ questions ex-UnitedHealth doctors in probe into Medicare fraud: report - New York Post", "summary": "DOJ questions ex-UnitedHealth doctors in probe into Medicare fraud: report New York Post", "provider": "Wed, 09 Jul 2025 18:15:00 GMT"}, "45": {"title": "Why UnitedHealth Group Incorporated (UNH) Declined on Tuesday - Yahoo Finance", "summary": "Why UnitedHealth Group Incorporated (UNH) Declined on Tuesday Yahoo Finance", "provider": "Wed, 14 May 2025 07:00:00 GMT"}, "46": {"title": "UnitedHealth Group CEO steps down as company lowers, then withdraws financial outlook for 2025 - AP News", "summary": "UnitedHealth Group CEO steps down as company lowers, then withdraws financial outlook for 2025 AP News", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "47": {"title": "UnitedHealth Stock: Should Investors Bet On A Rebound? - Forbes", "summary": "UnitedHealth Stock: Should Investors Bet On A Rebound? Forbes", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "48": {"title": "AM Best Assigns Issue Credit Ratings to UnitedHealth Group Incorporated’s New Senior Unsecured Notes - Yahoo Finance", "summary": "AM Best Assigns Issue Credit Ratings to UnitedHealth Group Incorporated’s New Senior Unsecured Notes Yahoo Finance", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "49": {"title": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know Yahoo Finance", "provider": "Thu, 22 May 2025 07:00:00 GMT"}, "50": {"title": "Two Healthcare Heavyweights, One Winner: UnitedHealth or CVS Health? - Yahoo Finance", "summary": "Two Healthcare Heavyweights, One Winner: UnitedHealth or CVS Health? Yahoo Finance", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "51": {"title": "UnitedHealth (UNH) PT Trimmed to $385 at UBS - Yahoo Finance", "summary": "UnitedHealth (UNH) PT Trimmed to $385 at UBS Yahoo Finance", "provider": "Wed, 09 Jul 2025 14:25:39 GMT"}, "52": {"title": "Billing or Healing? UnitedHealth's HouseCalls Get a DOJ Checkup - TradingView", "summary": "Billing or Healing? UnitedHealth's HouseCalls Get a DOJ Checkup TradingView", "provider": "Thu, 10 Jul 2025 13:45:00 GMT"}, "53": {"title": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Thu, 08 May 2025 07:00:00 GMT"}, "54": {"title": "UnitedHealth CEO steps down as insurer suspends its financial outlook - Fortune", "summary": "UnitedHealth CEO steps down as insurer suspends its financial outlook Fortune", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "55": {"title": "Internal document shows how UnitedHealth executives prepared to tamp down investor unrest - STAT", "summary": "Internal document shows how UnitedHealth executives prepared to tamp down investor unrest STAT", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "56": {"title": "UnitedHealth’s accidental email attachment, and hospitals’ hunt for ‘additional volume’ - STAT", "summary": "UnitedHealth’s accidental email attachment, and hospitals’ hunt for ‘additional volume’ STAT", "provider": "Mon, 09 Jun 2025 07:00:00 GMT"}, "57": {"title": "UnitedHealth Declines 40.4% YTD: Here's Why it's Still Not a Bargain - Yahoo Finance", "summary": "UnitedHealth Declines 40.4% YTD: Here's Why it's Still Not a Bargain Yahoo Finance", "provider": "Mon, 02 Jun 2025 07:00:00 GMT"}, "58": {"title": "UnitedHealth: Cutting Fair Value Estimate as Medicare Advantage and Other Practices Questioned - Morningstar", "summary": "UnitedHealth: Cutting Fair Value Estimate as Medicare Advantage and Other Practices Questioned Morningstar", "provider": "Thu, 22 May 2025 07:00:00 GMT"}, "59": {"title": "UnitedHealth Group Incorporated (UNH): Among Billionaire Israel Englander’s Stock Picks with Huge Upside Potential - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH): Among Billionaire Israel Englander’s Stock Picks with Huge Upside Potential Yahoo Finance", "provider": "Tue, 29 Apr 2025 07:00:00 GMT"}}, "The Procter & Gamble Company": {"0": {"title": "Procter & Gamble - AOL.com", "summary": "Procter & Gamble AOL.com", "provider": "Mon, 14 Jul 2025 00:39:22 GMT"}, "1": {"title": "Cwm LLC Sells 6,908 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Cwm LLC Sells 6,908 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 11:51:31 GMT"}, "2": {"title": "Procter & Gamble Company (The) (PG) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "Procter & Gamble Company (The) (PG) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:00:03 GMT"}, "3": {"title": "P&G Appoints Craig Arnold to Board of Directors - Procter & Gamble", "summary": "P&G Appoints Craig Arnold to Board of Directors Procter & Gamble", "provider": "Mon, 09 Jun 2025 07:00:00 GMT"}, "4": {"title": "Lobbying Update: $30,000 of PROCTER & GAMBLE COMPANY lobbying was just disclosed - Quiver Quantitative", "summary": "Lobbying Update: $30,000 of PROCTER & GAMBLE COMPANY lobbying was just disclosed Quiver Quantitative", "provider": "Fri, 11 Jul 2025 20:08:00 GMT"}, "5": {"title": "Earnings Preview: What To Expect From Procter & Gamble's Report - Barchart.com", "summary": "Earnings Preview: What To Expect From Procter & Gamble's Report Barchart.com", "provider": "Wed, 09 Jul 2025 12:18:33 GMT"}, "6": {"title": "The Procter & Gamble Company Declares Quarterly Dividend on Common Stock, Payable or after August 15, 2025 - MarketScreener", "summary": "The Procter & Gamble Company Declares Quarterly Dividend on Common Stock, Payable or after August 15, 2025 MarketScreener", "provider": "Tue, 08 Jul 2025 21:05:21 GMT"}, "7": {"title": "MQS Management LLC Takes $1.18 Million Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "MQS Management LLC Takes $1.18 Million Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 12:51:05 GMT"}, "8": {"title": "Here is What to Know Beyond Why Procter & Gamble Company (The) (PG) is a Trending Stock - Yahoo Finance", "summary": "Here is What to Know Beyond Why Procter & Gamble Company (The) (PG) is a Trending Stock Yahoo Finance", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "9": {"title": "From Internship to Impact: How P&G Interns Make a Difference from Day 1 - Procter & Gamble", "summary": "From Internship to Impact: How P&G Interns Make a Difference from Day 1 Procter & Gamble", "provider": "Sat, 28 Jun 2025 07:00:00 GMT"}, "10": {"title": "LRI Investments LLC Sells 2,621 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "LRI Investments LLC Sells 2,621 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 12:37:49 GMT"}, "11": {"title": "Westmount Partners LLC Sells 1,886 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Westmount Partners LLC Sells 1,886 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 10:41:13 GMT"}, "12": {"title": "Procter & Gamble Company (The) (NYSE:PG) Holdings Lifted by TFR Capital LLC. - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Holdings Lifted by TFR Capital LLC. MarketBeat", "provider": "Sun, 13 Jul 2025 11:43:28 GMT"}, "13": {"title": "TruNorth Capital Management LLC Purchases 1,803 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "TruNorth Capital Management LLC Purchases 1,803 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 10:53:12 GMT"}, "14": {"title": "Asset Dedication LLC Trims Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Asset Dedication LLC Trims Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 11:51:31 GMT"}, "15": {"title": "Joseph Group Capital Management Has $4.96 Million Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Joseph Group Capital Management Has $4.96 Million Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 08:11:42 GMT"}, "16": {"title": "Mutual of America Capital Management LLC Reduces Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Mutual of America Capital Management LLC Reduces Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 09:53:40 GMT"}, "17": {"title": "Lane & Associates LLC Acquires 3,395 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Lane & Associates LLC Acquires 3,395 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sat, 12 Jul 2025 11:34:59 GMT"}, "18": {"title": "Procter & Gamble Company (The) (NYSE:PG) Position Boosted by Stillwater Wealth Management Group - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Position Boosted by Stillwater Wealth Management Group MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "19": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Purchased by Arizona State Retirement System - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Purchased by Arizona State Retirement System MarketBeat", "provider": "Sat, 12 Jul 2025 13:16:49 GMT"}, "20": {"title": "Northwest Capital Management Inc Sells 7,507 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Northwest Capital Management Inc Sells 7,507 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "21": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by IFC Advisors LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by IFC Advisors LLC MarketBeat", "provider": "Sat, 12 Jul 2025 11:36:56 GMT"}, "22": {"title": "Callahan Advisors LLC Raises Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Callahan Advisors LLC Raises Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Fri, 11 Jul 2025 13:37:35 GMT"}, "23": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by SteelPeak Wealth LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by SteelPeak Wealth LLC MarketBeat", "provider": "Fri, 11 Jul 2025 12:37:25 GMT"}, "24": {"title": "The Procter & Gamble Company (PG): A Bull Case Theory - Yahoo Finance", "summary": "The Procter & Gamble Company (PG): A Bull Case Theory Yahoo Finance", "provider": "Fri, 06 Jun 2025 07:00:00 GMT"}, "25": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by Main Street Research LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by Main Street Research LLC MarketBeat", "provider": "Wed, 09 Jul 2025 14:37:32 GMT"}, "26": {"title": "Blue Square Asset Management LLC Decreases Stock Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Blue Square Asset Management LLC Decreases Stock Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sat, 12 Jul 2025 10:36:09 GMT"}, "27": {"title": "Procter & Gamble Company (The) (NYSE:PG) Stake Boosted by OLD Republic International Corp - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Stake Boosted by OLD Republic International Corp MarketBeat", "provider": "Thu, 10 Jul 2025 07:00:00 GMT"}, "28": {"title": "Procter & Gamble to cut 7,000 jobs to invest in new growth initiatives - WCPO 9 Cincinnati", "summary": "Procter & Gamble to cut 7,000 jobs to invest in new growth initiatives WCPO 9 Cincinnati", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "29": {"title": "Dividend Roundup: CVS Health, Procter & Gamble, AbbVie, Colgate-Palmolive, and more (PG:NYSE) - Seeking Alpha", "summary": "Dividend Roundup: CVS Health, Procter & Gamble, AbbVie, Colgate-Palmolive, and more (PG:NYSE) Seeking Alpha", "provider": "Fri, 11 Jul 2025 12:17:00 GMT"}, "30": {"title": "The Future of Collaboration: How AI is Supplementing Teamwork and Innovation at P&G - Procter & Gamble", "summary": "The Future of Collaboration: How AI is Supplementing Teamwork and Innovation at P&G Procter & Gamble", "provider": "Fri, 04 Apr 2025 07:00:00 GMT"}, "31": {"title": "Financial Gravity Asset Management Inc. Purchases New Stake in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Financial Gravity Asset Management Inc. Purchases New Stake in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Thu, 10 Jul 2025 13:45:33 GMT"}, "32": {"title": "The Procter & Gamble Company (PG) Is Expected to Cut 7,000 Jobs Over the Next 2 Years - Insider Monkey", "summary": "The Procter & Gamble Company (PG) Is Expected to Cut 7,000 Jobs Over the Next 2 Years Insider Monkey", "provider": "Sun, 06 Jul 2025 07:41:49 GMT"}, "33": {"title": "Stegent Equity Advisors Inc. Lowers Stock Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Stegent Equity Advisors Inc. Lowers Stock Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Fri, 11 Jul 2025 12:26:25 GMT"}, "34": {"title": "Multi-Generational Families at P&G: The Legacy Continues - Procter & Gamble", "summary": "Multi-Generational Families at P&G: The Legacy Continues Procter & Gamble", "provider": "Thu, 10 Apr 2025 07:00:00 GMT"}, "35": {"title": "Greenleaf Trust Sells 1,735 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Greenleaf Trust Sells 1,735 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Wed, 09 Jul 2025 12:22:14 GMT"}, "36": {"title": "Quotient Wealth Partners LLC Sells 1,987 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Quotient Wealth Partners LLC Sells 1,987 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Wed, 09 Jul 2025 14:37:32 GMT"}, "37": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by Yacktman Asset Management LP - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by Yacktman Asset Management LP MarketBeat", "provider": "Wed, 09 Jul 2025 12:22:14 GMT"}, "38": {"title": "Procter & Gamble Company (The) (NYSE:PG) Stock Position Reduced by Flossbach Von Storch SE - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Stock Position Reduced by Flossbach Von Storch SE MarketBeat", "provider": "Wed, 09 Jul 2025 12:22:14 GMT"}, "39": {"title": "P&G’s North America Logistics Summit Honors Top Carriers and Suppliers - Procter & Gamble", "summary": "P&G’s North America Logistics Summit Honors Top Carriers and Suppliers Procter & Gamble", "provider": "Mon, 26 May 2025 07:00:00 GMT"}, "40": {"title": "Jim Cramer Says The Procter & Gamble Company (PG) May Blow Numbers Away - Yahoo Finance", "summary": "Jim Cramer Says The Procter & Gamble Company (PG) May Blow Numbers Away Yahoo Finance", "provider": "Mon, 21 Apr 2025 07:00:00 GMT"}, "41": {"title": "Innovation at Scale: How P&G Transforms Business Through Technology - Procter & Gamble", "summary": "Innovation at Scale: How P&G Transforms Business Through Technology Procter & Gamble", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "42": {"title": "Nisa Investment Advisors LLC Lowers Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Nisa Investment Advisors LLC Lowers Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Wed, 09 Jul 2025 14:21:13 GMT"}, "43": {"title": "EPA and The Procter & Gamble Company - U.S. Environmental Protection Agency (.gov)", "summary": "EPA and The Procter & Gamble Company U.S. Environmental Protection Agency (.gov)", "provider": "Mon, 05 May 2025 07:00:00 GMT"}, "44": {"title": "Brown Advisory Inc. Sells 3,378 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Brown Advisory Inc. Sells 3,378 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Tue, 08 Jul 2025 11:46:30 GMT"}, "45": {"title": "Heritage Wealth Management Inc. Has $19.36 Million Stock Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Heritage Wealth Management Inc. Has $19.36 Million Stock Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Thu, 10 Jul 2025 07:00:00 GMT"}, "46": {"title": "The Procter & Gamble Company (PG) One of 24 Original Dividend Aristocrats Still in the Index - Insider Monkey", "summary": "The Procter & Gamble Company (PG) One of 24 Original Dividend Aristocrats Still in the Index Insider Monkey", "provider": "Mon, 30 Jun 2025 21:18:32 GMT"}, "47": {"title": "Procter & Gamble announces layoffs, but no indication Wyoming County plant will be affected - Scranton Times-Tribune", "summary": "Procter & Gamble announces layoffs, but no indication Wyoming County plant will be affected Scranton Times-Tribune", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "48": {"title": "Procter & Gamble Vs Unilever: Who Holds the Power in the FMCG Race? - Yahoo Finance", "summary": "Procter & Gamble Vs Unilever: Who Holds the Power in the FMCG Race? Yahoo Finance", "provider": "Wed, 28 May 2025 07:00:00 GMT"}, "49": {"title": "Procter & Gamble Maintains Outperform Rating Amid Organizational Restructuring - Yahoo Finance", "summary": "Procter & Gamble Maintains Outperform Rating Amid Organizational Restructuring Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}, "50": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Acquired by Cerity Partners LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Acquired by Cerity Partners LLC MarketBeat", "provider": "Fri, 11 Jul 2025 10:45:27 GMT"}, "51": {"title": "QRG Capital Management Inc. Boosts Stake in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "QRG Capital Management Inc. Boosts Stake in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Thu, 19 Jun 2025 07:00:00 GMT"}, "52": {"title": "Procter & Gamble Reports 5% Increase in Net Sales - TipRanks", "summary": "Procter & Gamble Reports 5% Increase in Net Sales TipRanks", "provider": "Tue, 08 Jul 2025 20:50:47 GMT"}, "53": {"title": "Procter & Gamble CEO warns tariff uncertainty to continue - Yahoo Finance", "summary": "Procter & Gamble CEO warns tariff uncertainty to continue Yahoo Finance", "provider": "Thu, 24 Apr 2025 07:00:00 GMT"}, "54": {"title": "Procter & Gamble Slips Below 50-Day SMA: Time to Buy or Exit? - Yahoo Finance", "summary": "Procter & Gamble Slips Below 50-Day SMA: Time to Buy or Exit? Yahoo Finance", "provider": "Wed, 11 Jun 2025 07:00:00 GMT"}, "55": {"title": "Procter & Gamble Company (The) (NYSE:PG) is Liberty One Investment Management LLC's 9th Largest Position - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) is Liberty One Investment Management LLC's 9th Largest Position MarketBeat", "provider": "Tue, 08 Jul 2025 12:46:33 GMT"}, "56": {"title": "Pampers maker Procter & Gamble to cut up to 7,000 jobs as companies are buffeted by higher costs - AP News", "summary": "Pampers maker Procter & Gamble to cut up to 7,000 jobs as companies are buffeted by higher costs AP News", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "57": {"title": "Procter & Gamble to cut 7,000 jobs over two years - FOX19 | Cincinnati", "summary": "Procter & Gamble to cut 7,000 jobs over two years FOX19 | Cincinnati", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "58": {"title": "Investors Heavily Search Procter & Gamble Company (The) (PG): Here is What You Need to Know - Yahoo Finance", "summary": "Investors Heavily Search Procter & Gamble Company (The) (PG): Here is What You Need to Know Yahoo Finance", "provider": "Mon, 30 Jun 2025 07:00:00 GMT"}, "59": {"title": "Procter & Gamble Vs Colgate: Which is a Smarter Stock to Own Now? - Yahoo Finance", "summary": "Procter & Gamble Vs Colgate: Which is a Smarter Stock to Own Now? Yahoo Finance", "provider": "Thu, 01 May 2025 07:00:00 GMT"}}, "Lucid Group, Inc.": {"0": {"title": "Should You Buy Lucid Stock While It's Below $2.50? - Yahoo Finance", "summary": "Should You Buy Lucid Stock While It's Below $2.50? Yahoo Finance", "provider": "Sun, 13 Jul 2025 08:30:00 GMT"}, "1": {"title": "Lucid Announces Q2 Production & Deliveries, Sets Date for Second Quarter 2025 Results - Lucid Motors", "summary": "Lucid Announces Q2 Production & Deliveries, Sets Date for Second Quarter 2025 Results Lucid Motors", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "2": {"title": "Four Seasons Resort Orlando and Lucid Team Up to Offer Guests Sustainable Driving Experiences - Four Seasons Press Room", "summary": "Four Seasons Resort Orlando and Lucid Team Up to Offer Guests Sustainable Driving Experiences Four Seasons Press Room", "provider": "Fri, 11 Jul 2025 13:20:30 GMT"}, "3": {"title": "Lucid Group (LCID) Rises 9% After Bagging New World Record for Longest EV Journey in One Charge - MSN", "summary": "Lucid Group (LCID) Rises 9% After Bagging New World Record for Longest EV Journey in One Charge MSN", "provider": "Thu, 10 Jul 2025 12:27:52 GMT"}, "4": {"title": "Lucid Group, Inc. (NASDAQ:LCID) Receives Average Recommendation of \"Hold\" from Analysts - MarketBeat", "summary": "Lucid Group, Inc. (NASDAQ:LCID) Receives Average Recommendation of \"Hold\" from Analysts MarketBeat", "provider": "Sat, 12 Jul 2025 07:37:17 GMT"}, "5": {"title": "Prediction: Buying Lucid Group Stock Today Could Set You Up for Life - Yahoo Finance", "summary": "Prediction: Buying Lucid Group Stock Today Could Set You Up for Life Yahoo Finance", "provider": "Thu, 10 Jul 2025 14:00:00 GMT"}, "6": {"title": "Lucid Group Partners with Graphite One: Ushering a New Era in Domestic Graphite Supply Chain - StocksToTrade", "summary": "Lucid Group Partners with Graphite One: Ushering a New Era in Domestic Graphite Supply Chain StocksToTrade", "provider": "Tue, 08 Jul 2025 16:05:00 GMT"}, "7": {"title": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS™ Title with 1,205 kilometers on a Single Charge - Lucid Motors", "summary": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS™ Title with 1,205 kilometers on a Single Charge Lucid Motors", "provider": "Tue, 08 Jul 2025 12:02:28 GMT"}, "8": {"title": "Lucid Group (NASDAQ:LCID) Stock Price Up 2% - What's Next? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Stock Price Up 2% - What's Next? MarketBeat", "provider": "Sun, 13 Jul 2025 00:13:24 GMT"}, "9": {"title": "Prediction: Lucid Group Could Lose a $200 Million Revenue Source That Is Nearly 100% Profit - Yahoo Finance", "summary": "Prediction: Lucid Group Could Lose a $200 Million Revenue Source That Is Nearly 100% Profit Yahoo Finance", "provider": "Sat, 12 Jul 2025 08:43:00 GMT"}, "10": {"title": "Lucid Announces First Quarter 2025 Financial Results - Lucid Motors", "summary": "Lucid Announces First Quarter 2025 Financial Results Lucid Motors", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "11": {"title": "Lucid Group (NASDAQ:LCID) Shares Up 5.5% - What's Next? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Shares Up 5.5% - What's Next? MarketBeat", "provider": "Fri, 11 Jul 2025 20:37:35 GMT"}, "12": {"title": "Lucid Strengthens Leadership Team as Company Prepares for Growth - Lucid Motors", "summary": "Lucid Strengthens Leadership Team as Company Prepares for Growth Lucid Motors", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "13": {"title": "Investors Purchase High Volume of Call Options on Lucid Group (NASDAQ:LCID) - MarketBeat", "summary": "Investors Purchase High Volume of Call Options on Lucid Group (NASDAQ:LCID) MarketBeat", "provider": "Sat, 12 Jul 2025 07:00:00 GMT"}, "14": {"title": "Lucid Group (LCID) Outperforms Broader Market: What You Need to Know - Yahoo Finance", "summary": "Lucid Group (LCID) Outperforms Broader Market: What You Need to Know Yahoo Finance", "provider": "Thu, 10 Jul 2025 22:15:02 GMT"}, "15": {"title": "Lucid Strengthens US Supply Chain with New Graphite Material Supply Agreement with Graphite One - Lucid Motors", "summary": "Lucid Strengthens US Supply Chain with New Graphite Material Supply Agreement with Graphite One Lucid Motors", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "16": {"title": "Android Auto™ Compatibility Now Available to Lucid Air Owners - Lucid Motors", "summary": "Android Auto™ Compatibility Now Available to Lucid Air Owners Lucid Motors", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "17": {"title": "Lucid Group (LCID Stock) Sets New EV Standard: Highest Efficiency and 30% Lower Emissions - CarbonCredits.com", "summary": "Lucid Group (LCID Stock) Sets New EV Standard: Highest Efficiency and 30% Lower Emissions CarbonCredits.com", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "18": {"title": "Rivian, Lucid to Benefit From Trump Tax Bill, BNP Paribas Says - The Business Download |", "summary": "Rivian, Lucid to Benefit From Trump Tax Bill, BNP Paribas Says The Business Download |", "provider": "Sat, 12 Jul 2025 19:04:54 GMT"}, "19": {"title": "Where Will Lucid Group Be in 10 Years? - The Motley Fool", "summary": "Where Will Lucid Group Be in 10 Years? The Motley Fool", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "20": {"title": "EV maker Lucid's quarterly deliveries rise but miss estimates - Reuters", "summary": "EV maker Lucid's quarterly deliveries rise but miss estimates Reuters", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "21": {"title": "Is Lucid Group Stock a Millionaire Maker? - The Motley Fool", "summary": "Is Lucid Group Stock a Millionaire Maker? The Motley Fool", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "22": {"title": "Vontobel Holding Ltd. Acquires 289,880 Shares of Lucid Group, Inc. (NASDAQ:LCID) - MarketBeat", "summary": "Vontobel Holding Ltd. Acquires 289,880 Shares of Lucid Group, Inc. (NASDAQ:LCID) MarketBeat", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "23": {"title": "Lucid Announces CEO Transition - Lucid Motors", "summary": "Lucid Announces CEO Transition Lucid Motors", "provider": "Tue, 25 Feb 2025 08:00:00 GMT"}, "24": {"title": "Is Lucid Group (LCID) the High Growth EV Stock to Invest In? - Yahoo Finance", "summary": "Is Lucid Group (LCID) the High Growth EV Stock to Invest In? Yahoo Finance", "provider": "Mon, 12 May 2025 07:00:00 GMT"}, "25": {"title": "Lucid Air Shatters EV Range Record: 749-Mile Alpine Journey Crushes Previous Mark by 160km - Stock Titan", "summary": "Lucid Air Shatters EV Range Record: 749-Mile Alpine Journey Crushes Previous Mark by 160km Stock Titan", "provider": "Tue, 08 Jul 2025 12:00:00 GMT"}, "26": {"title": "Lucid Air Sets Electric Range Record - The EV Report", "summary": "Lucid Air Sets Electric Range Record The EV Report", "provider": "Wed, 09 Jul 2025 10:00:00 GMT"}, "27": {"title": "Lucid Group: Navigating EV Challenges - StocksToTrade", "summary": "Lucid Group: Navigating EV Challenges StocksToTrade", "provider": "Thu, 03 Jul 2025 20:04:00 GMT"}, "28": {"title": "Is Lucid Group a Millionaire-Maker Stock? - Yahoo Finance", "summary": "Is Lucid Group a Millionaire-Maker Stock? Yahoo Finance", "provider": "Tue, 10 Jun 2025 07:00:00 GMT"}, "29": {"title": "Lucid Announces Fourth Quarter and Full Year 2024 Financial Results - Lucid Motors", "summary": "Lucid Announces Fourth Quarter and Full Year 2024 Financial Results Lucid Motors", "provider": "Tue, 25 Feb 2025 08:00:00 GMT"}, "30": {"title": "Lucid EV Production Hits 3,863 Units in Q2 2025: Key Production Metrics and Earnings Date Revealed - Stock Titan", "summary": "Lucid EV Production Hits 3,863 Units in Q2 2025: Key Production Metrics and Earnings Date Revealed Stock Titan", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "31": {"title": "Is Lucid Group, Inc. (LCID) the Best Low Priced Stock to Invest in For the Long Term? - Yahoo Finance", "summary": "Is Lucid Group, Inc. (LCID) the Best Low Priced Stock to Invest in For the Long Term? Yahoo Finance", "provider": "Fri, 09 May 2025 07:00:00 GMT"}, "32": {"title": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS Title for Longest Distance on a Single Charge | THE SHOP - theshopmag.com", "summary": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS Title for Longest Distance on a Single Charge | THE SHOP theshopmag.com", "provider": "Tue, 08 Jul 2025 19:14:34 GMT"}, "33": {"title": "All You Need to Know About Lucid Group (LCID) Rating Upgrade to Buy - Yahoo Finance", "summary": "All You Need to Know About Lucid Group (LCID) Rating Upgrade to Buy Yahoo Finance", "provider": "Tue, 17 Jun 2025 07:00:00 GMT"}, "34": {"title": "Lucid May Need To Cut 2025 Guidance (NASDAQ:LCID) - Seeking Alpha", "summary": "Lucid May Need To Cut 2025 Guidance (NASDAQ:LCID) Seeking Alpha", "provider": "Tue, 08 Jul 2025 01:17:00 GMT"}, "35": {"title": "Benchmark Reiterates Buy Rating on Lucid Group Inc. (LCID) - StreetInsider", "summary": "Benchmark Reiterates Buy Rating on Lucid Group Inc. (LCID) StreetInsider", "provider": "Thu, 10 Jul 2025 13:28:42 GMT"}, "36": {"title": "Lucid Group sees a strong jump in second quarter deliveries (LCID:NASDAQ) - Seeking Alpha", "summary": "Lucid Group sees a strong jump in second quarter deliveries (LCID:NASDAQ) Seeking Alpha", "provider": "Thu, 03 Jul 2025 12:31:00 GMT"}, "37": {"title": "Lucid Opens New Jersey Studio, Service, and Delivery Center for Area Customers - Lucid Motors", "summary": "Lucid Opens New Jersey Studio, Service, and Delivery Center for Area Customers Lucid Motors", "provider": "Thu, 08 May 2025 07:00:00 GMT"}, "38": {"title": "Lucid Group (LCID) Stock: Can New SUV Turn Around Struggling EV Maker? - CoinCentral", "summary": "Lucid Group (LCID) Stock: Can New SUV Turn Around Struggling EV Maker? CoinCentral", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "39": {"title": "Lucid Announces Election of Douglas Grimm to Board of Directors - Lucid Motors", "summary": "Lucid Announces Election of Douglas Grimm to Board of Directors Lucid Motors", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "40": {"title": "Lucid Stock Soars: What’s Behind the Rise? - StocksToTrade", "summary": "Lucid Stock Soars: What’s Behind the Rise? StocksToTrade", "provider": "Tue, 01 Jul 2025 07:00:00 GMT"}, "41": {"title": "With Growth Poised to Explode, Is Lucid Stock Finally a Buy? - The Motley Fool", "summary": "With Growth Poised to Explode, Is Lucid Stock Finally a Buy? The Motley Fool", "provider": "Sun, 22 Jun 2025 07:00:00 GMT"}, "42": {"title": "Why Lucid Group Stock Is Soaring Today - The Globe and Mail", "summary": "Why Lucid Group Stock Is Soaring Today The Globe and Mail", "provider": "Tue, 08 Jul 2025 18:19:45 GMT"}, "43": {"title": "Lucid Group (NASDAQ:LCID) Shares Down 1.9% - What's Next? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Shares Down 1.9% - What's Next? MarketBeat", "provider": "Fri, 11 Jul 2025 17:26:29 GMT"}, "44": {"title": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees - Lucid Motors", "summary": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees Lucid Motors", "provider": "Fri, 11 Apr 2025 07:00:00 GMT"}, "45": {"title": "Cantor Fitzgerald Sticks to Their Hold Rating for Lucid Group (LCID) - The Globe and Mail", "summary": "Cantor Fitzgerald Sticks to Their Hold Rating for Lucid Group (LCID) The Globe and Mail", "provider": "Tue, 08 Jul 2025 14:54:00 GMT"}, "46": {"title": "Lucid Group (NASDAQ:LCID) Trading Up 2.1% - Here's Why - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Trading Up 2.1% - Here's Why MarketBeat", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "47": {"title": "Lucid Group Vehicle Deliveries Rise - The Wall Street Journal", "summary": "Lucid Group Vehicle Deliveries Rise The Wall Street Journal", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "48": {"title": "Lucid Group: Poised For Growth (Rating Upgrade) - Seeking Alpha", "summary": "Lucid Group: Poised For Growth (Rating Upgrade) Seeking Alpha", "provider": "Wed, 28 May 2025 07:00:00 GMT"}, "49": {"title": "Where Will Lucid Group Be in 3 Years? - The Motley Fool", "summary": "Where Will Lucid Group Be in 3 Years? The Motley Fool", "provider": "Sat, 17 May 2025 07:00:00 GMT"}, "50": {"title": "2 Reasons Lucid Group Stock Is a Buy Before August - The Motley Fool", "summary": "2 Reasons Lucid Group Stock Is a Buy Before August The Motley Fool", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "51": {"title": "Android Auto™ Compatibility Now Available to Lucid Air Owners - PR Newswire", "summary": "Android Auto™ Compatibility Now Available to Lucid Air Owners PR Newswire", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "52": {"title": "Lucid Group (NASDAQ:LCID) Shares Up 5.1% - Should You Buy? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Shares Up 5.1% - Should You Buy? MarketBeat", "provider": "Mon, 07 Jul 2025 07:00:00 GMT"}, "53": {"title": "Where Will Lucid Group Stock Be in 5 Years? - Yahoo Finance", "summary": "Where Will Lucid Group Stock Be in 5 Years? Yahoo Finance", "provider": "Tue, 01 Jul 2025 07:00:00 GMT"}, "54": {"title": "Lucid (NASDAQ: LCID) Stock Price Prediction and Forecast 2025-2030 (July 2025) - 24/7 Wall St.", "summary": "Lucid (NASDAQ: LCID) Stock Price Prediction and Forecast 2025-2030 (July 2025) 24/7 Wall St.", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "55": {"title": "Zacks Industry Outlook Highlights Rivian Automotive and Lucid - Yahoo Finance", "summary": "Zacks Industry Outlook Highlights Rivian Automotive and Lucid Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "56": {"title": "Why Lucid Group Inc. (LCID) Went Down Today - Yahoo Finance", "summary": "Why Lucid Group Inc. (LCID) Went Down Today Yahoo Finance", "provider": "Tue, 20 May 2025 07:00:00 GMT"}, "57": {"title": "Should You Buy Lucid Stock While It's Below $3? - Yahoo Finance", "summary": "Should You Buy Lucid Stock While It's Below $3? Yahoo Finance", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "58": {"title": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees - Lucid Motors", "summary": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees Lucid Motors", "provider": "Fri, 11 Apr 2025 07:00:00 GMT"}, "59": {"title": "Every Lucid Group Investor Should Keep an Eye on These 2 Numbers - Yahoo Finance", "summary": "Every Lucid Group Investor Should Keep an Eye on These 2 Numbers Yahoo Finance", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}}}