{"Microsoft": {"0": {"title": "Microsoft announced 9,000 layoffs. What does that mean for WA state? - The Olympian", "summary": "Microsoft announced 9,000 layoffs. What does that mean for WA state? The Olympian", "provider": "Sun, 13 Jul 2025 12:00:00 GMT"}, "1": {"title": "Microsoft and OpenAI's AGI Fight Is Bigger Than a Contract - WIRED", "summary": "Microsoft and OpenAI's AGI Fight Is Bigger Than a Contract WIRED", "provider": "Fri, 11 Jul 2025 12:11:00 GMT"}, "2": {"title": "OpenAI Can’t Windsurf Anymore as Microsoft Helps Google Steal the CEO - Analytics India Magazine", "summary": "OpenAI Can’t Windsurf Anymore as Microsoft Helps Google Steal the CEO Analytics India Magazine", "provider": "Sat, 12 Jul 2025 06:36:02 GMT"}, "3": {"title": "Why and how Microsoft may have 'killed' OpenAI's $3 billion acquisition of WindSurf - The Times of India", "summary": "Why and how Microsoft may have 'killed' OpenAI's $3 billion acquisition of WindSurf The Times of India", "provider": "Sun, 13 Jul 2025 19:00:00 GMT"}, "4": {"title": "I'm a software engineer at Microsoft who was diagnosed with autism and ADHD at 30. It's changed how I see myself and show up at work. - Business Insider", "summary": "I'm a software engineer at Microsoft who was diagnosed with autism and ADHD at 30. It's changed how I see myself and show up at work. Business Insider", "provider": "Sun, 13 Jul 2025 09:21:00 GMT"}, "5": {"title": "Microsoft president talks $4B AI investment amid sweeping layoffs: ‘We have to prioritize’ - KING5.com", "summary": "Microsoft president talks $4B AI investment amid sweeping layoffs: ‘We have to prioritize’ KING5.com", "provider": "Fri, 11 Jul 2025 01:07:00 GMT"}, "6": {"title": "Why Every AI Agent Will Likely Run On Microsoft (NASDAQ:MSFT) - Seeking Alpha", "summary": "Why Every AI Agent Will Likely Run On Microsoft (NASDAQ:MSFT) Seeking Alpha", "provider": "Sun, 13 Jul 2025 10:51:00 GMT"}, "7": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - Yahoo Finance", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In Yahoo Finance", "provider": "Sat, 12 Jul 2025 10:20:39 GMT"}, "8": {"title": "Microsoft Outlook hit with hourslong outage - CNBC", "summary": "Microsoft Outlook hit with hourslong outage CNBC", "provider": "Thu, 10 Jul 2025 17:14:28 GMT"}, "9": {"title": "5 big analyst AI moves: Microsoft upgraded; Micron, MongoDB started at Buy - Investing.com", "summary": "5 big analyst AI moves: Microsoft upgraded; Micron, MongoDB started at Buy Investing.com", "provider": "Sun, 13 Jul 2025 09:00:36 GMT"}, "10": {"title": "Veteran analyst issues eye-popping Microsoft stock price target - TheStreet", "summary": "Veteran analyst issues eye-popping Microsoft stock price target TheStreet", "provider": "Fri, 11 Jul 2025 22:03:00 GMT"}, "11": {"title": "Microsoft Plans to Purge Passwords — Here's How to Protect Yours - CNET", "summary": "Microsoft Plans to Purge Passwords — Here's How to Protect Yours CNET", "provider": "Sun, 13 Jul 2025 10:00:00 GMT"}, "12": {"title": "Microsoft Elevate: Putting people first - The Official Microsoft Blog", "summary": "Microsoft Elevate: Putting people first The Official Microsoft Blog", "provider": "Wed, 09 Jul 2025 16:32:30 GMT"}, "13": {"title": "Microsoft Edge sets a new standard for speed and responsiveness - Windows Blog", "summary": "Microsoft Edge sets a new standard for speed and responsiveness Windows Blog", "provider": "Mon, 07 Jul 2025 17:21:33 GMT"}, "14": {"title": "Is Microsoft Outlook down? Thousands of users report issues with email - PBS", "summary": "Is Microsoft Outlook down? Thousands of users report issues with email PBS", "provider": "Thu, 10 Jul 2025 14:33:53 GMT"}, "15": {"title": "Microsoft Pledges $4 Billion Toward A.I. Education - The New York Times", "summary": "Microsoft Pledges $4 Billion Toward A.I. Education The New York Times", "provider": "Wed, 09 Jul 2025 16:29:06 GMT"}, "16": {"title": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports - Reuters", "summary": "Microsoft racks up over $500 million in AI savings while slashing jobs, Bloomberg News reports Reuters", "provider": "Wed, 09 Jul 2025 18:58:27 GMT"}, "17": {"title": "Microsoft announces $4 billion AI training initiative amid recent layoffs - KOMO", "summary": "Microsoft announces $4 billion AI training initiative amid recent layoffs KOMO", "provider": "Fri, 11 Jul 2025 01:39:49 GMT"}, "18": {"title": "Microsoft’s 19-hour Outlook outage exposes fragility in cloud infrastructure - Computerworld", "summary": "Microsoft’s 19-hour Outlook outage exposes fragility in cloud infrastructure Computerworld", "provider": "Fri, 11 Jul 2025 10:18:21 GMT"}, "19": {"title": "It Took Microsoft Three Months To Remove A Game That Was An Edited Emulation Of A PlayStation Title - TheGamer", "summary": "It Took Microsoft Three Months To Remove A Game That Was An Edited Emulation Of A PlayStation Title TheGamer", "provider": "Sat, 12 Jul 2025 03:26:00 GMT"}, "20": {"title": "As AI reshapes its workforce, Microsoft commits $4 billion to help others adapt - GeekWire", "summary": "As AI reshapes its workforce, Microsoft commits $4 billion to help others adapt GeekWire", "provider": "Wed, 09 Jul 2025 16:39:14 GMT"}, "21": {"title": "Microsoft Patch Tuesday, July 2025 Edition - Krebs on Security", "summary": "Microsoft Patch Tuesday, July 2025 Edition Krebs on Security", "provider": "Wed, 09 Jul 2025 02:59:09 GMT"}, "22": {"title": "Is Microsoft Outlook down? What to know about outage as users report issues - USA Today", "summary": "Is Microsoft Outlook down? What to know about outage as users report issues USA Today", "provider": "Thu, 10 Jul 2025 11:39:47 GMT"}, "23": {"title": "A week after layoffs linked to AI cost, Microsoft pledges $4B to AI education - The Seattle Times", "summary": "A week after layoffs linked to AI cost, Microsoft pledges $4B to AI education The Seattle Times", "provider": "Thu, 10 Jul 2025 13:00:00 GMT"}, "24": {"title": "The Microsoft Surface Pro 2024 is one of my favorite tablets ever, no thanks to AI - CNN", "summary": "The Microsoft Surface Pro 2024 is one of my favorite tablets ever, no thanks to AI CNN", "provider": "Tue, 08 Jul 2025 11:58:00 GMT"}, "25": {"title": "Reasoning reimagined: Introducing Phi-4-mini-flash-reasoning - Microsoft Azure", "summary": "Reasoning reimagined: Introducing Phi-4-mini-flash-reasoning Microsoft Azure", "provider": "Wed, 09 Jul 2025 16:00:00 GMT"}, "26": {"title": "Microsoft Outlook working normal following widespread outage - USA Today", "summary": "Microsoft Outlook working normal following widespread outage USA Today", "provider": "Thu, 10 Jul 2025 07:00:00 GMT"}, "27": {"title": "​​Forrester names Microsoft a Leader in the 2025 Zero Trust Platforms Wave™ report - Microsoft", "summary": "​​Forrester names Microsoft a Leader in the 2025 Zero Trust Platforms Wave™ report Microsoft", "provider": "Thu, 10 Jul 2025 16:00:00 GMT"}, "28": {"title": "Outlook down? Microsoft email platform back online after suffering a major outage - here's what happened - TechRadar", "summary": "Outlook down? Microsoft email platform back online after suffering a major outage - here's what happened TechRadar", "provider": "Sat, 12 Jul 2025 10:00:12 GMT"}, "29": {"title": "Microsoft expands Zero Trust workshop to cover network, SecOps, and more - Microsoft", "summary": "Microsoft expands Zero Trust workshop to cover network, SecOps, and more Microsoft", "provider": "Wed, 09 Jul 2025 16:00:00 GMT"}, "30": {"title": "What’s new in Copilot Studio: June 2025 - Microsoft", "summary": "What’s new in Copilot Studio: June 2025 Microsoft", "provider": "Thu, 10 Jul 2025 16:00:00 GMT"}, "31": {"title": "Microsoft’s stock gets an upgrade. Why these analysts say it’s underappreciated in AI. - MarketWatch", "summary": "Microsoft’s stock gets an upgrade. Why these analysts say it’s underappreciated in AI. MarketWatch", "provider": "Wed, 09 Jul 2025 13:48:00 GMT"}, "32": {"title": "Introducing Deep Research in Azure AI Foundry Agent Service - Microsoft Azure", "summary": "Introducing Deep Research in Azure AI Foundry Agent Service Microsoft Azure", "provider": "Mon, 07 Jul 2025 17:00:00 GMT"}, "33": {"title": "Microsoft cuts 15,000 jobs, tells remaining employees to invest in ... - The Times of India", "summary": "Microsoft cuts 15,000 jobs, tells remaining employees to invest in ... The Times of India", "provider": "Sun, 13 Jul 2025 14:17:00 GMT"}, "34": {"title": "WPP taps Microsoft exec Rose to rebuild ad group - Reuters", "summary": "WPP taps Microsoft exec Rose to rebuild ad group Reuters", "provider": "Thu, 10 Jul 2025 07:33:57 GMT"}, "35": {"title": "Microsoft Outlook Down — Email Outage Confirmed, What We Know So Far - Forbes", "summary": "Microsoft Outlook Down — Email Outage Confirmed, What We Know So Far Forbes", "provider": "Thu, 10 Jul 2025 10:49:39 GMT"}, "36": {"title": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers - The New York Times", "summary": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers The New York Times", "provider": "Wed, 09 Jul 2025 07:00:00 GMT"}, "37": {"title": "Is Outlook down? Microsoft reporting issues with email service. What to know - Cincinnati Enquirer", "summary": "Is Outlook down? Microsoft reporting issues with email service. What to know Cincinnati Enquirer", "provider": "Thu, 10 Jul 2025 12:14:59 GMT"}, "38": {"title": "Is Microsoft Stock A Buy In July? What The Fundamentals, Chart Say As MSFT Aims At 7th Straight Weekly Gain - Investor's Business Daily", "summary": "Is Microsoft Stock A Buy In July? What The Fundamentals, Chart Say As MSFT Aims At 7th Straight Weekly Gain Investor's Business Daily", "provider": "Thu, 10 Jul 2025 18:14:00 GMT"}, "39": {"title": "WPP Names Microsoft Executive as Next CEO - The Wall Street Journal", "summary": "WPP Names Microsoft Executive as Next CEO The Wall Street Journal", "provider": "Thu, 10 Jul 2025 07:18:00 GMT"}, "40": {"title": "Microsoft develops Copilot 3D experiment targeting 3D creators - TestingCatalog", "summary": "Microsoft develops Copilot 3D experiment targeting 3D creators TestingCatalog", "provider": "Sun, 13 Jul 2025 16:18:45 GMT"}, "41": {"title": "Microsoft shares $500M in AI savings internally days after cutting 9,000 jobs - TechCrunch", "summary": "Microsoft shares $500M in AI savings internally days after cutting 9,000 jobs TechCrunch", "provider": "Wed, 09 Jul 2025 23:06:01 GMT"}, "42": {"title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server - The Hacker News", "summary": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server The Hacker News", "provider": "Wed, 09 Jul 2025 07:10:00 GMT"}, "43": {"title": "‘Who’s training who?’: Tech companies, teachers union partner on national AI academy - Chalkbeat", "summary": "‘Who’s training who?’: Tech companies, teachers union partner on national AI academy Chalkbeat", "provider": "Tue, 08 Jul 2025 23:24:00 GMT"}, "44": {"title": "Microsoft Touts $500 Million in AI Savings While Slashing Jobs - Bloomberg", "summary": "Microsoft Touts $500 Million in AI Savings While Slashing Jobs Bloomberg", "provider": "Wed, 09 Jul 2025 18:47:27 GMT"}, "45": {"title": "Microsoft and Adobe Patch Tuesday, July 2025 Security Update Review - Qualys", "summary": "Microsoft and Adobe Patch Tuesday, July 2025 Security Update Review Qualys", "provider": "Tue, 08 Jul 2025 18:41:02 GMT"}, "46": {"title": "Microsoft, OpenAI Partner With AFT to Train Teachers on AI - Education Week", "summary": "Microsoft, OpenAI Partner With AFT to Train Teachers on AI Education Week", "provider": "Tue, 08 Jul 2025 22:25:56 GMT"}, "47": {"title": "What’s new in Power Apps: June 2025 Feature Update - Microsoft", "summary": "What’s new in Power Apps: June 2025 Feature Update Microsoft", "provider": "Tue, 08 Jul 2025 15:48:21 GMT"}, "48": {"title": "Stay secure with Windows 11, Copilot+ PCs and Windows 365 before support ends for Windows 10 - Windows Blog", "summary": "Stay secure with Windows 11, Copilot+ PCs and Windows 365 before support ends for Windows 10 Windows Blog", "provider": "Tue, 24 Jun 2025 07:00:00 GMT"}, "49": {"title": "Outlook Outage: Microsoft Says Your Email Should Be Working Again - CNET", "summary": "Outlook Outage: Microsoft Says Your Email Should Be Working Again CNET", "provider": "Thu, 10 Jul 2025 20:13:00 GMT"}, "50": {"title": "Outlook takes another sick day - theregister.com", "summary": "Outlook takes another sick day theregister.com", "provider": "Thu, 10 Jul 2025 10:02:00 GMT"}, "51": {"title": "Microsoft Makes AI Mandatory For Employees: What It Means For Your Career - Forbes", "summary": "Microsoft Makes AI Mandatory For Employees: What It Means For Your Career Forbes", "provider": "Tue, 08 Jul 2025 06:30:00 GMT"}, "52": {"title": "Microsoft Announces 15,000 Layoffs, Asks Remaining Employees to Invest in AI Skills - The CSR Journal", "summary": "Microsoft Announces 15,000 Layoffs, Asks Remaining Employees to Invest in AI Skills The CSR Journal", "provider": "Mon, 14 Jul 2025 02:41:17 GMT"}, "53": {"title": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company - CNN", "summary": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company CNN", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "54": {"title": "Is Outlook down right now? Is Hotmail email server down? When will outage be fixed? What we know - IndyStar", "summary": "Is Outlook down right now? Is Hotmail email server down? When will outage be fixed? What we know IndyStar", "provider": "Thu, 10 Jul 2025 12:31:55 GMT"}, "55": {"title": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken - BleepingComputer", "summary": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken BleepingComputer", "provider": "Wed, 09 Jul 2025 20:58:34 GMT"}, "56": {"title": "WPP Taps Microsoft’s Cindy Rose as CEO, Hoping for New Era - Variety", "summary": "WPP Taps Microsoft’s Cindy Rose as CEO, Hoping for New Era Variety", "provider": "Thu, 10 Jul 2025 10:42:00 GMT"}, "57": {"title": "Thousands report issues with Microsoft Outlook email in apparent outage - New York Post", "summary": "Thousands report issues with Microsoft Outlook email in apparent outage New York Post", "provider": "Thu, 10 Jul 2025 14:52:00 GMT"}, "58": {"title": "How to delete the Microsoft account that Windows made you set up - PCWorld", "summary": "How to delete the Microsoft account that Windows made you set up PCWorld", "provider": "Wed, 09 Jul 2025 14:30:00 GMT"}, "59": {"title": "Microsoft Outlook goes down around the world - here's what we know - ZDNET", "summary": "Microsoft Outlook goes down around the world - here's what we know ZDNET", "provider": "Thu, 10 Jul 2025 14:15:00 GMT"}}, "Nvidia": {"0": {"title": "US senators warn Nvidia CEO about upcoming China trip - Reuters", "summary": "US senators warn Nvidia CEO about upcoming China trip ReutersUS senators send ‘warning letter’ to Nvidia CEO JenSen Huang: ‘We are worried that…’ The Times of IndiaNvidia CEO downplays U.S. fears t", "provider": "Fri, 11 Jul 2025 21:08:48 GMT"}, "1": {"title": "Meet Nvidia’s big new customers: governments - The Economist", "summary": "Meet Nvidia’s big new customers: governments The Economist", "provider": "Sun, 13 Jul 2025 17:58:38 GMT"}, "2": {"title": "Nvidia (NVDA) Just Got a Buy Rating From Goldman—Here’s Why Analysts Are Bullish - Yahoo Finance", "summary": "Nvidia (NVDA) Just Got a Buy Rating From Goldman—Here’s Why Analysts Are Bullish Yahoo Finance", "provider": "Sun, 13 Jul 2025 15:44:02 GMT"}, "3": {"title": "Nvidia Just Became the World's First $4 Trillion Stock. This Artificial Intelligence (AI) Giant -- Which Is up 686,000% Since Its IPO -- Might Be Next. - Yahoo", "summary": "Nvidia Just Became the World's First $4 Trillion Stock. This Artificial Intelligence (AI) Giant -- Which Is up 686,000% Since Its IPO -- Might Be Next. Yahoo", "provider": "Mon, 14 Jul 2025 01:30:00 GMT"}, "4": {"title": "Should You Invest $10,000 in Nvidia Stock Right Now? - The Motley Fool", "summary": "Should You Invest $10,000 in Nvidia Stock Right Now? The Motley Fool", "provider": "Sun, 13 Jul 2025 09:30:00 GMT"}, "5": {"title": "World's first $4 trillion company unruffled by Trump tariff threat - USA Today", "summary": "World's first $4 trillion company unruffled by Trump tariff threat USA Today", "provider": "Fri, 11 Jul 2025 23:11:51 GMT"}, "6": {"title": "GPUHammer: New RowHammer Attack Variant Degrades AI Models on NVIDIA GPUs - The Hacker News", "summary": "GPUHammer: New RowHammer Attack Variant Degrades AI Models on NVIDIA GPUs The Hacker News", "provider": "Sat, 12 Jul 2025 17:14:00 GMT"}, "7": {"title": "Nvidia's new driver update finally brings Smooth Motion to RTX 40-series GPUs, works like AMD's Fluid Motion Frames and claims to double your FPS with a single click in any game - Tom's Hardware", "summary": "Nvidia's new driver update finally brings Smooth Motion to RTX 40-series GPUs, works like AMD's Fluid Motion Frames and claims to double your FPS with a single click in any game Tom's Hardware", "provider": "Sun, 13 Jul 2025 14:12:12 GMT"}, "8": {"title": "Nvidia warns its GPUs – even Blackwells – need protection against Rowhammer attacks - theregister.com", "summary": "Nvidia warns its GPUs – even Blackwells – need protection against Rowhammer attacks theregister.com", "provider": "Sun, 13 Jul 2025 23:46:00 GMT"}, "9": {"title": "Nvidia defines power electronics future - Yole Group", "summary": "Nvidia defines power electronics future Yole Group", "provider": "Fri, 11 Jul 2025 10:20:39 GMT"}, "10": {"title": "NVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks - BleepingComputer", "summary": "NVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks BleepingComputer", "provider": "Fri, 11 Jul 2025 15:39:05 GMT"}, "11": {"title": "NVIDIA 590.26 preview drivers introduce Smooth Motion frame generation for GeForce RTX 40 Series - VideoCardz.com", "summary": "NVIDIA 590.26 preview drivers introduce Smooth Motion frame generation for GeForce RTX 40 Series VideoCardz.com", "provider": "Sun, 13 Jul 2025 09:14:00 GMT"}, "12": {"title": "On GPS: Nvidia CEO on the US-China AI race - CNN", "summary": "On GPS: Nvidia CEO on the US-China AI race CNN", "provider": "Sun, 13 Jul 2025 15:02:53 GMT"}, "13": {"title": "Jim Cramer drops blunt 6-word message on Nvidia stock - TheStreet", "summary": "Jim Cramer drops blunt 6-word message on Nvidia stock TheStreet", "provider": "Mon, 14 Jul 2025 02:28:19 GMT"}, "14": {"title": "Nvidia CEO to hold media briefing in Beijing on July 16 - Reuters", "summary": "Nvidia CEO to hold media briefing in Beijing on July 16 Reuters", "provider": "Sun, 13 Jul 2025 11:11:49 GMT"}, "15": {"title": "Warm? RTX 5070 FE MSRP @ Nvidia - [H]ard|Forum", "summary": "Warm? RTX 5070 FE MSRP @ Nvidia [H]ard|Forum", "provider": "Mon, 14 Jul 2025 02:57:53 GMT"}, "16": {"title": "Nvidia’s Huang Says China’s Military Unlikely to Use US AI Chips - Bloomberg", "summary": "Nvidia’s Huang Says China’s Military Unlikely to Use US AI Chips Bloomberg", "provider": "Sun, 13 Jul 2025 15:21:13 GMT"}, "17": {"title": "Nvidia or AMD: Goldman Sachs Picks the Superior AI Stock to Buy - TipRanks", "summary": "Nvidia or AMD: Goldman Sachs Picks the Superior AI Stock to Buy TipRanks", "provider": "Sun, 13 Jul 2025 20:46:10 GMT"}, "18": {"title": "Look Up… It’s A One-Of-A-Kind Superman GeForce RTX 5090! And You Could Win It! - NVIDIA", "summary": "Look Up… It’s A One-Of-A-Kind Superman GeForce RTX 5090! And You Could Win It! NVIDIA", "provider": "Wed, 09 Jul 2025 15:41:06 GMT"}, "19": {"title": "Nvidia briefly touched $4 trillion market cap for first time - CNBC", "summary": "Nvidia briefly touched $4 trillion market cap for first time CNBC", "provider": "Wed, 09 Jul 2025 13:42:41 GMT"}, "20": {"title": "Nvidia: A complete guide to the hardware company behind the AI boom - Business Insider", "summary": "Nvidia: A complete guide to the hardware company behind the AI boom Business Insider", "provider": "Wed, 09 Jul 2025 17:10:00 GMT"}, "21": {"title": "Nvidia Becomes First Public Company Worth $4 Trillion - The New York Times", "summary": "Nvidia Becomes First Public Company Worth $4 Trillion The New York Times", "provider": "Thu, 10 Jul 2025 20:18:09 GMT"}, "22": {"title": "Nvidia’s CEO says the US should ‘reduce’ dependency on other countries, onshore technology manufacturing - CNN", "summary": "Nvidia’s CEO says the US should ‘reduce’ dependency on other countries, onshore technology manufacturing CNN", "provider": "Sun, 13 Jul 2025 14:01:00 GMT"}, "23": {"title": "Indonesia on Track to Achieve Sovereign AI Goals With NVIDIA, Cisco and IOH - NVIDIA Blog", "summary": "Indonesia on Track to Achieve Sovereign AI Goals With NVIDIA, Cisco and IOH NVIDIA Blog", "provider": "Fri, 11 Jul 2025 04:02:38 GMT"}, "24": {"title": "On GPS: Nvidia CEO on whether AI will lead to job losses - CNN", "summary": "On GPS: Nvidia CEO on whether AI will lead to job losses CNN", "provider": "Sun, 13 Jul 2025 15:03:36 GMT"}, "25": {"title": "DLSS 4 With Multi Frame Generation Coming To RuneScape: Dragonwilds, Mortal Online 2 & Brickadia | GeForce News - NVIDIA", "summary": "DLSS 4 With Multi Frame Generation Coming To RuneScape: Dragonwilds, Mortal Online 2 & Brickadia | GeForce News NVIDIA", "provider": "Tue, 08 Jul 2025 13:01:01 GMT"}, "26": {"title": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company - CNN", "summary": "Nvidia beats Apple and Microsoft to become the world’s first $4 trillion public company CNN", "provider": "Wed, 09 Jul 2025 20:07:00 GMT"}, "27": {"title": "Nvidia’s Jensen Huang says AI could lead to job losses ‘if the world runs out of ideas’ - CNN", "summary": "Nvidia’s Jensen Huang says AI could lead to job losses ‘if the world runs out of ideas’ CNN", "provider": "Fri, 11 Jul 2025 21:06:00 GMT"}, "28": {"title": "Nvidia becomes first company to close above $4 trillion mark - Yahoo Finance", "summary": "Nvidia becomes first company to close above $4 trillion mark Yahoo Finance", "provider": "Fri, 11 Jul 2025 08:25:47 GMT"}, "29": {"title": "Nvidia's market value tops $4 trillion - Reuters", "summary": "Nvidia's market value tops $4 trillion Reuters", "provider": "Fri, 11 Jul 2025 00:42:00 GMT"}, "30": {"title": "Jensen Huang's Nvidia Owns 6 Stocks. Here's the Best of the Bunch. - The Motley Fool", "summary": "Jensen Huang's Nvidia Owns 6 Stocks. Here's the Best of the Bunch. The Motley Fool", "provider": "Sat, 12 Jul 2025 08:30:00 GMT"}, "31": {"title": "NVIDIA Introduces “Smooth Motion” Frame Generation for RTX 40 Series GPUs in Latest Preview Driver, Proven to Double In-Game FPS - Wccftech", "summary": "NVIDIA Introduces “Smooth Motion” Frame Generation for RTX 40 Series GPUs in Latest Preview Driver, Proven to Double In-Game FPS Wccftech", "provider": "Sun, 13 Jul 2025 10:56:00 GMT"}, "32": {"title": "Nvidia Stock Is Way Cheaper Than You Think. Here's 1 Reason Why. - The Motley Fool", "summary": "Nvidia Stock Is Way Cheaper Than You Think. Here's 1 Reason Why. The Motley Fool", "provider": "Sat, 12 Jul 2025 11:15:00 GMT"}, "33": {"title": "Nvidia stock eyes more gains after chipmaker becomes first company to reach $4 trillion market value - Yahoo Finance", "summary": "Nvidia stock eyes more gains after chipmaker becomes first company to reach $4 trillion market value Yahoo Finance", "provider": "Thu, 10 Jul 2025 08:13:39 GMT"}, "34": {"title": "How some pros use options to trade Nvidia and other tech stocks while limiting risk - MarketWatch", "summary": "How some pros use options to trade Nvidia and other tech stocks while limiting risk MarketWatch", "provider": "Fri, 11 Jul 2025 13:14:00 GMT"}, "35": {"title": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services - Amazon.com", "summary": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services Amazon.com", "provider": "Wed, 09 Jul 2025 20:55:03 GMT"}, "36": {"title": "Nvidia becomes first company to hit $4 trillion valuation - NBC News", "summary": "Nvidia becomes first company to hit $4 trillion valuation NBC News", "provider": "Wed, 09 Jul 2025 20:18:00 GMT"}, "37": {"title": "Nvidia's Jensen Huang sells more than $36 million in stock, catching up with Warren Buffett in net worth - CNBC", "summary": "Nvidia's Jensen Huang sells more than $36 million in stock, catching up with Warren Buffett in net worth CNBC", "provider": "Fri, 11 Jul 2025 14:12:27 GMT"}, "38": {"title": "The CEO of Nvidia Admits What Everybody Is Afraid of About AI - Gizmodo", "summary": "The CEO of Nvidia Admits What Everybody Is Afraid of About AI Gizmodo", "provider": "Sun, 13 Jul 2025 22:34:00 GMT"}, "39": {"title": "Reach the ‘PEAK’ on GeForce NOW - NVIDIA Blog", "summary": "Reach the ‘PEAK’ on GeForce NOW NVIDIA Blog", "provider": "Thu, 10 Jul 2025 13:03:10 GMT"}, "40": {"title": "AI Titan Nvidia Becomes First $4 Trillion Company Ever - Forbes", "summary": "AI Titan Nvidia Becomes First $4 Trillion Company Ever Forbes", "provider": "Wed, 09 Jul 2025 14:07:43 GMT"}, "41": {"title": "How Nvidia's rise is minting so many millionaires among its relatively small workforce - Business Insider", "summary": "How Nvidia's rise is minting so many millionaires among its relatively small workforce Business Insider", "provider": "Fri, 11 Jul 2025 15:58:00 GMT"}, "42": {"title": "Nvidia's stock market value hits $4 trillion on AI dominance - Reuters", "summary": "Nvidia's stock market value hits $4 trillion on AI dominance Reuters", "provider": "Wed, 09 Jul 2025 21:38:42 GMT"}, "43": {"title": "How Nvidia Became the World’s First $4 Trillion Company - The Wall Street Journal", "summary": "How Nvidia Became the World’s First $4 Trillion Company The Wall Street Journal", "provider": "Wed, 09 Jul 2025 21:07:00 GMT"}, "44": {"title": "Nvidia officially gets its $4 trillion finish. Here’s what could come next. - MarketWatch", "summary": "Nvidia officially gets its $4 trillion finish. Here’s what could come next. MarketWatch", "provider": "Thu, 10 Jul 2025 21:14:00 GMT"}, "45": {"title": "AWS AI infrastructure with NVIDIA Blackwell: Two powerful compute solutions for the next frontier of AI - Amazon.com", "summary": "AWS AI infrastructure with NVIDIA Blackwell: Two powerful compute solutions for the next frontier of AI Amazon.com", "provider": "Wed, 09 Jul 2025 21:01:52 GMT"}, "46": {"title": "Nvidia Stock: Analyst Eyes $6 Trillion Market Cap – Is The AI Titan A Buy Now? - Investor's Business Daily", "summary": "Nvidia Stock: Analyst Eyes $6 Trillion Market Cap – Is The AI Titan A Buy Now? Investor's Business Daily", "provider": "Fri, 11 Jul 2025 14:16:00 GMT"}, "47": {"title": "Nvidia Is the First $4 Trillion Company. Here's Why It Could Still Soar Higher. - The Motley Fool", "summary": "Nvidia Is the First $4 Trillion Company. Here's Why It Could Still Soar Higher. The Motley Fool", "provider": "Fri, 11 Jul 2025 11:00:00 GMT"}, "48": {"title": "Prediction: These 2 AI Chip Stocks Will Outperform Nvidia Over the Next 5 Years - The Motley Fool", "summary": "Prediction: These 2 AI Chip Stocks Will Outperform Nvidia Over the Next 5 Years The Motley Fool", "provider": "Sun, 13 Jul 2025 13:15:00 GMT"}, "49": {"title": "Nvidia CEO Huang to meet Trump before China trip, source says - Reuters", "summary": "Nvidia CEO Huang to meet Trump before China trip, source says Reuters", "provider": "Thu, 10 Jul 2025 21:29:29 GMT"}, "50": {"title": "Nvidia’s Meteoric Rise Has Made Jensen Huang Almost as Rich as Warren Buffett - Investopedia", "summary": "Nvidia’s Meteoric Rise Has Made Jensen Huang Almost as Rich as Warren Buffett Investopedia", "provider": "Thu, 10 Jul 2025 21:11:53 GMT"}, "51": {"title": "Nvidia's $4 trillion milestone caps rise of stock market behemoth - Reuters", "summary": "Nvidia's $4 trillion milestone caps rise of stock market behemoth Reuters", "provider": "Wed, 09 Jul 2025 21:33:33 GMT"}, "52": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - Yahoo Finance", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In Yahoo Finance", "provider": "Sat, 12 Jul 2025 10:20:39 GMT"}, "53": {"title": "These 2 Magnificent 7 Stocks are Top Picks for the Second Half of 2025 According to Wall Street Pro - 24/7 Wall St.", "summary": "These 2 Magnificent 7 Stocks are Top Picks for the Second Half of 2025 According to Wall Street Pro 24/7 Wall St.", "provider": "Sun, 13 Jul 2025 12:11:33 GMT"}, "54": {"title": "Stock market today: S&P 500, Nasdaq eke out fresh records, Nvidia closes at $4T market cap - Yahoo Finance", "summary": "Stock market today: S&P 500, Nasdaq eke out fresh records, Nvidia closes at $4T market cap Yahoo Finance", "provider": "Thu, 10 Jul 2025 21:44:40 GMT"}, "55": {"title": "Trump hosts Jensen Huang at White House as Nvidia tops $4 trillion market cap - CNBC", "summary": "Trump hosts Jensen Huang at White House as Nvidia tops $4 trillion market cap CNBC", "provider": "Thu, 10 Jul 2025 20:22:57 GMT"}, "56": {"title": "Nvidia CEO Jensen Huang could soon be richer than Warren Buffett—he's worth $142 billion now - CNBC", "summary": "Nvidia CEO Jensen Huang could soon be richer than Warren Buffett—he's worth $142 billion now CNBC", "provider": "Thu, 10 Jul 2025 19:00:53 GMT"}, "57": {"title": "Nvidia becomes first company to reach $4tn in market value - The Guardian", "summary": "Nvidia becomes first company to reach $4tn in market value The Guardian", "provider": "Thu, 10 Jul 2025 09:12:00 GMT"}, "58": {"title": "Nvidia Stock May Double in the Next 3 Years. Here's Why. - The Motley Fool", "summary": "Nvidia Stock May Double in the Next 3 Years. Here's Why. The Motley Fool", "provider": "Fri, 11 Jul 2025 08:45:00 GMT"}, "59": {"title": "Nvidia Just Became the First Company to Hit a $4 Trillion Market Cap - Barron's", "summary": "Nvidia Just Became the First Company to Hit a $4 Trillion Market Cap Barron's", "provider": "Wed, 09 Jul 2025 20:15:00 GMT"}}, "Apple": {"0": {"title": "Apple Plans New MacBook Pro, iPhone 17e and iPads by Early 2026 - Bloomberg", "summary": "Apple Plans New MacBook Pro, iPhone 17e and iPads by Early 2026 Bloomberg", "provider": "Thu, 10 Jul 2025 19:05:09 GMT"}, "1": {"title": "These are the pros and cons of buying from Apple’s refurbished store: Is it worth it? - 9to5Mac", "summary": "These are the pros and cons of buying from Apple’s refurbished store: Is it worth it? 9to5Mac", "provider": "Sun, 13 Jul 2025 19:17:00 GMT"}, "2": {"title": "Apple CEO Tim Cook has created more shareholder value than Steve Jobs. But suddenly his weaknesses are on display in the AI era - Fortune", "summary": "Apple CEO Tim Cook has created more shareholder value than Steve Jobs. But suddenly his weaknesses are on display in the AI era Fortune", "provider": "Sat, 12 Jul 2025 09:00:00 GMT"}, "3": {"title": "Tim Cook Isn’t Going Anywhere Soon, But an Apple Shake-Up Looms - Bloomberg", "summary": "Tim Cook Isn’t Going Anywhere Soon, But an Apple Shake-Up Looms Bloomberg", "provider": "Sun, 13 Jul 2025 12:00:00 GMT"}, "4": {"title": "Apple needs a new CEO to survive the high-stakes AI race, analysts warn - The Indian Express", "summary": "Apple needs a new CEO to survive the high-stakes AI race, analysts warn The Indian Express", "provider": "Mon, 14 Jul 2025 04:10:00 GMT"}, "5": {"title": "Government breaks silence on Chinese engineers leaving iPhone maker Foxconn’s plant: ‘Apple has alternati - The Times of India", "summary": "Government breaks silence on Chinese engineers leaving iPhone maker Foxconn’s plant: ‘Apple has alternati The Times of India", "provider": "Sun, 13 Jul 2025 12:06:00 GMT"}, "6": {"title": "F1 leaning toward Apple for U.S. TV rights as bid tops ESPN offer: Sources - The New York Times", "summary": "F1 leaning toward Apple for U.S. TV rights as bid tops ESPN offer: Sources The New York Times", "provider": "Fri, 11 Jul 2025 23:19:39 GMT"}, "7": {"title": "Apple is poised to win the rights to stream F1 races in the US. ESPN is bowing out. - Business Insider", "summary": "Apple is poised to win the rights to stream F1 races in the US. ESPN is bowing out. Business Insider", "provider": "Fri, 11 Jul 2025 20:00:00 GMT"}, "8": {"title": "Apple reportedly outbids ESPN for F1 U.S. broadcast rights as coverage could move to streaming platform in 2026 - Yahoo Sports", "summary": "Apple reportedly outbids ESPN for F1 U.S. broadcast rights as coverage could move to streaming platform in 2026 Yahoo Sports", "provider": "Sat, 12 Jul 2025 03:03:00 GMT"}, "9": {"title": "Apple’s China Risks Are Real, But the Market Is Missing the Bigger Picture - Yahoo Finance", "summary": "Apple’s China Risks Are Real, But the Market Is Missing the Bigger Picture Yahoo Finance", "provider": "Sat, 12 Jul 2025 12:00:02 GMT"}, "10": {"title": "Apple iPhone 17 Release Date: New Clue Revealed In Latest Leak - Forbes", "summary": "Apple iPhone 17 Release Date: New Clue Revealed In Latest Leak Forbes", "provider": "Sun, 13 Jul 2025 20:45:09 GMT"}, "11": {"title": "iPhone 17 release date: Here’s when to expect Apple’s big launch - 9to5Mac", "summary": "iPhone 17 release date: Here’s when to expect Apple’s big launch 9to5Mac", "provider": "Wed, 09 Jul 2025 14:03:00 GMT"}, "12": {"title": "Apple insider says to expect iPhone 17 unveiling to take place during this particular week - PhoneArena", "summary": "Apple insider says to expect iPhone 17 unveiling to take place during this particular week PhoneArena", "provider": "Sun, 13 Jul 2025 20:22:04 GMT"}, "13": {"title": "Will a Leadership Change Be Enough to Turn Apple Around? - The Motley Fool", "summary": "Will a Leadership Change Be Enough to Turn Apple Around? The Motley Fool", "provider": "Sun, 13 Jul 2025 08:35:00 GMT"}, "14": {"title": "Apple Watch Ultra 3: What to Expect - MacRumors", "summary": "Apple Watch Ultra 3: What to Expect MacRumors", "provider": "Sun, 13 Jul 2025 17:30:00 GMT"}, "15": {"title": "I found the 26 best Amazon Prime Day Apple deals of 2025 - CNN", "summary": "I found the 26 best Amazon Prime Day Apple deals of 2025 CNN", "provider": "Fri, 11 Jul 2025 08:21:00 GMT"}, "16": {"title": "Apple Prime Day deals: AirPods, iPad, MacBook Air, iPhone 16 Pro, more - 9to5Mac", "summary": "Apple Prime Day deals: AirPods, iPad, MacBook Air, iPhone 16 Pro, more 9to5Mac", "provider": "Fri, 11 Jul 2025 12:00:00 GMT"}, "17": {"title": "The best Prime Day Apple deals on iPads, AirPods, MacBooks and more still available today - Engadget", "summary": "The best Prime Day Apple deals on iPads, AirPods, MacBooks and more still available today Engadget", "provider": "Sat, 12 Jul 2025 12:58:41 GMT"}, "18": {"title": "Apple Arcade launches four new games in August - Apple", "summary": "Apple Arcade launches four new games in August Apple", "provider": "Tue, 08 Jul 2025 13:59:48 GMT"}, "19": {"title": "Prime Day Apple Deals: Record-Low Prices on AirPods and iPads - NBC News", "summary": "Prime Day Apple Deals: Record-Low Prices on AirPods and iPads NBC News", "provider": "Sat, 12 Jul 2025 01:55:00 GMT"}, "20": {"title": "AI is turning Apple into a \"loser\" - Axios", "summary": "AI is turning Apple into a \"loser\" Axios", "provider": "Thu, 10 Jul 2025 11:02:22 GMT"}, "21": {"title": "These Apple Prime Day deals are still available this weekend - AppleInsider", "summary": "These Apple Prime Day deals are still available this weekend AppleInsider", "provider": "Sat, 12 Jul 2025 21:14:00 GMT"}, "22": {"title": "Apple - The Verge", "summary": "Apple The Verge", "provider": "Fri, 11 Jul 2025 20:05:42 GMT"}, "23": {"title": "Big Apple farm in Wrentham reopens as next generation takes over - WJAR", "summary": "Big Apple farm in Wrentham reopens as next generation takes over WJAR", "provider": "Sun, 13 Jul 2025 00:29:41 GMT"}, "24": {"title": "Elon Musk Gave Apple 72 Hours to Accept His $5 Billion Deal—Tim Cook Said No, and Paid the Price for His Decision - The Daily Galaxy", "summary": "Elon Musk Gave Apple 72 Hours to Accept His $5 Billion Deal—Tim Cook Said No, and Paid the Price for His Decision The Daily Galaxy", "provider": "Sun, 13 Jul 2025 11:00:00 GMT"}, "25": {"title": "Apple AirTags Make Me a Much Calmer Mom—And They’re on Major Sale Right Now - Parents", "summary": "Apple AirTags Make Me a Much Calmer Mom—And They’re on Major Sale Right Now Parents", "provider": "Thu, 10 Jul 2025 09:00:00 GMT"}, "26": {"title": "Apple Vision Pro: Should You Buy? Reviews, Features, and Price - MacRumors", "summary": "Apple Vision Pro: Should You Buy? Reviews, Features, and Price MacRumors", "provider": "Fri, 11 Jul 2025 23:06:09 GMT"}, "27": {"title": "Apple’s acclaimed sci-fi series “Murderbot” lands season two renewal - Apple", "summary": "Apple’s acclaimed sci-fi series “Murderbot” lands season two renewal Apple", "provider": "Thu, 10 Jul 2025 17:33:12 GMT"}, "28": {"title": "Here are the latest rumors on the upcoming MacBook Pro refresh: Release date, details - 9to5Mac", "summary": "Here are the latest rumors on the upcoming MacBook Pro refresh: Release date, details 9to5Mac", "provider": "Sun, 13 Jul 2025 14:30:00 GMT"}, "29": {"title": "Apple Music celebrates 10 years with the launch of a new global hub for artists - Apple", "summary": "Apple Music celebrates 10 years with the launch of a new global hub for artists Apple", "provider": "Mon, 30 Jun 2025 07:00:00 GMT"}, "30": {"title": "AirPort Base Stations: Will Apple Ever Return to Wi-Fi Router Market? - MacRumors", "summary": "AirPort Base Stations: Will Apple Ever Return to Wi-Fi Router Market? MacRumors", "provider": "Sun, 13 Jul 2025 17:20:00 GMT"}, "31": {"title": "Apple TV+ announces seventh season for celebrated spy drama “Slow Horses” - Apple", "summary": "Apple TV+ announces seventh season for celebrated spy drama “Slow Horses” Apple", "provider": "Tue, 08 Jul 2025 15:29:39 GMT"}, "32": {"title": "New Apple TV Expected Later This Year With These New Features - MacRumors", "summary": "New Apple TV Expected Later This Year With These New Features MacRumors", "provider": "Sat, 12 Jul 2025 22:09:24 GMT"}, "33": {"title": "Here's Why Apple's All-New Home Hub is Delayed - MacRumors", "summary": "Here's Why Apple's All-New Home Hub is Delayed MacRumors", "provider": "Sun, 13 Jul 2025 13:40:41 GMT"}, "34": {"title": "Apple bids for Formula 1 US streaming rights, Business Insider reports - Reuters", "summary": "Apple bids for Formula 1 US streaming rights, Business Insider reports Reuters", "provider": "Fri, 11 Jul 2025 20:58:27 GMT"}, "35": {"title": "Apple Smart Glasses: Everything We Know About Apple's Answer to Meta Ray-Bans - MacRumors", "summary": "Apple Smart Glasses: Everything We Know About Apple's Answer to Meta Ray-Bans MacRumors", "provider": "Fri, 11 Jul 2025 23:14:52 GMT"}, "36": {"title": "Where Will Apple Stock Be in 5 Years? - The Motley Fool", "summary": "Where Will Apple Stock Be in 5 Years? The Motley Fool", "provider": "Sat, 12 Jul 2025 08:07:00 GMT"}, "37": {"title": "The Best Prime Day Apple Deals Are Ripe for the Picking - GQ", "summary": "The Best Prime Day Apple Deals Are Ripe for the Picking GQ", "provider": "Thu, 10 Jul 2025 12:48:59 GMT"}, "38": {"title": "Apple, Visa and Mastercard win dismissal of merchant antitrust lawsuit over payment fees - Reuters", "summary": "Apple, Visa and Mastercard win dismissal of merchant antitrust lawsuit over payment fees Reuters", "provider": "Thu, 10 Jul 2025 15:44:16 GMT"}, "39": {"title": "Beelink Mate Mini Add Dual M.2 Storage to an Apple Mac Mini - ServeTheHome", "summary": "Beelink Mate Mini Add Dual M.2 Storage to an Apple Mac Mini ServeTheHome", "provider": "Sun, 13 Jul 2025 17:00:14 GMT"}, "40": {"title": "New Apple Watch AI Model Can Reveal Hidden Health Conditions - MacRumors", "summary": "New Apple Watch AI Model Can Reveal Hidden Health Conditions MacRumors", "provider": "Fri, 11 Jul 2025 05:53:14 GMT"}, "41": {"title": "We found 16 Prime Day Apple deals still live — get AirPods for $89, Apple Watch for $169 this weekend - Mashable", "summary": "We found 16 Prime Day Apple deals still live — get AirPods for $89, Apple Watch for $169 this weekend Mashable", "provider": "Sun, 13 Jul 2025 02:58:07 GMT"}, "42": {"title": "iPhone 17 launch expected for week of September 8 - AppleInsider", "summary": "iPhone 17 launch expected for week of September 8 AppleInsider", "provider": "Sun, 13 Jul 2025 12:51:00 GMT"}, "43": {"title": "Report: Apple’s all-new smart home hub is no longer likely to launch this year - 9to5Mac", "summary": "Report: Apple’s all-new smart home hub is no longer likely to launch this year 9to5Mac", "provider": "Sun, 13 Jul 2025 12:32:00 GMT"}, "44": {"title": "Widowhood Year 2: Goodbye Aptos, I’m feathering my nest in the Big Apple - Lookout Santa Cruz", "summary": "Widowhood Year 2: Goodbye Aptos, I’m feathering my nest in the Big Apple Lookout Santa Cruz", "provider": "Thu, 10 Jul 2025 12:11:45 GMT"}, "45": {"title": "How Jeff Williams' departure from Apple will shuffle exec responsibilities - AppleInsider", "summary": "How Jeff Williams' departure from Apple will shuffle exec responsibilities AppleInsider", "provider": "Sun, 13 Jul 2025 13:09:00 GMT"}, "46": {"title": "Apple eyes US Formula 1 broadcast rights after 'F1: The Movie' success, FT reports - Reuters", "summary": "Apple eyes US Formula 1 broadcast rights after 'F1: The Movie' success, FT reports Reuters", "provider": "Wed, 09 Jul 2025 11:05:38 GMT"}, "47": {"title": "Prime Day Apple deals are the lowest prices of 2025. Here’s what you can still buy - USA Today", "summary": "Prime Day Apple deals are the lowest prices of 2025. Here’s what you can still buy USA Today", "provider": "Fri, 11 Jul 2025 07:58:01 GMT"}, "48": {"title": "Apple to Launch New Low-Cost 11-Inch iPad in the Spring - MacRumors", "summary": "Apple to Launch New Low-Cost 11-Inch iPad in the Spring MacRumors", "provider": "Fri, 11 Jul 2025 10:40:33 GMT"}, "49": {"title": "The iPad Is the Tablet to Buy, and It’s Under $300 Right Now - WIRED", "summary": "The iPad Is the Tablet to Buy, and It’s Under $300 Right Now WIRED", "provider": "Fri, 11 Jul 2025 11:14:13 GMT"}, "50": {"title": "Apple's Formula for F1 - Spyglass.org", "summary": "Apple's Formula for F1 Spyglass.org", "provider": "Wed, 09 Jul 2025 14:14:56 GMT"}, "51": {"title": "Meet Apple's next COO Sabih Khan, a 30-year veteran who will oversee the iPhone maker’s supply chain amid the 'Trump tariff black cloud' - Fortune", "summary": "Meet Apple's next COO Sabih Khan, a 30-year veteran who will oversee the iPhone maker’s supply chain amid the 'Trump tariff black cloud' Fortune", "provider": "Wed, 09 Jul 2025 17:36:52 GMT"}, "52": {"title": "Apple’s AI efforts ‘have struck midnight,’ and the only way it can stop getting further behind is acquiring Perplexity, analyst Dan Ives says - Fortune", "summary": "Apple’s AI efforts ‘have struck midnight,’ and the only way it can stop getting further behind is acquiring Perplexity, analyst Dan Ives says Fortune", "provider": "Wed, 09 Jul 2025 23:27:00 GMT"}, "53": {"title": "Apple's upcoming low-cost MacBook: Colorful and affordable - AppleInsider", "summary": "Apple's upcoming low-cost MacBook: Colorful and affordable AppleInsider", "provider": "Fri, 11 Jul 2025 13:19:38 GMT"}, "54": {"title": "These Apple Products Are Coming in Early 2026 - MacRumors", "summary": "These Apple Products Are Coming in Early 2026 MacRumors", "provider": "Thu, 10 Jul 2025 19:24:08 GMT"}, "55": {"title": "Apple Studio Display Successor Now Expected Early Next Year - MacRumors", "summary": "Apple Studio Display Successor Now Expected Early Next Year MacRumors", "provider": "Fri, 11 Jul 2025 11:47:20 GMT"}, "56": {"title": "Tim Cook won't get fired by Apple's board of directors — and is likely to be chairman soon - AppleInsider", "summary": "Tim Cook won't get fired by Apple's board of directors — and is likely to be chairman soon AppleInsider", "provider": "Sun, 13 Jul 2025 12:47:00 GMT"}, "57": {"title": "The Best Deals Today: AirPods Pro 2, Dragon Quest III HD-2D Remake, Apple Watch Series 10, and More - IGN", "summary": "The Best Deals Today: AirPods Pro 2, Dragon Quest III HD-2D Remake, Apple Watch Series 10, and More IGN", "provider": "Sun, 13 Jul 2025 16:27:18 GMT"}, "58": {"title": "Apple's Low-Cost MacBook: Everything We Know So Far - MacRumors", "summary": "Apple's Low-Cost MacBook: Everything We Know So Far MacRumors", "provider": "Thu, 10 Jul 2025 22:55:40 GMT"}, "59": {"title": "Apple’s M5 chip could continue an unexpected new trend: report - 9to5Mac", "summary": "Apple’s M5 chip could continue an unexpected new trend: report 9to5Mac", "provider": "Fri, 11 Jul 2025 14:29:00 GMT"}}, "Amazon": {"0": {"title": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more - Yahoo", "summary": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more YahooAmazon Prime Day Ends Tonight — 259 Best Deals You Don’t Want to Miss NBC NewsAmazon Prime Day ", "provider": "Sat, 12 Jul 2025 13:33:15 GMT"}, "1": {"title": "Trump’s Purge of Foreign Workers Arrives at Amazon’s Warehouses - The New York Times", "summary": "Trump’s Purge of Foreign Workers Arrives at Amazon’s Warehouses The New York Times", "provider": "Fri, 11 Jul 2025 16:03:17 GMT"}, "2": {"title": "Recent Match Report - Guyana Amazon Warriors vs Dubai Capitals, Global Super League 2025, 6th Match | ESPN.com - ESPN", "summary": "Recent Match Report - Guyana Amazon Warriors vs Dubai Capitals, Global Super League 2025, 6th Match | ESPN.com ESPN", "provider": "Mon, 14 Jul 2025 04:11:00 GMT"}, "3": {"title": "Amazon Prime Day 2025 delivers record sales and savings in expanded four-day shopping event - AboutAmazon.com", "summary": "Amazon Prime Day 2025 delivers record sales and savings in expanded four-day shopping event AboutAmazon.com", "provider": "Sat, 12 Jul 2025 16:01:42 GMT"}, "4": {"title": "Best Amazon Deals Still Available After Prime Day 2025 - NBC News", "summary": "Best Amazon Deals Still Available After Prime Day 2025 NBC News", "provider": "Sat, 12 Jul 2025 10:42:42 GMT"}, "5": {"title": "I've been on Amazon for 5 months and haven't sold anything. After talking to experts, I'm planning to make 2 changes. - Business Insider", "summary": "I've been on Amazon for 5 months and haven't sold anything. After talking to experts, I'm planning to make 2 changes. Business Insider", "provider": "Sun, 13 Jul 2025 09:05:00 GMT"}, "6": {"title": "These ‘Incredibly Absorbent’ Bath Towels Are on Sale for Less Than $10 Apiece at Amazon Today - People.com", "summary": "These ‘Incredibly Absorbent’ Bath Towels Are on Sale for Less Than $10 Apiece at Amazon Today People.com", "provider": "Sun, 13 Jul 2025 12:00:00 GMT"}, "7": {"title": "My Doctor Dad Tells Me to Never Forget These 15 Crucial Items When I Travel—All Under $40 at Amazon - Travel + Leisure", "summary": "My Doctor Dad Tells Me to Never Forget These 15 Crucial Items When I Travel—All Under $40 at Amazon Travel + Leisure", "provider": "Fri, 11 Jul 2025 09:00:00 GMT"}, "8": {"title": "‘Scamazon’ – how fake emails are targeting Prime subscribers - The Guardian", "summary": "‘Scamazon’ – how fake emails are targeting Prime subscribers The Guardian", "provider": "Sun, 13 Jul 2025 07:01:00 GMT"}, "9": {"title": "Amazon Is Selling a 'Lightweight' $30 Dress for Just $15, and Shoppers Say It's 'Ideal for Warm Weather' - parade.com", "summary": "Amazon Is Selling a 'Lightweight' $30 Dress for Just $15, and Shoppers Say It's 'Ideal for Warm Weather' parade.com", "provider": "Sun, 13 Jul 2025 17:00:28 GMT"}, "10": {"title": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more - Yahoo", "summary": "Amazon Prime Day deals are still alive and well: Save over 50% on Apple, Samsung, Dyson and more Yahoo", "provider": "Mon, 14 Jul 2025 04:31:05 GMT"}, "11": {"title": "Amazon Prime Day deals end soon! Shop the 250+ best last-minute deals still available from brands like Apple and Yeti - AboutAmazon.com", "summary": "Amazon Prime Day deals end soon! Shop the 250+ best last-minute deals still available from brands like Apple and Yeti AboutAmazon.com", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "12": {"title": "Amazon: Expect Big AWS Updates Next Week - Seeking Alpha", "summary": "Amazon: Expect Big AWS Updates Next Week Seeking Alpha", "provider": "Sun, 13 Jul 2025 14:25:00 GMT"}, "13": {"title": "Former Amazon principal engineer says he spent '1-4 hours' reading daily — and it's part of the company's 'secret sauce' - Business Insider", "summary": "Former Amazon principal engineer says he spent '1-4 hours' reading daily — and it's part of the company's 'secret sauce' Business Insider", "provider": "Sun, 13 Jul 2025 15:17:00 GMT"}, "14": {"title": "Prime Day deals aren’t done. Secret savings found after Amazon ended its sale - WCVB", "summary": "Prime Day deals aren’t done. Secret savings found after Amazon ended its sale WCVB", "provider": "Sun, 13 Jul 2025 13:00:00 GMT"}, "15": {"title": "Amazon Says Customers Saved ‘Billions’ During Extended Prime Day - PYMNTS.com", "summary": "Amazon Says Customers Saved ‘Billions’ During Extended Prime Day PYMNTS.com", "provider": "Mon, 14 Jul 2025 01:41:15 GMT"}, "16": {"title": "Fatal crash involving Amazon semi-truck causes backup on I-75 in Weston - WPLG Local 10", "summary": "Fatal crash involving Amazon semi-truck causes backup on I-75 in Weston WPLG Local 10", "provider": "Sun, 13 Jul 2025 14:28:39 GMT"}, "17": {"title": "30+ Most Popular Amazon Prime Day 2025 Deals That Won’t Last Long - TODAY.com", "summary": "30+ Most Popular Amazon Prime Day 2025 Deals That Won’t Last Long TODAY.com", "provider": "Sat, 12 Jul 2025 14:41:00 GMT"}, "18": {"title": "Amazon Prime Day 2025 racks up record sales figures, company says - USA Today", "summary": "Amazon Prime Day 2025 racks up record sales figures, company says USA Today", "provider": "Sat, 12 Jul 2025 20:11:20 GMT"}, "19": {"title": "What GQ Editors Are Actually Buying On Amazon Prime Day 2025 - GQ", "summary": "What GQ Editors Are Actually Buying On Amazon Prime Day 2025 GQ", "provider": "Fri, 11 Jul 2025 13:35:37 GMT"}, "20": {"title": "I’m over 40, and I swear by these Amazon Prime Day beauty deals to delay the signs of aging - CNN", "summary": "I’m over 40, and I swear by these Amazon Prime Day beauty deals to delay the signs of aging CNN", "provider": "Sat, 12 Jul 2025 02:25:00 GMT"}, "21": {"title": "Missed Prime Day? These Amazon Deals Are Still Live Today - TODAY.com", "summary": "Missed Prime Day? These Amazon Deals Are Still Live Today TODAY.com", "provider": "Sat, 12 Jul 2025 13:33:43 GMT"}, "22": {"title": "You can still get Prime Day Amazon device deals up to 70% off on everything from Echo Buds to Blink video doorbells - AboutAmazon.com", "summary": "You can still get Prime Day Amazon device deals up to 70% off on everything from Echo Buds to Blink video doorbells AboutAmazon.com", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "23": {"title": "Summer discounts at Amazon, Walmart and other retailers aren't always as deep as they look - NBC News", "summary": "Summer discounts at Amazon, Walmart and other retailers aren't always as deep as they look NBC News", "provider": "Sun, 13 Jul 2025 11:00:40 GMT"}, "24": {"title": "The 157+ Best Prime Day Deals Actually Worth Your Money - NBC News", "summary": "The 157+ Best Prime Day Deals Actually Worth Your Money NBC News", "provider": "Thu, 10 Jul 2025 02:00:00 GMT"}, "25": {"title": "Only hours remain of Amazon Prime Day: Grab these last-minute deals before it's too late - SFGATE", "summary": "Only hours remain of Amazon Prime Day: Grab these last-minute deals before it's too late SFGATE", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "26": {"title": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services - Amazon.com", "summary": "New Amazon EC2 P6e-GB200 UltraServers accelerated by NVIDIA Grace Blackwell GPUs for the highest AI performance | Amazon Web Services Amazon.com", "provider": "Wed, 09 Jul 2025 20:55:03 GMT"}, "27": {"title": "Amazon Dodges 35% Prime Day Sales Drop by Stretching It to Four Days - Adweek", "summary": "Amazon Dodges 35% Prime Day Sales Drop by Stretching It to Four Days Adweek", "provider": "Fri, 11 Jul 2025 20:50:21 GMT"}, "28": {"title": "The best Amazon Prime Day deals you can still shop today (yes, really!) - USA Today", "summary": "The best Amazon Prime Day deals you can still shop today (yes, really!) USA Today", "provider": "Sat, 12 Jul 2025 21:51:15 GMT"}, "29": {"title": "The 100+ Best Prime Day Deals You Can Still Buy Right Now - GQ", "summary": "The 100+ Best Prime Day Deals You Can Still Buy Right Now GQ", "provider": "Sat, 12 Jul 2025 15:30:12 GMT"}, "30": {"title": "When does Amazon Prime Day end? What you need to know about the summer sales event - USA Today", "summary": "When does Amazon Prime Day end? What you need to know about the summer sales event USA Today", "provider": "Fri, 11 Jul 2025 17:20:53 GMT"}, "31": {"title": "Amazon Is Surprising Shoppers With an Extra Day of Prime Day Deals—Up to 86% Off - Travel + Leisure", "summary": "Amazon Is Surprising Shoppers With an Extra Day of Prime Day Deals—Up to 86% Off Travel + Leisure", "provider": "Sat, 12 Jul 2025 10:00:00 GMT"}, "32": {"title": "Amazon Stock Gets Price Target Hike As Analyst Sees AI Boosting Cloud Growth - Investor's Business Daily", "summary": "Amazon Stock Gets Price Target Hike As Analyst Sees AI Boosting Cloud Growth Investor's Business Daily", "provider": "Fri, 11 Jul 2025 15:54:00 GMT"}, "33": {"title": "I spent an hour digging through the land mine that is Amazon Haul — Here's what's worth buying, and how you can save an extra 40% off during Prime Day - Business Insider", "summary": "I spent an hour digging through the land mine that is Amazon Haul — Here's what's worth buying, and how you can save an extra 40% off during Prime Day Business Insider", "provider": "Sat, 12 Jul 2025 00:09:00 GMT"}, "34": {"title": "JPMorgan Lifts PT on Amazon.com (AMZN) Stock, Keeps Overweight - Yahoo Finance", "summary": "JPMorgan Lifts PT on Amazon.com (AMZN) Stock, Keeps Overweight Yahoo Finance", "provider": "Sun, 13 Jul 2025 19:25:15 GMT"}, "35": {"title": "It's the Final Hours of Prime Day: We're Tracking the Deals + Trends - WIRED", "summary": "It's the Final Hours of Prime Day: We're Tracking the Deals + Trends WIRED", "provider": "Thu, 10 Jul 2025 19:31:29 GMT"}, "36": {"title": "Amazon Prime Day Deals Under $10: Now’s the Time to Grab Toys, Tech Accessories and Home Essentials for Less - CNET", "summary": "Amazon Prime Day Deals Under $10: Now’s the Time to Grab Toys, Tech Accessories and Home Essentials for Less CNET", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "37": {"title": "Amazon Prime Day 2025: How long does it last and what's on sale? - ABC News - Breaking News, Latest News and Videos", "summary": "Amazon Prime Day 2025: How long does it last and what's on sale? ABC News - Breaking News, Latest News and Videos", "provider": "Thu, 10 Jul 2025 07:00:00 GMT"}, "38": {"title": "Amazon looking to hire 1,000 full-time workers at Elkhart County fulfillment center - WNDU", "summary": "Amazon looking to hire 1,000 full-time workers at Elkhart County fulfillment center WNDU", "provider": "Fri, 11 Jul 2025 15:55:00 GMT"}, "39": {"title": "Is Amazon’s Prime Day sale still clicking with shoppers? Some early data suggest people are spending less this year. - MarketWatch", "summary": "Is Amazon’s Prime Day sale still clicking with shoppers? Some early data suggest people are spending less this year. MarketWatch", "provider": "Thu, 10 Jul 2025 20:52:00 GMT"}, "40": {"title": "After Prime Day Ends Tonight, Kindles Likely Won't Be This Cheap Until Black Friday - Good Housekeeping", "summary": "After Prime Day Ends Tonight, Kindles Likely Won't Be This Cheap Until Black Friday Good Housekeeping", "provider": "Fri, 11 Jul 2025 16:39:00 GMT"}, "41": {"title": "Amazon Prime Day Ends Tonight. Here Are 100+ of The Best Deals We've Found. | Reviews by Wirecutter - The New York Times", "summary": "Amazon Prime Day Ends Tonight. Here Are 100+ of The Best Deals We've Found. | Reviews by Wirecutter The New York Times", "provider": "Fri, 11 Jul 2025 07:00:00 GMT"}, "42": {"title": "Amazon Prime Day 2025: These products are seeing their lowest price of the year - WGAL", "summary": "Amazon Prime Day 2025: These products are seeing their lowest price of the year WGAL", "provider": "Thu, 10 Jul 2025 09:51:34 GMT"}, "43": {"title": "Amazon boasts futuristic robots have 'a sense of touch.' Teradyne is key supplier behind this new innovation. - Yahoo Finance", "summary": "Amazon boasts futuristic robots have 'a sense of touch.' Teradyne is key supplier behind this new innovation. Yahoo Finance", "provider": "Sun, 13 Jul 2025 16:02:13 GMT"}, "44": {"title": "Amazon’s Prime Day event is back this July - AboutAmazon.com", "summary": "Amazon’s Prime Day event is back this July AboutAmazon.com", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "45": {"title": "TikTok poached Amazon employees to jump-start its US business. Now it's doubling down on its Chinese roots. - Business Insider", "summary": "TikTok poached Amazon employees to jump-start its US business. Now it's doubling down on its Chinese roots. Business Insider", "provider": "Fri, 11 Jul 2025 14:35:00 GMT"}, "46": {"title": "The 50 Best Extended Amazon Prime Day Deals You Can Still Shop - People.com", "summary": "The 50 Best Extended Amazon Prime Day Deals You Can Still Shop People.com", "provider": "Sat, 12 Jul 2025 10:30:00 GMT"}, "47": {"title": "Amazon Prime Day Fuels 30.3% Rise In US Online Spending - Bloomberg", "summary": "Amazon Prime Day Fuels 30.3% Rise In US Online Spending Bloomberg", "provider": "Sat, 12 Jul 2025 16:33:49 GMT"}, "48": {"title": "We’ve covered every Amazon Prime Day and these 162 deals are actually worth shopping - CNN", "summary": "We’ve covered every Amazon Prime Day and these 162 deals are actually worth shopping CNN", "provider": "Fri, 11 Jul 2025 05:46:00 GMT"}, "49": {"title": "Summer savings: How Prime Day 2025 and competing sales are actually going - Axios", "summary": "Summer savings: How Prime Day 2025 and competing sales are actually going Axios", "provider": "Wed, 09 Jul 2025 21:25:37 GMT"}, "50": {"title": "Our Amazon Reviewer Found the Best Kindle and Echo Device Deals - WIRED", "summary": "Our Amazon Reviewer Found the Best Kindle and Echo Device Deals WIRED", "provider": "Fri, 11 Jul 2025 18:59:47 GMT"}, "51": {"title": "Amazon considers another multibillion-dollar investment in Anthropic, FT reports - Reuters", "summary": "Amazon considers another multibillion-dollar investment in Anthropic, FT reports Reuters", "provider": "Thu, 10 Jul 2025 14:46:31 GMT"}, "52": {"title": "The Best Amazon Prime Day Deals Under $25 on Everyday Essentials - The New York Times", "summary": "The Best Amazon Prime Day Deals Under $25 on Everyday Essentials The New York Times", "provider": "Fri, 11 Jul 2025 19:35:13 GMT"}, "53": {"title": "Amazon Prime Day Ends TONIGHT: Here Are 24 Items Still Worth Buying - House Beautiful", "summary": "Amazon Prime Day Ends TONIGHT: Here Are 24 Items Still Worth Buying House Beautiful", "provider": "Fri, 11 Jul 2025 17:30:00 GMT"}, "54": {"title": "Amazon Stock Has Room to Run. 2 Analysts Raise Price Targets Before Earnings. - Barron's", "summary": "Amazon Stock Has Room to Run. 2 Analysts Raise Price Targets Before Earnings. Barron's", "provider": "Fri, 11 Jul 2025 16:56:00 GMT"}, "55": {"title": "104 Prime Day Deals Under $100, Curated By a Broke Shopping Editor - Architectural Digest", "summary": "104 Prime Day Deals Under $100, Curated By a Broke Shopping Editor Architectural Digest", "provider": "Fri, 11 Jul 2025 10:03:00 GMT"}, "56": {"title": "It's the Final Prime Day! Shop Now, Before the Best Deals Are Gone - The Spruce", "summary": "It's the Final Prime Day! Shop Now, Before the Best Deals Are Gone The Spruce", "provider": "Sat, 12 Jul 2025 00:25:00 GMT"}, "57": {"title": "'It's been hell': Hundreds of Amazon packages fill up San Jose woman's garage after year-long mishap with overseas seller - ABC7 San Francisco", "summary": "'It's been hell': Hundreds of Amazon packages fill up San Jose woman's garage after year-long mishap with overseas seller ABC7 San Francisco", "provider": "Wed, 09 Jul 2025 03:55:39 GMT"}, "58": {"title": "Amazon (AMZN)’s AI Push Could Fuel AWS Growth—And Wall Street Is Finally Noticing - Yahoo Finance", "summary": "Amazon (AMZN)’s AI Push Could Fuel AWS Growth—And Wall Street Is Finally Noticing Yahoo Finance", "provider": "Sun, 13 Jul 2025 15:50:42 GMT"}, "59": {"title": "Amazon to hire over 1,000 full-time workers for Elkhart fulfillment center - WSBT", "summary": "Amazon to hire over 1,000 full-time workers for Elkhart fulfillment center WSBT", "provider": "Sat, 12 Jul 2025 04:06:02 GMT"}}, "Alphabet": {"0": {"title": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In - Yahoo Finance", "summary": "Nvidia, Microsoft, or Alphabet: Which AI Stock Giant Holds the Highest Upside? Analysts Weigh In Yahoo Finance", "provider": "Sat, 12 Jul 2025 10:20:39 GMT"}, "1": {"title": "Alphabet Stock Looks Like a Big Tech Bargain - Yahoo Finance", "summary": "Alphabet Stock Looks Like a Big Tech Bargain Yahoo Finance", "provider": "Sat, 12 Jul 2025 12:05:00 GMT"}, "2": {"title": "Alphabet: The Cheapest 'Magnificent 7' Stock Into The Q2 Earnings Season (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet: The Cheapest 'Magnificent 7' Stock Into The Q2 Earnings Season (NASDAQ:GOOGL) Seeking Alpha", "provider": "Fri, 11 Jul 2025 15:35:00 GMT"}, "3": {"title": "Why Alphabet’s (GOOGL) Valuation Hints at Stock Rebound - TipRanks", "summary": "Why Alphabet’s (GOOGL) Valuation Hints at Stock Rebound TipRanks", "provider": "Thu, 10 Jul 2025 23:47:24 GMT"}, "4": {"title": "Google strikes $2.4 bn deal with Windsurf, to hire CEO Varun Mohan, get AI licensing rights after OpenAI talks collapse - Mint", "summary": "Google strikes $2.4 bn deal with Windsurf, to hire CEO Varun Mohan, get AI licensing rights after OpenAI talks collapse Mint", "provider": "Sat, 12 Jul 2025 12:27:03 GMT"}, "5": {"title": "Warren Buffett’s hidden quantum play: Berkshire Hathaway’s bet on Alphabet and Microsoft’s next big fronti - The Economic Times", "summary": "Warren Buffett’s hidden quantum play: Berkshire Hathaway’s bet on Alphabet and Microsoft’s next big fronti The Economic Times", "provider": "Sat, 12 Jul 2025 09:06:44 GMT"}, "6": {"title": "Protecting Your Alphabet Position as Regulators Close In - Yahoo Finance", "summary": "Protecting Your Alphabet Position as Regulators Close In Yahoo Finance", "provider": "Fri, 11 Jul 2025 11:26:41 GMT"}, "7": {"title": "Do Options Traders Know Something About Alphabet Stock We Don't? - TradingView", "summary": "Do Options Traders Know Something About Alphabet Stock We Don't? TradingView", "provider": "Fri, 11 Jul 2025 12:34:00 GMT"}, "8": {"title": "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now. - Yahoo Finance", "summary": "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now. Yahoo Finance", "provider": "Sun, 13 Jul 2025 07:15:00 GMT"}, "9": {"title": "Google Beats OpenAI, Secures Windsurf Technology, CEO And Key Staff For $2.4 Billion - Benzinga", "summary": "Google Beats OpenAI, Secures Windsurf Technology, CEO And Key Staff For $2.4 Billion Benzinga", "provider": "Sat, 12 Jul 2025 04:23:10 GMT"}, "10": {"title": "Alphabet Class C: YouTube’s AI Clampdown and Stock Surge - TipRanks", "summary": "Alphabet Class C: YouTube’s AI Clampdown and Stock Surge TipRanks", "provider": "Sat, 12 Jul 2025 15:14:09 GMT"}, "11": {"title": "2 Growth Stocks to Buy Now With Less Than $500 - Yahoo Finance", "summary": "2 Growth Stocks to Buy Now With Less Than $500 Yahoo Finance", "provider": "Sat, 12 Jul 2025 08:05:00 GMT"}, "12": {"title": "8\" Gold Decorative Rhinestone Alphabet Letter Stickers DIY Crafts - K - roarmag.org", "summary": "8\" Gold Decorative Rhinestone Alphabet Letter Stickers DIY Crafts - K roarmag.org", "provider": "Sun, 13 Jul 2025 22:25:53 GMT"}, "13": {"title": "Alphabet, Inc. - Britannica", "summary": "Alphabet, Inc. Britannica", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "14": {"title": "Alphabet Stock Looks Like a Big Tech Bargain - The Motley Fool", "summary": "Alphabet Stock Looks Like a Big Tech Bargain The Motley Fool", "provider": "Sat, 12 Jul 2025 12:05:00 GMT"}, "15": {"title": "Check Out Lubbock’s Alphabet Dating Challenge! Here’s Letter J - FMX 94.5", "summary": "Check Out Lubbock’s Alphabet Dating Challenge! Here’s Letter J FMX 94.5", "provider": "Wed, 09 Jul 2025 17:03:03 GMT"}, "16": {"title": "Alphabet: Technical Momentum Is Starting to Turn - MarketBeat", "summary": "Alphabet: Technical Momentum Is Starting to Turn MarketBeat", "provider": "Thu, 10 Jul 2025 19:58:56 GMT"}, "17": {"title": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why - Insider Monkey", "summary": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why Insider Monkey", "provider": "Fri, 11 Jul 2025 10:37:27 GMT"}, "18": {"title": "Why Alphabet Stock Popped Today - The Motley Fool", "summary": "Why Alphabet Stock Popped Today The Motley Fool", "provider": "Wed, 09 Jul 2025 19:34:00 GMT"}, "19": {"title": "Alphabet Vs. OpenAI: Why I'm Not Panicking About Chrome (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet Vs. OpenAI: Why I'm Not Panicking About Chrome (NASDAQ:GOOGL) Seeking Alpha", "provider": "Thu, 10 Jul 2025 14:53:00 GMT"}, "20": {"title": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock - Yahoo Finance", "summary": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock Yahoo Finance", "provider": "Fri, 11 Jul 2025 21:01:15 GMT"}, "21": {"title": "Alphabet: Buying Opportunities Like This Don't Come Often (NASDAQ:GOOGL) - Seeking Alpha", "summary": "Alphabet: Buying Opportunities Like This Don't Come Often (NASDAQ:GOOGL) Seeking Alpha", "provider": "Wed, 09 Jul 2025 13:20:00 GMT"}, "22": {"title": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors - Yahoo Finance", "summary": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors Yahoo Finance", "provider": "Tue, 08 Jul 2025 21:45:04 GMT"}, "23": {"title": "Alphabet's Growth Catalysts Overly Discounted - Double-Down Strong Buy Opportunity - Seeking Alpha", "summary": "Alphabet's Growth Catalysts Overly Discounted - Double-Down Strong Buy Opportunity Seeking Alpha", "provider": "Wed, 09 Jul 2025 13:30:00 GMT"}, "24": {"title": "Analyst Explains Why Alphabet (GOOG) is ‘Real Alpha’ for Portfolios - Yahoo Finance", "summary": "Analyst Explains Why Alphabet (GOOG) is ‘Real Alpha’ for Portfolios Yahoo Finance", "provider": "Thu, 10 Jul 2025 13:39:35 GMT"}, "25": {"title": "The Zacks Analyst Blog Highlights Alphabet, Microsoft, Amazon and NVIDIA - Yahoo Finance", "summary": "The Zacks Analyst Blog Highlights Alphabet, Microsoft, Amazon and NVIDIA Yahoo Finance", "provider": "Wed, 09 Jul 2025 10:02:00 GMT"}, "26": {"title": "Do Options Traders Know Something About Alphabet Stock We Don't? - Yahoo Finance", "summary": "Do Options Traders Know Something About Alphabet Stock We Don't? Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:34:00 GMT"}, "27": {"title": "The Zacks Analyst Blog Highlights Tesla, Alphabet and Amazon - Yahoo Finance", "summary": "The Zacks Analyst Blog Highlights Tesla, Alphabet and Amazon Yahoo Finance", "provider": "Fri, 11 Jul 2025 09:12:00 GMT"}, "28": {"title": "Love Is In The Air As Couples Tackle The A To Z Of Lubbock Nights - FMX 94.5", "summary": "Love Is In The Air As Couples Tackle The A To Z Of Lubbock Nights FMX 94.5", "provider": "Fri, 11 Jul 2025 17:01:29 GMT"}, "29": {"title": "Why Alphabet May Be the Most Misunderstood Big Tech Stock - Investing.com", "summary": "Why Alphabet May Be the Most Misunderstood Big Tech Stock Investing.com", "provider": "Fri, 11 Jul 2025 15:06:52 GMT"}, "30": {"title": "Lovebirds In Lubbock Are Taking Date Night To The Next Level With A Quirky New Challenge - FMX 94.5", "summary": "Lovebirds In Lubbock Are Taking Date Night To The Next Level With A Quirky New Challenge FMX 94.5", "provider": "Fri, 11 Jul 2025 14:45:07 GMT"}, "31": {"title": "Alecta Pensionsforsakring Reduces Stake in Alphabet Inc. - TipRanks", "summary": "Alecta Pensionsforsakring Reduces Stake in Alphabet Inc. TipRanks", "provider": "Sat, 12 Jul 2025 03:26:16 GMT"}, "32": {"title": "Alphabet Class A: AI Innovations and Stock Prospects - TipRanks", "summary": "Alphabet Class A: AI Innovations and Stock Prospects TipRanks", "provider": "Sat, 12 Jul 2025 15:14:11 GMT"}, "33": {"title": "A Once-in-a-Decade Opportunity: Alphabet's Stock Looks Like a Brilliant Buy Right Now - The Motley Fool", "summary": "A Once-in-a-Decade Opportunity: Alphabet's Stock Looks Like a Brilliant Buy Right Now The Motley Fool", "provider": "Mon, 07 Jul 2025 09:15:00 GMT"}, "34": {"title": "Why Alphabet Stock Popped Today - Yahoo Finance", "summary": "Why Alphabet Stock Popped Today Yahoo Finance", "provider": "Wed, 09 Jul 2025 19:34:00 GMT"}, "35": {"title": "Google’s Unloved Stock Makes It a Big Tech Bargain - WSJ - The Wall Street Journal", "summary": "Google’s Unloved Stock Makes It a Big Tech Bargain - WSJ The Wall Street Journal", "provider": "Wed, 09 Jul 2025 09:30:00 GMT"}, "36": {"title": "Alphabet Breakup Could Unleash Cloud Growth -- Analyst Calls It a 'Top Pick' - Yahoo Finance", "summary": "Alphabet Breakup Could Unleash Cloud Growth -- Analyst Calls It a 'Top Pick' Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}, "37": {"title": "Lawmakers Just Accidentally Made Alphabet Irresistibly Attractive (NASDAQ:GOOG) - Seeking Alpha", "summary": "Lawmakers Just Accidentally Made Alphabet Irresistibly Attractive (NASDAQ:GOOG) Seeking Alpha", "provider": "Sat, 05 Jul 2025 07:00:00 GMT"}, "38": {"title": "2 Undervalued AI Stocks Poised for Explosive Growth - Yahoo Finance", "summary": "2 Undervalued AI Stocks Poised for Explosive Growth Yahoo Finance", "provider": "Fri, 11 Jul 2025 12:45:00 GMT"}, "39": {"title": "Her 15-year-old son died subway surfing. Now this Alphabet City mother is taking TikTok and Instagram to court - amNewYork", "summary": "Her 15-year-old son died subway surfing. Now this Alphabet City mother is taking TikTok and Instagram to court amNewYork", "provider": "Wed, 09 Jul 2025 21:00:49 GMT"}, "40": {"title": "Prediction: Alphabet's Stock Will Deliver Monster Performance Over the Next 2 Years - The Motley Fool", "summary": "Prediction: Alphabet's Stock Will Deliver Monster Performance Over the Next 2 Years The Motley Fool", "provider": "Sun, 06 Jul 2025 09:30:00 GMT"}, "41": {"title": "Why Is Alphabet Stock Worth Less Than Nvidia, Microsoft, Apple, and Amazon Even Though It Is the Most Profitable S&P 500 Company? - Yahoo Finance", "summary": "Why Is Alphabet Stock Worth Less Than Nvidia, Microsoft, Apple, and Amazon Even Though It Is the Most Profitable S&P 500 Company? Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}, "42": {"title": "Nike, Boeing and Alphabet upgraded: Wall Street’s top analyst calls - Yahoo Finance", "summary": "Nike, Boeing and Alphabet upgraded: Wall Street’s top analyst calls Yahoo Finance", "provider": "Sat, 28 Jun 2025 07:00:00 GMT"}, "43": {"title": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock - MSN", "summary": "Why Wall Street analysts think Alphabet may be the most overlooked Big Tech stock MSN", "provider": "Fri, 11 Jul 2025 15:36:46 GMT"}, "44": {"title": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 - Yahoo Finance", "summary": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 Yahoo Finance", "provider": "Wed, 09 Jul 2025 21:27:01 GMT"}, "45": {"title": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 - Insider Monkey", "summary": "Roth Capital Names Alphabet (GOOGL) Its Top Mega-Cap Pick for Late 2025 Insider Monkey", "provider": "Wed, 09 Jul 2025 21:31:05 GMT"}, "46": {"title": "Why Alphabet Stock Popped Today - MSN", "summary": "Why Alphabet Stock Popped Today MSN", "provider": "Wed, 09 Jul 2025 20:12:33 GMT"}, "47": {"title": "10 Reasons to Buy Alphabet Stock Like There's No Tomorrow - Yahoo Finance", "summary": "10 Reasons to Buy Alphabet Stock Like There's No Tomorrow Yahoo Finance", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "48": {"title": "British Antitrust Case Threatens to Derail Alphabet’s (GOOGL) Monopoly - TipRanks", "summary": "British Antitrust Case Threatens to Derail Alphabet’s (GOOGL) Monopoly TipRanks", "provider": "Wed, 09 Jul 2025 01:27:23 GMT"}, "49": {"title": "Bitcoin hits new all-time high, outpaces Meta, Alphabet, Saudi Aramco - Informed crypto news", "summary": "Bitcoin hits new all-time high, outpaces Meta, Alphabet, Saudi Aramco Informed crypto news", "provider": "Fri, 11 Jul 2025 10:55:25 GMT"}, "50": {"title": "AI Names the Greatest Footballer For Every Letter of the Alphabet - No Ronaldo or Maradona - GiveMeSport", "summary": "AI Names the Greatest Footballer For Every Letter of the Alphabet - No Ronaldo or Maradona GiveMeSport", "provider": "Sun, 13 Jul 2025 18:30:00 GMT"}, "51": {"title": "Alphabet price target raised on strong AI adoption, Waymo valuation - Proactive financial news", "summary": "Alphabet price target raised on strong AI adoption, Waymo valuation Proactive financial news", "provider": "Wed, 09 Jul 2025 18:29:00 GMT"}, "52": {"title": "Alphabet Inc. (GOOGL): I Sold Too Soon, Says Jim Cramer - Yahoo Finance", "summary": "Alphabet Inc. (GOOGL): I Sold Too Soon, Says Jim Cramer Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "53": {"title": "Isomorphic Labs has grand ambitions to 'solve all diseases' with AI. Now, it's gearing up for its first human trials - Fortune", "summary": "Isomorphic Labs has grand ambitions to 'solve all diseases' with AI. Now, it's gearing up for its first human trials Fortune", "provider": "Sun, 06 Jul 2025 13:00:00 GMT"}, "54": {"title": "Google faces threat that could destroy its business - TheStreet", "summary": "Google faces threat that could destroy its business TheStreet", "provider": "Thu, 10 Jul 2025 15:03:00 GMT"}, "55": {"title": "EU Releases AI Code As Alphabet, OpenAI, Review Participation - Stocktwits", "summary": "EU Releases AI Code As Alphabet, OpenAI, Review Participation Stocktwits", "provider": "Wed, 09 Jul 2025 01:04:43 GMT"}, "56": {"title": "Is OpenAI's Deal With Alphabet a Game Changer? - The Motley Fool", "summary": "Is OpenAI's Deal With Alphabet a Game Changer? The Motley Fool", "provider": "Sat, 21 Jun 2025 07:00:00 GMT"}, "57": {"title": "Alphabet, Palantir, AMC, Excellon Resources: What brokers said this week - Proactive financial news", "summary": "Alphabet, Palantir, AMC, Excellon Resources: What brokers said this week Proactive financial news", "provider": "Fri, 11 Jul 2025 15:41:00 GMT"}, "58": {"title": "Mixed options sentiment in Alphabet Class A with shares up 0.57% - TipRanks", "summary": "Mixed options sentiment in Alphabet Class A with shares up 0.57% TipRanks", "provider": "Thu, 10 Jul 2025 20:45:56 GMT"}, "59": {"title": "Is Alphabet's Stock Absurdly Cheap? - The Motley Fool", "summary": "Is Alphabet's Stock Absurdly Cheap? The Motley Fool", "provider": "Fri, 27 Jun 2025 07:00:00 GMT"}}, "Tesla": {"0": {"title": "Musk will ask Tesla shareholders to vote on bailout for twitter/xAI - Electrek", "summary": "Musk will ask Tesla shareholders to vote on bailout for twitter/xAI Electrek", "provider": "Mon, 14 Jul 2025 04:20:00 GMT"}, "1": {"title": "Elon Musk says Tesla shareholders will vote on investing in xAI - Business Insider", "summary": "Elon Musk says Tesla shareholders will vote on investing in xAI Business Insider", "provider": "Mon, 14 Jul 2025 04:07:00 GMT"}, "2": {"title": "Tesla to offer shareholders chance to invest in xAI: Musk - Yahoo Finance", "summary": "Tesla to offer shareholders chance to invest in xAI: Musk Yahoo Finance", "provider": "Mon, 14 Jul 2025 02:41:51 GMT"}, "3": {"title": "The Tesla leaks: what it’s really like to work for Elon Musk - The Times", "summary": "The Tesla leaks: what it’s really like to work for Elon Musk The Times", "provider": "Sat, 12 Jul 2025 21:00:00 GMT"}, "4": {"title": "Tesla supplier CATL has potential beyond just batteries, analysts say - CNBC", "summary": "Tesla supplier CATL has potential beyond just batteries, analysts say CNBC", "provider": "Sun, 13 Jul 2025 11:41:31 GMT"}, "5": {"title": "Tesla debuts hands-free Grok AI with update 2025.26: What you need to know - Teslarati", "summary": "Tesla debuts hands-free Grok AI with update 2025.26: What you need to know Teslarati", "provider": "Sat, 12 Jul 2025 18:26:42 GMT"}, "6": {"title": "Tesla Software Update 2025.26: Grok, Light Sync, Audio Presets and More [VIDEO] - Not a Tesla App", "summary": "Tesla Software Update 2025.26: Grok, Light Sync, Audio Presets and More [VIDEO] Not a Tesla App", "provider": "Sat, 12 Jul 2025 16:24:00 GMT"}, "7": {"title": "xAI explains the Grok Nazi meltdown, as Tesla puts Elon’s bot in its cars - The Verge", "summary": "xAI explains the Grok Nazi meltdown, as Tesla puts Elon’s bot in its cars The Verge", "provider": "Sun, 13 Jul 2025 00:54:00 GMT"}, "8": {"title": "Tesla: No Longer Just An Automotive Company But An AI Leader (Rating Upgrade) - Seeking Alpha", "summary": "Tesla: No Longer Just An Automotive Company But An AI Leader (Rating Upgrade) Seeking Alpha", "provider": "Sat, 12 Jul 2025 13:00:00 GMT"}, "9": {"title": "Tesla Stock Drops. There’s Bad News on Batteries for Musk's EV Maker. - Barron's", "summary": "Tesla Stock Drops. There’s Bad News on Batteries for Musk's EV Maker. Barron's", "provider": "Fri, 11 Jul 2025 20:20:00 GMT"}, "10": {"title": "JPMorgan's top short ideas for the second half including Tesla - CNBC", "summary": "JPMorgan's top short ideas for the second half including Tesla CNBC", "provider": "Sun, 13 Jul 2025 11:40:16 GMT"}, "11": {"title": "Why Elon Musk may have reached the end of the road at Tesla - The Telegraph", "summary": "Why Elon Musk may have reached the end of the road at Tesla The Telegraph", "provider": "Sun, 13 Jul 2025 11:00:00 GMT"}, "12": {"title": "'I Don't Think I Ever Want To Go To a Normal Dealership': Man Buys Tesla. Then He Says Buying One Is a 'Next Level' Experience - InsideEVs", "summary": "'I Don't Think I Ever Want To Go To a Normal Dealership': Man Buys Tesla. Then He Says Buying One Is a 'Next Level' Experience InsideEVs", "provider": "Fri, 11 Jul 2025 14:00:00 GMT"}, "13": {"title": "As Tesla Stumbles, SpaceX’s Finances Go From Strength to Strength - The Wall Street Journal", "summary": "As Tesla Stumbles, SpaceX’s Finances Go From Strength to Strength The Wall Street Journal", "provider": "Sat, 12 Jul 2025 01:00:00 GMT"}, "14": {"title": "Former Tesla engineer says the way company handles legal disputes has a powerful flaw - San Francisco Chronicle", "summary": "Former Tesla engineer says the way company handles legal disputes has a powerful flaw San Francisco Chronicle", "provider": "Sat, 12 Jul 2025 11:10:21 GMT"}, "15": {"title": "Tesla Likely to Begin First Deliveries in India From August - Bloomberg", "summary": "Tesla Likely to Begin First Deliveries in India From August Bloomberg", "provider": "Fri, 11 Jul 2025 11:35:45 GMT"}, "16": {"title": "Musk's Tesla marks formal India entry with Mumbai launch event - Reuters", "summary": "Musk's Tesla marks formal India entry with Mumbai launch event Reuters", "provider": "Fri, 11 Jul 2025 06:20:00 GMT"}, "17": {"title": "Tesla to officially launch in India with planned showroom opening - CNBC", "summary": "Tesla to officially launch in India with planned showroom opening CNBC", "provider": "Fri, 11 Jul 2025 12:03:25 GMT"}, "18": {"title": "Tesla's Grok AI Has Landed. Here's What We Know - InsideEVs", "summary": "Tesla's Grok AI Has Landed. Here's What We Know InsideEVs", "provider": "Sun, 13 Jul 2025 16:18:00 GMT"}, "19": {"title": "Musk Suggests Tesla Shareholders Will Vote on xAI Investment - Bloomberg", "summary": "Musk Suggests Tesla Shareholders Will Vote on xAI Investment Bloomberg", "provider": "Mon, 14 Jul 2025 00:09:00 GMT"}, "20": {"title": "Elon Musk’s Companies Had a Busy Weekend. Tesla Investors Should Take Note. - Barron's", "summary": "Elon Musk’s Companies Had a Busy Weekend. Tesla Investors Should Take Note. Barron's", "provider": "Sun, 13 Jul 2025 17:13:00 GMT"}, "21": {"title": "‘Time to Up the Ante,’ Says Top Investor About Tesla Stock - TipRanks", "summary": "‘Time to Up the Ante,’ Says Top Investor About Tesla Stock TipRanks", "provider": "Mon, 14 Jul 2025 00:44:11 GMT"}, "22": {"title": "I've Got a Green Matte Wrap on My Tesla. I Recently Took It to a Detailer, and Now the Hood Looks Blotchy, Uneven, and Has Patches Where the Matte Finish Is Basically Ruined. Any Help or Suggestion...", "summary": "I've Got a Green Matte Wrap on My Tesla. I Recently Took It to a Detailer, and Now the Hood Looks Blotchy, Uneven, and Has Patches Where the Matte Finish Is Basically Ruined. Any Help or Suggestion", "provider": "Sun, 13 Jul 2025 21:50:52 GMT"}, "23": {"title": "Tesla, Inc. - Britannica", "summary": "Tesla, Inc. Britannica", "provider": "Thu, 10 Jul 2025 14:55:00 GMT"}, "24": {"title": "Tesla: Here's What People Are Misunderstanding - Seeking Alpha", "summary": "Tesla: Here's What People Are Misunderstanding Seeking Alpha", "provider": "Sun, 13 Jul 2025 09:21:00 GMT"}, "25": {"title": "The Deep Story On The Waymo Vs Tesla Robotaxi Battle, With Video - Forbes", "summary": "The Deep Story On The Waymo Vs Tesla Robotaxi Battle, With Video Forbes", "provider": "Wed, 09 Jul 2025 12:30:00 GMT"}, "26": {"title": "Tesla vandalism at Maryland school recorded by built-in cameras - NBC4 Washington", "summary": "Tesla vandalism at Maryland school recorded by built-in cameras NBC4 Washington", "provider": "Fri, 11 Jul 2025 17:58:21 GMT"}, "27": {"title": "Musk says Tesla shareholders will vote on xAI investment By Investing.com - Investing.com", "summary": "Musk says Tesla shareholders will vote on xAI investment By Investing.com Investing.com", "provider": "Mon, 14 Jul 2025 00:00:21 GMT"}, "28": {"title": "Norway’s Tesla obsession defies Europe’s Musk backlash - CNBC", "summary": "Norway’s Tesla obsession defies Europe’s Musk backlash CNBC", "provider": "Fri, 11 Jul 2025 05:08:57 GMT"}, "29": {"title": "Tesla Is Headed to Trial Over Another Deadly Autopilot Crash - Business Insider", "summary": "Tesla Is Headed to Trial Over Another Deadly Autopilot Crash Business Insider", "provider": "Sat, 12 Jul 2025 09:02:00 GMT"}, "30": {"title": "Tesla Sets Date for Shareholders Meeting After Protests - The New York Times", "summary": "Tesla Sets Date for Shareholders Meeting After Protests The New York Times", "provider": "Thu, 10 Jul 2025 15:20:23 GMT"}, "31": {"title": "Man Checks Out Los Angeles’ New, 75-Stall Tesla Supercharging Station. Then He Sees Its Movie Theaters - InsideEVs", "summary": "Man Checks Out Los Angeles’ New, 75-Stall Tesla Supercharging Station. Then He Sees Its Movie Theaters InsideEVs", "provider": "Mon, 14 Jul 2025 02:07:33 GMT"}, "32": {"title": "I Planned to Post a Glowing Tesla Model Y Review After My Remote Western Australia Road Trip, But 700 Miles Away I Ran Into a Sensor Issue - Torque News", "summary": "I Planned to Post a Glowing Tesla Model Y Review After My Remote Western Australia Road Trip, But 700 Miles Away I Ran Into a Sensor Issue Torque News", "provider": "Fri, 11 Jul 2025 10:04:50 GMT"}, "33": {"title": "JPMorgan Says to Short Tesla (TSLA), Moderna (MRNA), and 7 Other Stocks in 2025 - TipRanks", "summary": "JPMorgan Says to Short Tesla (TSLA), Moderna (MRNA), and 7 Other Stocks in 2025 TipRanks", "provider": "Sun, 13 Jul 2025 13:47:08 GMT"}, "34": {"title": "Tesla’s Sales In The U.S. Market Should Decline Sharply: New Law (NASDAQ:TSLA) - Seeking Alpha", "summary": "Tesla’s Sales In The U.S. Market Should Decline Sharply: New Law (NASDAQ:TSLA) Seeking Alpha", "provider": "Fri, 11 Jul 2025 19:24:00 GMT"}, "35": {"title": "Used Tesla Prices Were Expected To Crash. Then They Didn't - InsideEVs", "summary": "Used Tesla Prices Were Expected To Crash. Then They Didn't InsideEVs", "provider": "Thu, 10 Jul 2025 19:36:00 GMT"}, "36": {"title": "‘Update?!’: Couple Takes Florida Road Trip In A Tesla. Then The Screen Says They’ll Arrive With ‘-2%’ Charge - InsideEVs", "summary": "‘Update?!’: Couple Takes Florida Road Trip In A Tesla. Then The Screen Says They’ll Arrive With ‘-2%’ Charge InsideEVs", "provider": "Mon, 14 Jul 2025 02:27:26 GMT"}, "37": {"title": "Tesla’s rule-breaking board expressing ‘almost a contempt for lawful and accepted procedure’, says governance expert - Fortune", "summary": "Tesla’s rule-breaking board expressing ‘almost a contempt for lawful and accepted procedure’, says governance expert Fortune", "provider": "Fri, 11 Jul 2025 11:08:00 GMT"}, "38": {"title": "Tesla, EV buyers need to act now if they want $7,500 tax credit - Yahoo Finance", "summary": "Tesla, EV buyers need to act now if they want $7,500 tax credit Yahoo Finance", "provider": "Sat, 12 Jul 2025 11:55:57 GMT"}, "39": {"title": "Tesla has not yet applied for robotaxi permits in California, state regulators say - Reuters", "summary": "Tesla has not yet applied for robotaxi permits in California, state regulators say Reuters", "provider": "Fri, 11 Jul 2025 00:22:00 GMT"}, "40": {"title": "Tesla to hold annual shareholder meeting in November as investor scrutiny mounts - Reuters", "summary": "Tesla to hold annual shareholder meeting in November as investor scrutiny mounts Reuters", "provider": "Thu, 10 Jul 2025 20:59:35 GMT"}, "41": {"title": "Grok AI to be available in Tesla vehicles next week, Musk says - Reuters", "summary": "Grok AI to be available in Tesla vehicles next week, Musk says Reuters", "provider": "Thu, 10 Jul 2025 10:31:17 GMT"}, "42": {"title": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says - Reuters", "summary": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says Reuters", "provider": "Fri, 11 Jul 2025 03:49:00 GMT"}, "43": {"title": "Elon Musk’s Tesla finally sets a shareholder meeting date amid doubts about his long-denied $56 billion pay package - Fortune", "summary": "Elon Musk’s Tesla finally sets a shareholder meeting date amid doubts about his long-denied $56 billion pay package Fortune", "provider": "Thu, 10 Jul 2025 19:07:00 GMT"}, "44": {"title": "Tesla introduces new subscription service with major benefits: 'This is a huge jump up in customer protection' - The Cool Down", "summary": "Tesla introduces new subscription service with major benefits: 'This is a huge jump up in customer protection' The Cool Down", "provider": "Sat, 05 Jul 2025 07:00:00 GMT"}, "45": {"title": "This Could Save Tesla - Will Lockett – Medium", "summary": "This Could Save Tesla Will Lockett – Medium", "provider": "Wed, 09 Jul 2025 12:07:35 GMT"}, "46": {"title": "Elon Musk Says Grok Is Coming to Tesla EVs - WIRED", "summary": "Elon Musk Says Grok Is Coming to Tesla EVs WIRED", "provider": "Thu, 10 Jul 2025 13:48:42 GMT"}, "47": {"title": "Grok is coming to Tesla vehicles ‘next week,’ says Elon Musk - TechCrunch", "summary": "Grok is coming to Tesla vehicles ‘next week,’ says Elon Musk TechCrunch", "provider": "Thu, 10 Jul 2025 14:22:24 GMT"}, "48": {"title": "Tesla slashes prices in Canada despite tariffs as sales basically go to 0 - Electrek", "summary": "Tesla slashes prices in Canada despite tariffs as sales basically go to 0 Electrek", "provider": "Fri, 11 Jul 2025 13:14:00 GMT"}, "49": {"title": "Tesla Is Days Away From Violating a Texas Law. What’s Going On? - The New York Times", "summary": "Tesla Is Days Away From Violating a Texas Law. What’s Going On? The New York Times", "provider": "Wed, 09 Jul 2025 11:00:05 GMT"}, "50": {"title": "Billionaire Dan Loeb of Third Point Sold His Entire Stake in Tesla in Favor of a Stock That's Climbed More Than 420,000% Since Its IPO - The Motley Fool", "summary": "Billionaire Dan Loeb of Third Point Sold His Entire Stake in Tesla in Favor of a Stock That's Climbed More Than 420,000% Since Its IPO The Motley Fool", "provider": "Fri, 11 Jul 2025 07:06:00 GMT"}, "51": {"title": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says - Fox Business", "summary": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says Fox Business", "provider": "Thu, 10 Jul 2025 20:42:00 GMT"}, "52": {"title": "Tesla Stock Is Down This Month But Elon Musk Just Said Robotaxi Expansion Is Coming - Investor's Business Daily", "summary": "Tesla Stock Is Down This Month But Elon Musk Just Said Robotaxi Expansion Is Coming Investor's Business Daily", "provider": "Thu, 10 Jul 2025 20:06:00 GMT"}, "53": {"title": "Tesla - finally - announces when it will face its shareholders - CNN", "summary": "Tesla - finally - announces when it will face its shareholders CNN", "provider": "Thu, 10 Jul 2025 17:35:00 GMT"}, "54": {"title": "Tesla sales soar in Norway with new Model Y leading the charge - Teslarati", "summary": "Tesla sales soar in Norway with new Model Y leading the charge Teslarati", "provider": "Fri, 11 Jul 2025 16:39:07 GMT"}, "55": {"title": "Grok coming to Tesla vehicles 'next week at the latest,' Musk says - USA Today", "summary": "Grok coming to Tesla vehicles 'next week at the latest,' Musk says USA Today", "provider": "Thu, 10 Jul 2025 18:31:51 GMT"}, "56": {"title": "He Bought a Tesla Model 3 in June and Is Now Trying To Sell, Has a Good Reason for It - autoevolution", "summary": "He Bought a Tesla Model 3 in June and Is Now Trying To Sell, Has a Good Reason for It autoevolution", "provider": "Sat, 12 Jul 2025 21:01:43 GMT"}, "57": {"title": "Tesla moves to expand Robotaxi to Phoenix, following rival Waymo - CNBC", "summary": "Tesla moves to expand Robotaxi to Phoenix, following rival Waymo CNBC", "provider": "Thu, 10 Jul 2025 21:16:22 GMT"}, "58": {"title": "Tesla sold precisely zero cars in Turkey in January—now it’s Elon Musk’s hottest market. Here’s why - Fortune", "summary": "Tesla sold precisely zero cars in Turkey in January—now it’s Elon Musk’s hottest market. Here’s why Fortune", "provider": "Tue, 08 Jul 2025 14:49:00 GMT"}, "59": {"title": "Tesla to expand robotaxis to San Francisco area within two months, Musk says - Reuters", "summary": "Tesla to expand robotaxis to San Francisco area within two months, Musk says Reuters", "provider": "Thu, 10 Jul 2025 04:35:00 GMT"}}, "UnitedHealth Group Incorporated": {"0": {"title": "Taking on Goliath: Brain surgeon's clash with UnitedHealthcare shows insurer's hardball tactics - NBC News", "summary": "Taking on Goliath: Brain surgeon's clash with UnitedHealthcare shows insurer's hardball tactics NBC News", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "1": {"title": "UnitedHealth Group Incorporated (UNH): \"Medicare Fraud Is Prison,\" Warns Jim Cramer - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH): \"Medicare Fraud Is Prison,\" Warns Jim Cramer Yahoo Finance", "provider": "Sat, 12 Jul 2025 18:43:21 GMT"}, "2": {"title": "UnitedHealth names new Medicaid CEO as part of executive reshuffle - Bloomberg - Investing.com", "summary": "UnitedHealth names new Medicaid CEO as part of executive reshuffle - Bloomberg Investing.com", "provider": "Wed, 09 Jul 2025 21:21:45 GMT"}, "3": {"title": "UnitedHealth Names New Medicaid CEO in Latest Executive Move - Bloomberg", "summary": "UnitedHealth Names New Medicaid CEO in Latest Executive Move Bloomberg", "provider": "Wed, 09 Jul 2025 19:58:35 GMT"}, "4": {"title": "UnitedHealth appoints new CEO to run health services division - Reuters", "summary": "UnitedHealth appoints new CEO to run health services division Reuters", "provider": "Thu, 26 Jun 2025 07:00:00 GMT"}, "5": {"title": "UnitedHealth names new leader of Medicaid unit - report - Seeking Alpha", "summary": "UnitedHealth names new leader of Medicaid unit - report Seeking Alpha", "provider": "Wed, 09 Jul 2025 20:24:00 GMT"}, "6": {"title": "UnitedHealth names new chief of government programs, Medicaid unit - Healthcare Dive", "summary": "UnitedHealth names new chief of government programs, Medicaid unit Healthcare Dive", "provider": "Thu, 10 Jul 2025 14:56:26 GMT"}, "7": {"title": "UnitedHealth’s Campaign to Quiet Critics - The New York Times", "summary": "UnitedHealth’s Campaign to Quiet Critics The New York Times", "provider": "Sat, 12 Jul 2025 09:00:51 GMT"}, "8": {"title": "Exclusive | Prosecutors Question Doctors About UnitedHealth’s Medicare Billing Practices - WSJ - The Wall Street Journal", "summary": "Exclusive | Prosecutors Question Doctors About UnitedHealth’s Medicare Billing Practices - WSJ The Wall Street Journal", "provider": "Wed, 09 Jul 2025 14:00:00 GMT"}, "9": {"title": "3 Reasons Warren Buffett Might Buy UnitedHealth Group Stock - The Motley Fool", "summary": "3 Reasons Warren Buffett Might Buy UnitedHealth Group Stock The Motley Fool", "provider": "Thu, 26 Jun 2025 07:00:00 GMT"}, "10": {"title": "UnitedHealth Group's Q2 2025 Earnings: What To Expect - Barchart.com", "summary": "UnitedHealth Group's Q2 2025 Earnings: What To Expect Barchart.com", "provider": "Tue, 08 Jul 2025 07:12:31 GMT"}, "11": {"title": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:00:02 GMT"}, "12": {"title": "UnitedHealth: Pivotal Changes Underway (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth: Pivotal Changes Underway (NYSE:UNH) Seeking Alpha", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "13": {"title": "UnitedHealth Group's Q2 2025 Earnings: What to Expect - MSN", "summary": "UnitedHealth Group's Q2 2025 Earnings: What to Expect MSN", "provider": "Tue, 08 Jul 2025 07:40:10 GMT"}, "14": {"title": "Is UnitedHealth (UNH) a Buy as Wall Street Analysts Look Optimistic? - Yahoo Finance", "summary": "Is UnitedHealth (UNH) a Buy as Wall Street Analysts Look Optimistic? Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:30:03 GMT"}, "15": {"title": "Why The Market Is Wrong About UnitedHealth Group (NYSE:UNH) - Seeking Alpha", "summary": "Why The Market Is Wrong About UnitedHealth Group (NYSE:UNH) Seeking Alpha", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "16": {"title": "Watch the Surge of Insider Buying at UnitedHealth Group - Yahoo Finance", "summary": "Watch the Surge of Insider Buying at UnitedHealth Group Yahoo Finance", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "17": {"title": "UnitedHealth’s Q2 Could Get Messy: Will July 29 Bring Answers? (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth’s Q2 Could Get Messy: Will July 29 Bring Answers? (NYSE:UNH) Seeking Alpha", "provider": "Thu, 10 Jul 2025 13:15:00 GMT"}, "18": {"title": "UnitedHealth's Rebound: Hidden Strength or Hiding Weakness? - Yahoo Finance", "summary": "UnitedHealth's Rebound: Hidden Strength or Hiding Weakness? Yahoo Finance", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "19": {"title": "UnitedHealth Group (UNH) Advances While Market Declines: Some Information for Investors - Yahoo Finance", "summary": "UnitedHealth Group (UNH) Advances While Market Declines: Some Information for Investors Yahoo Finance", "provider": "Tue, 08 Jul 2025 21:50:06 GMT"}, "20": {"title": "New UnitedHealth CEO Shakes Up Management at Major Division - Bloomberg", "summary": "New UnitedHealth CEO Shakes Up Management at Major Division Bloomberg", "provider": "Thu, 26 Jun 2025 07:00:00 GMT"}, "21": {"title": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers | US Medicare - The Guardian", "summary": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers | US Medicare The Guardian", "provider": "Wed, 21 May 2025 07:00:00 GMT"}, "22": {"title": "Exclusive | UnitedHealth Group Is Under Criminal Investigation for Possible Medicare Fraud - WSJ - The Wall Street Journal", "summary": "Exclusive | UnitedHealth Group Is Under Criminal Investigation for Possible Medicare Fraud - WSJ The Wall Street Journal", "provider": "Thu, 15 May 2025 07:00:00 GMT"}, "23": {"title": "UnitedHealth Stock: Margins Are Under Pressure From All Sides (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth Stock: Margins Are Under Pressure From All Sides (NYSE:UNH) Seeking Alpha", "provider": "Sun, 22 Jun 2025 07:00:00 GMT"}, "24": {"title": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Fri, 13 Jun 2025 07:00:00 GMT"}, "25": {"title": "UnitedHealth Hits Reset: New Head Of Medicaid Appointed As CEO Reshapes Team - Benzinga", "summary": "UnitedHealth Hits Reset: New Head Of Medicaid Appointed As CEO Reshapes Team Benzinga", "provider": "Thu, 10 Jul 2025 20:22:09 GMT"}, "26": {"title": "Several Headwinds Pulled Down UnitedHealth Group’s (UNH) in Q2 - Yahoo Finance", "summary": "Several Headwinds Pulled Down UnitedHealth Group’s (UNH) in Q2 Yahoo Finance", "provider": "Mon, 07 Jul 2025 11:19:27 GMT"}, "27": {"title": "DOJ Interviewing Doctors in UnitedHealth Medicare Advantage Probe, Report Says - Investopedia", "summary": "DOJ Interviewing Doctors in UnitedHealth Medicare Advantage Probe, Report Says Investopedia", "provider": "Wed, 09 Jul 2025 15:10:33 GMT"}, "28": {"title": "UnitedHealth Group Incorporated (UNH) Faces Mounting Backlash Amid Billing Disputes, CEO Resignation, and Criminal Probe - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) Faces Mounting Backlash Amid Billing Disputes, CEO Resignation, and Criminal Probe Yahoo Finance", "provider": "Thu, 22 May 2025 07:00:00 GMT"}, "29": {"title": "Is United Health Stock a Buy, Hold or Sell for July 2025? - Yahoo Finance", "summary": "Is United Health Stock a Buy, Hold or Sell for July 2025? Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "30": {"title": "UnitedHealth mandates 4-day office return for hybrid workers in Minnesota and D.C. - The Business Journals", "summary": "UnitedHealth mandates 4-day office return for hybrid workers in Minnesota and D.C. The Business Journals", "provider": "Tue, 24 Jun 2025 07:00:00 GMT"}, "31": {"title": "UnitedHealth names new CEO for Optum Health (UNH:NYSE) - Seeking Alpha", "summary": "UnitedHealth names new CEO for Optum Health (UNH:NYSE) Seeking Alpha", "provider": "Fri, 27 Jun 2025 07:00:00 GMT"}, "32": {"title": "UnitedHealth Group Is In Chaos (UNH) - Seeking Alpha", "summary": "UnitedHealth Group Is In Chaos (UNH) Seeking Alpha", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "33": {"title": "Bragar Eagel & Squire, P.C. Reminds Investors That Class - GlobeNewswire", "summary": "Bragar Eagel & Squire, P.C. Reminds Investors That Class GlobeNewswire", "provider": "Sat, 12 Jul 2025 19:27:10 GMT"}, "34": {"title": "One of America’s biggest companies is imploding - CNN", "summary": "One of America’s biggest companies is imploding CNN", "provider": "Thu, 15 May 2025 07:00:00 GMT"}, "35": {"title": "DOJ questions former UnitedHealth staff on Medicare billing practices - report (UNH:NYSE) - Seeking Alpha", "summary": "DOJ questions former UnitedHealth staff on Medicare billing practices - report (UNH:NYSE) Seeking Alpha", "provider": "Wed, 09 Jul 2025 12:34:00 GMT"}, "36": {"title": "What UnitedHealth Can Do to Revive Its Battered Stock - The Wall Street Journal", "summary": "What UnitedHealth Can Do to Revive Its Battered Stock The Wall Street Journal", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "37": {"title": "Kaskela Law LLC Announces Investigation of UnitedHealth Group Inc. (NYSE: UNH) on Behalf of Long-Term UNH - EIN News", "summary": "Kaskela Law LLC Announces Investigation of UnitedHealth Group Inc. (NYSE: UNH) on Behalf of Long-Term UNH EIN News", "provider": "Wed, 09 Jul 2025 17:33:00 GMT"}, "38": {"title": "Is UnitedHealth Group Incorporated (UNH) One of the Best Falling Stocks to Buy According to Analysts? - Yahoo Finance", "summary": "Is UnitedHealth Group Incorporated (UNH) One of the Best Falling Stocks to Buy According to Analysts? Yahoo Finance", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "39": {"title": "Wolfe Adjusts Price Target on UnitedHealth Group to $330 From $363, Maintains Outperform Rating - MarketScreener", "summary": "Wolfe Adjusts Price Target on UnitedHealth Group to $330 From $363, Maintains Outperform Rating MarketScreener", "provider": "Thu, 10 Jul 2025 10:02:53 GMT"}, "40": {"title": "UnitedHealth: Poised For A Rebound (NYSE:UNH) - Seeking Alpha", "summary": "UnitedHealth: Poised For A Rebound (NYSE:UNH) Seeking Alpha", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "41": {"title": "UnitedHealth Group (UNH) Rises Higher Than Market: Key Facts - Yahoo Finance", "summary": "UnitedHealth Group (UNH) Rises Higher Than Market: Key Facts Yahoo Finance", "provider": "Tue, 24 Jun 2025 07:00:00 GMT"}, "42": {"title": "Why UnitedHealth Group Incorporated (UNH) Declined on Tuesday - Yahoo Finance", "summary": "Why UnitedHealth Group Incorporated (UNH) Declined on Tuesday Yahoo Finance", "provider": "Wed, 14 May 2025 07:00:00 GMT"}, "43": {"title": "UnitedHealth Group CEO steps down as company lowers, then withdraws financial outlook for 2025 - AP News", "summary": "UnitedHealth Group CEO steps down as company lowers, then withdraws financial outlook for 2025 AP News", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "44": {"title": "DOJ questions ex-UnitedHealth doctors in probe into Medicare fraud: report - New York Post", "summary": "DOJ questions ex-UnitedHealth doctors in probe into Medicare fraud: report New York Post", "provider": "Wed, 09 Jul 2025 18:15:00 GMT"}, "45": {"title": "UnitedHealth Stock: Should Investors Bet On A Rebound? - Forbes", "summary": "UnitedHealth Stock: Should Investors Bet On A Rebound? Forbes", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "46": {"title": "AM Best Assigns Issue Credit Ratings to UnitedHealth Group Incorporated’s New Senior Unsecured Notes - Yahoo Finance", "summary": "AM Best Assigns Issue Credit Ratings to UnitedHealth Group Incorporated’s New Senior Unsecured Notes Yahoo Finance", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "47": {"title": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) is Attracting Investor Attention: Here is What You Should Know Yahoo Finance", "provider": "Thu, 22 May 2025 07:00:00 GMT"}, "48": {"title": "Two Healthcare Heavyweights, One Winner: UnitedHealth or CVS Health? - Yahoo Finance", "summary": "Two Healthcare Heavyweights, One Winner: UnitedHealth or CVS Health? Yahoo Finance", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "49": {"title": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Thu, 08 May 2025 07:00:00 GMT"}, "50": {"title": "UnitedHealth CEO steps down as insurer suspends its financial outlook - Fortune", "summary": "UnitedHealth CEO steps down as insurer suspends its financial outlook Fortune", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "51": {"title": "Internal document shows how UnitedHealth executives prepared to tamp down investor unrest - STAT", "summary": "Internal document shows how UnitedHealth executives prepared to tamp down investor unrest STAT", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "52": {"title": "Lobbying Update: $30,000 of UNITEDHEALTH GROUP lobbying was just disclosed - Nasdaq", "summary": "Lobbying Update: $30,000 of UNITEDHEALTH GROUP lobbying was just disclosed Nasdaq", "provider": "Tue, 08 Jul 2025 14:02:00 GMT"}, "53": {"title": "Billing or Healing? UnitedHealth's HouseCalls Get a DOJ Checkup - TradingView", "summary": "Billing or Healing? UnitedHealth's HouseCalls Get a DOJ Checkup TradingView", "provider": "Thu, 10 Jul 2025 13:45:00 GMT"}, "54": {"title": "UnitedHealth’s accidental email attachment, and hospitals’ hunt for ‘additional volume’ - STAT", "summary": "UnitedHealth’s accidental email attachment, and hospitals’ hunt for ‘additional volume’ STAT", "provider": "Mon, 09 Jun 2025 07:00:00 GMT"}, "55": {"title": "UnitedHealth (UNH) PT Trimmed to $385 at UBS - Yahoo Finance", "summary": "UnitedHealth (UNH) PT Trimmed to $385 at UBS Yahoo Finance", "provider": "Wed, 09 Jul 2025 14:25:39 GMT"}, "56": {"title": "UnitedHealth Declines 40.4% YTD: Here's Why it's Still Not a Bargain - Yahoo Finance", "summary": "UnitedHealth Declines 40.4% YTD: Here's Why it's Still Not a Bargain Yahoo Finance", "provider": "Mon, 02 Jun 2025 07:00:00 GMT"}, "57": {"title": "UnitedHealth: Cutting Fair Value Estimate as Medicare Advantage and Other Practices Questioned - Morningstar", "summary": "UnitedHealth: Cutting Fair Value Estimate as Medicare Advantage and Other Practices Questioned Morningstar", "provider": "Thu, 22 May 2025 07:00:00 GMT"}, "58": {"title": "UnitedHealth Group Incorporated (UNH): Among Billionaire Israel Englander’s Stock Picks with Huge Upside Potential - Yahoo Finance", "summary": "UnitedHealth Group Incorporated (UNH): Among Billionaire Israel Englander’s Stock Picks with Huge Upside Potential Yahoo Finance", "provider": "Tue, 29 Apr 2025 07:00:00 GMT"}, "59": {"title": "UnitedHealth cuts 2025 forecast after dealing with first-quarter care use spike - AP News", "summary": "UnitedHealth cuts 2025 forecast after dealing with first-quarter care use spike AP News", "provider": "Thu, 17 Apr 2025 07:00:00 GMT"}}, "The Procter & Gamble Company": {"0": {"title": "Procter & Gamble - AOL.com", "summary": "Procter & Gamble AOL.com", "provider": "Mon, 14 Jul 2025 04:39:49 GMT"}, "1": {"title": "Procter & Gamble Company (The) (PG) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "Procter & Gamble Company (The) (PG) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:00:03 GMT"}, "2": {"title": "Cwm LLC Sells 6,908 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Cwm LLC Sells 6,908 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 11:51:31 GMT"}, "3": {"title": "Lobbying Update: $30,000 of PROCTER & GAMBLE COMPANY lobbying was just disclosed - Nasdaq", "summary": "Lobbying Update: $30,000 of PROCTER & GAMBLE COMPANY lobbying was just disclosed Nasdaq", "provider": "Fri, 11 Jul 2025 20:08:00 GMT"}, "4": {"title": "P&G Appoints Craig Arnold to Board of Directors - Procter & Gamble", "summary": "P&G Appoints Craig Arnold to Board of Directors Procter & Gamble", "provider": "Mon, 09 Jun 2025 07:00:00 GMT"}, "5": {"title": "Earnings Preview: What To Expect From Procter & Gamble's Report - Barchart.com", "summary": "Earnings Preview: What To Expect From Procter & Gamble's Report Barchart.com", "provider": "Wed, 09 Jul 2025 12:18:33 GMT"}, "6": {"title": "Revenue of Procter & Gamble (P&G) from 2012 to 2024 - Statista", "summary": "Revenue of Procter & Gamble (P&G) from 2012 to 2024 Statista", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "7": {"title": "LRI Investments LLC Sells 2,621 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "LRI Investments LLC Sells 2,621 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 12:37:49 GMT"}, "8": {"title": "Here is What to Know Beyond Why Procter & Gamble Company (The) (PG) is a Trending Stock - Yahoo Finance", "summary": "Here is What to Know Beyond Why Procter & Gamble Company (The) (PG) is a Trending Stock Yahoo Finance", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "9": {"title": "MQS Management LLC Takes $1.18 Million Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "MQS Management LLC Takes $1.18 Million Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 12:51:05 GMT"}, "10": {"title": "Westmount Partners LLC Sells 1,886 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Westmount Partners LLC Sells 1,886 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 10:41:13 GMT"}, "11": {"title": "Procter & Gamble Company (The) (NYSE:PG) Holdings Lifted by TFR Capital LLC. - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Holdings Lifted by TFR Capital LLC. MarketBeat", "provider": "Sun, 13 Jul 2025 11:43:28 GMT"}, "12": {"title": "TruNorth Capital Management LLC Purchases 1,803 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "TruNorth Capital Management LLC Purchases 1,803 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 10:53:12 GMT"}, "13": {"title": "Asset Dedication LLC Trims Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Asset Dedication LLC Trims Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 11:51:31 GMT"}, "14": {"title": "Mutual of America Capital Management LLC Reduces Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Mutual of America Capital Management LLC Reduces Stock Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sun, 13 Jul 2025 09:53:40 GMT"}, "15": {"title": "Lane & Associates LLC Acquires 3,395 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Lane & Associates LLC Acquires 3,395 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sat, 12 Jul 2025 11:34:59 GMT"}, "16": {"title": "Procter & Gamble Company (The) (NYSE:PG) Position Boosted by Stillwater Wealth Management Group - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Position Boosted by Stillwater Wealth Management Group MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "17": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Purchased by Arizona State Retirement System - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Purchased by Arizona State Retirement System MarketBeat", "provider": "Sat, 12 Jul 2025 13:16:49 GMT"}, "18": {"title": "Northwest Capital Management Inc Sells 7,507 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Northwest Capital Management Inc Sells 7,507 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "19": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by IFC Advisors LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by IFC Advisors LLC MarketBeat", "provider": "Sat, 12 Jul 2025 11:36:56 GMT"}, "20": {"title": "The Procter & Gamble Company Declares Quarterly Dividend on Common Stock, Payable or after August 15, 2025 - MarketScreener", "summary": "The Procter & Gamble Company Declares Quarterly Dividend on Common Stock, Payable or after August 15, 2025 MarketScreener", "provider": "Tue, 08 Jul 2025 21:05:21 GMT"}, "21": {"title": "Callahan Advisors LLC Raises Holdings in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Callahan Advisors LLC Raises Holdings in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Fri, 11 Jul 2025 13:37:35 GMT"}, "22": {"title": "The Procter & Gamble Company (PG): A Bull Case Theory - Yahoo Finance", "summary": "The Procter & Gamble Company (PG): A Bull Case Theory Yahoo Finance", "provider": "Fri, 06 Jun 2025 07:00:00 GMT"}, "23": {"title": "The Future of Collaboration: How AI is Supplementing Teamwork and Innovation at P&G - Procter & Gamble", "summary": "The Future of Collaboration: How AI is Supplementing Teamwork and Innovation at P&G Procter & Gamble", "provider": "Fri, 04 Apr 2025 07:00:00 GMT"}, "24": {"title": "Multi-Generational Families at P&G: The Legacy Continues - Procter & Gamble", "summary": "Multi-Generational Families at P&G: The Legacy Continues Procter & Gamble", "provider": "Thu, 10 Apr 2025 07:00:00 GMT"}, "25": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by SteelPeak Wealth LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by SteelPeak Wealth LLC MarketBeat", "provider": "Fri, 11 Jul 2025 12:37:25 GMT"}, "26": {"title": "Blue Square Asset Management LLC Decreases Stock Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Blue Square Asset Management LLC Decreases Stock Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Sat, 12 Jul 2025 10:36:09 GMT"}, "27": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by Main Street Research LLC - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Bought by Main Street Research LLC MarketBeat", "provider": "Wed, 09 Jul 2025 14:37:32 GMT"}, "28": {"title": "Newsroom | P&G - Procter & Gamble", "summary": "Newsroom | P&G Procter & Gamble", "provider": "Wed, 11 Dec 2024 14:37:29 GMT"}, "29": {"title": "Procter & Gamble to cut 7,000 jobs to invest in new growth initiatives - WCPO 9 Cincinnati", "summary": "Procter & Gamble to cut 7,000 jobs to invest in new growth initiatives WCPO 9 Cincinnati", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "30": {"title": "Jim Cramer Says The Procter & Gamble Company (PG) May Blow Numbers Away - Yahoo Finance", "summary": "Jim Cramer Says The Procter & Gamble Company (PG) May Blow Numbers Away Yahoo Finance", "provider": "Mon, 21 Apr 2025 07:00:00 GMT"}, "31": {"title": "The Procter & Gamble Company (PG) Is Expected to Cut 7,000 Jobs Over the Next 2 Years - Insider Monkey", "summary": "The Procter & Gamble Company (PG) Is Expected to Cut 7,000 Jobs Over the Next 2 Years Insider Monkey", "provider": "Sun, 06 Jul 2025 07:41:49 GMT"}, "32": {"title": "Dividend Roundup: CVS Health, Procter & Gamble, AbbVie, Colgate-Palmolive, and more (PG:NYSE) - Seeking Alpha", "summary": "Dividend Roundup: CVS Health, Procter & Gamble, AbbVie, Colgate-Palmolive, and more (PG:NYSE) Seeking Alpha", "provider": "Fri, 11 Jul 2025 12:17:00 GMT"}, "33": {"title": "P&G’s North America Logistics Summit Honors Top Carriers and Suppliers - Procter & Gamble", "summary": "P&G’s North America Logistics Summit Honors Top Carriers and Suppliers Procter & Gamble", "provider": "Mon, 26 May 2025 07:00:00 GMT"}, "34": {"title": "Procter & Gamble Health Ltd Falls 2.2% - Business Standard", "summary": "Procter & Gamble Health Ltd Falls 2.2% Business Standard", "provider": "Mon, 14 Jul 2025 04:00:00 GMT"}, "35": {"title": "Financial Gravity Asset Management Inc. Purchases New Stake in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Financial Gravity Asset Management Inc. Purchases New Stake in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Thu, 10 Jul 2025 13:45:33 GMT"}, "36": {"title": "Stegent Equity Advisors Inc. Lowers Stock Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Stegent Equity Advisors Inc. Lowers Stock Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Fri, 11 Jul 2025 12:26:25 GMT"}, "37": {"title": "Newsroom Multimedia - Images | P&G - Procter & Gamble", "summary": "Newsroom Multimedia - Images | P&G Procter & Gamble", "provider": "Wed, 18 Dec 2024 18:27:43 GMT"}, "38": {"title": "EPA and The Procter & Gamble Company - U.S. Environmental Protection Agency (.gov)", "summary": "EPA and The Procter & Gamble Company U.S. Environmental Protection Agency (.gov)", "provider": "Mon, 05 May 2025 07:00:00 GMT"}, "39": {"title": "P&G's Awards and Recognitions: Shaping Careers, Inclusion and Consumer Impact - Procter & Gamble", "summary": "P&G's Awards and Recognitions: Shaping Careers, Inclusion and Consumer Impact Procter & Gamble", "provider": "Tue, 11 Feb 2025 08:00:00 GMT"}, "40": {"title": "Greenleaf Trust Sells 1,735 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Greenleaf Trust Sells 1,735 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Wed, 09 Jul 2025 12:22:14 GMT"}, "41": {"title": "Quotient Wealth Partners LLC Sells 1,987 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Quotient Wealth Partners LLC Sells 1,987 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Wed, 09 Jul 2025 14:37:32 GMT"}, "42": {"title": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by Yacktman Asset Management LP - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Shares Sold by Yacktman Asset Management LP MarketBeat", "provider": "Wed, 09 Jul 2025 12:22:14 GMT"}, "43": {"title": "Procter & Gamble Company (The) (NYSE:PG) Stock Position Reduced by Flossbach Von Storch SE - MarketBeat", "summary": "Procter & Gamble Company (The) (NYSE:PG) Stock Position Reduced by Flossbach Von Storch SE MarketBeat", "provider": "Wed, 09 Jul 2025 12:22:14 GMT"}, "44": {"title": "Procter & Gamble CEO warns tariff uncertainty to continue - Yahoo Finance", "summary": "Procter & Gamble CEO warns tariff uncertainty to continue Yahoo Finance", "provider": "Thu, 24 Apr 2025 07:00:00 GMT"}, "45": {"title": "Procter & Gamble Vs Unilever: Who Holds the Power in the FMCG Race? - Yahoo Finance", "summary": "Procter & Gamble Vs Unilever: Who Holds the Power in the FMCG Race? Yahoo Finance", "provider": "Wed, 28 May 2025 07:00:00 GMT"}, "46": {"title": "Procter & Gamble announces layoffs, but no indication Wyoming County plant will be affected - Scranton Times-Tribune", "summary": "Procter & Gamble announces layoffs, but no indication Wyoming County plant will be affected Scranton Times-Tribune", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "47": {"title": "Procter & Gamble Vs Colgate: Which is a Smarter Stock to Own Now? - Yahoo Finance", "summary": "Procter & Gamble Vs Colgate: Which is a Smarter Stock to Own Now? Yahoo Finance", "provider": "Thu, 01 May 2025 07:00:00 GMT"}, "48": {"title": "Procter & Gamble CEO says price hikes are 'likely,' as Tide owner cuts outlook due to tariffs, uncertainty - CNBC", "summary": "Procter & Gamble CEO says price hikes are 'likely,' as Tide owner cuts outlook due to tariffs, uncertainty CNBC", "provider": "Thu, 24 Apr 2025 07:00:00 GMT"}, "49": {"title": "Nisa Investment Advisors LLC Lowers Position in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Nisa Investment Advisors LLC Lowers Position in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Wed, 09 Jul 2025 14:21:13 GMT"}, "50": {"title": "Brown Advisory Inc. Sells 3,378 Shares of Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "Brown Advisory Inc. Sells 3,378 Shares of Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Tue, 08 Jul 2025 11:46:30 GMT"}, "51": {"title": "Procter & Gamble Slips Below 50-Day SMA: Time to Buy or Exit? - Yahoo Finance", "summary": "Procter & Gamble Slips Below 50-Day SMA: Time to Buy or Exit? Yahoo Finance", "provider": "Wed, 11 Jun 2025 07:00:00 GMT"}, "52": {"title": "Pampers maker Procter & Gamble to cut up to 7,000 jobs as companies are buffeted by higher costs - AP News", "summary": "Pampers maker Procter & Gamble to cut up to 7,000 jobs as companies are buffeted by higher costs AP News", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "53": {"title": "QRG Capital Management Inc. Boosts Stake in Procter & Gamble Company (The) (NYSE:PG) - MarketBeat", "summary": "QRG Capital Management Inc. Boosts Stake in Procter & Gamble Company (The) (NYSE:PG) MarketBeat", "provider": "Thu, 19 Jun 2025 07:00:00 GMT"}, "54": {"title": "Procter & Gamble to cut 7,000 jobs over two years - FOX19 | Cincinnati", "summary": "Procter & Gamble to cut 7,000 jobs over two years FOX19 | Cincinnati", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "55": {"title": "Celebrating 15 Years of Partnership: P&G and WWF for a Sustainable Future - Procter & Gamble", "summary": "Celebrating 15 Years of Partnership: P&G and WWF for a Sustainable Future Procter & Gamble", "provider": "Wed, 23 Apr 2025 07:00:00 GMT"}, "56": {"title": "Tariffs stall P&G supply chain strategy - Supply Chain Dive", "summary": "Tariffs stall P&G supply chain strategy Supply Chain Dive", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "57": {"title": "A Century of Curiosity: P&G Analytics & Insights Discovering the Future | P&G - Procter & Gamble", "summary": "A Century of Curiosity: P&G Analytics & Insights Discovering the Future | P&G Procter & Gamble", "provider": "Fri, 13 Dec 2024 08:00:00 GMT"}, "58": {"title": "Procter & Gamble's Valuation Looks Pricey: Time to Buy, Hold or Sell? - Yahoo Finance", "summary": "Procter & Gamble's Valuation Looks Pricey: Time to Buy, Hold or Sell? Yahoo Finance", "provider": "Mon, 07 Apr 2025 07:00:00 GMT"}, "59": {"title": "Procter & Gamble Maintains Outperform Rating Amid Organizational Restructuring - Yahoo Finance", "summary": "Procter & Gamble Maintains Outperform Rating Amid Organizational Restructuring Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}}, "Lucid Group, Inc.": {"0": {"title": "Is Lucid Group a Millionaire-Maker Stock? - Yahoo Finance", "summary": "Is Lucid Group a Millionaire-Maker Stock? Yahoo Finance", "provider": "Sun, 13 Jul 2025 12:45:00 GMT"}, "1": {"title": "Lucid Announces Q2 Production & Deliveries, Sets Date for Second Quarter 2025 Results - Lucid Motors", "summary": "Lucid Announces Q2 Production & Deliveries, Sets Date for Second Quarter 2025 Results Lucid Motors", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "2": {"title": "Four Seasons Resort Orlando and Lucid Team Up to Offer Guests Sustainable Driving Experiences - Four Seasons Press Room", "summary": "Four Seasons Resort Orlando and Lucid Team Up to Offer Guests Sustainable Driving Experiences Four Seasons Press Room", "provider": "Fri, 11 Jul 2025 13:20:30 GMT"}, "3": {"title": "Lucid Group (LCID) Rises 9% After Bagging New World Record for Longest EV Journey in One Charge - MSN", "summary": "Lucid Group (LCID) Rises 9% After Bagging New World Record for Longest EV Journey in One Charge MSN", "provider": "Thu, 10 Jul 2025 12:27:52 GMT"}, "4": {"title": "Lucid Group, Inc. (NASDAQ:LCID) Receives Average Recommendation of \"Hold\" from Analysts - MarketBeat", "summary": "Lucid Group, Inc. (NASDAQ:LCID) Receives Average Recommendation of \"Hold\" from Analysts MarketBeat", "provider": "Sat, 12 Jul 2025 07:37:17 GMT"}, "5": {"title": "Prediction: Buying Lucid Group Stock Today Could Set You Up for Life - Yahoo Finance", "summary": "Prediction: Buying Lucid Group Stock Today Could Set You Up for Life Yahoo Finance", "provider": "Thu, 10 Jul 2025 14:00:00 GMT"}, "6": {"title": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS™ Title with 1,205 kilometers on a Single Charge - Lucid Motors", "summary": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS™ Title with 1,205 kilometers on a Single Charge Lucid Motors", "provider": "Tue, 08 Jul 2025 12:02:28 GMT"}, "7": {"title": "Lucid Group (NASDAQ:LCID) Stock Price Up 2% - What's Next? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Stock Price Up 2% - What's Next? MarketBeat", "provider": "Sun, 13 Jul 2025 00:13:24 GMT"}, "8": {"title": "Should You Buy Lucid Stock While It's Below $2.50? - Yahoo Finance", "summary": "Should You Buy Lucid Stock While It's Below $2.50? Yahoo Finance", "provider": "Sun, 13 Jul 2025 08:30:00 GMT"}, "9": {"title": "Lucid Announces First Quarter 2025 Financial Results - Lucid Motors", "summary": "Lucid Announces First Quarter 2025 Financial Results Lucid Motors", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "10": {"title": "Lucid Group (NASDAQ:LCID) Shares Up 5.5% - What's Next? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Shares Up 5.5% - What's Next? MarketBeat", "provider": "Fri, 11 Jul 2025 20:37:35 GMT"}, "11": {"title": "Prediction: Lucid Group Could Lose a $200 Million Revenue Source That Is Nearly 100% Profit - Yahoo Finance", "summary": "Prediction: Lucid Group Could Lose a $200 Million Revenue Source That Is Nearly 100% Profit Yahoo Finance", "provider": "Sat, 12 Jul 2025 08:43:00 GMT"}, "12": {"title": "Lucid Strengthens Leadership Team as Company Prepares for Growth - Lucid Motors", "summary": "Lucid Strengthens Leadership Team as Company Prepares for Growth Lucid Motors", "provider": "Tue, 06 May 2025 07:00:00 GMT"}, "13": {"title": "Investors Purchase High Volume of Call Options on Lucid Group (NASDAQ:LCID) - MarketBeat", "summary": "Investors Purchase High Volume of Call Options on Lucid Group (NASDAQ:LCID) MarketBeat", "provider": "Sat, 12 Jul 2025 07:00:00 GMT"}, "14": {"title": "Lucid Strengthens US Supply Chain with New Graphite Material Supply Agreement with Graphite One - Lucid Motors", "summary": "Lucid Strengthens US Supply Chain with New Graphite Material Supply Agreement with Graphite One Lucid Motors", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "15": {"title": "Lucid Group (LCID) Outperforms Broader Market: What You Need to Know - Yahoo Finance", "summary": "Lucid Group (LCID) Outperforms Broader Market: What You Need to Know Yahoo Finance", "provider": "Thu, 10 Jul 2025 22:15:02 GMT"}, "16": {"title": "Android Auto™ Compatibility Now Available to Lucid Air Owners - Lucid Motors", "summary": "Android Auto™ Compatibility Now Available to Lucid Air Owners Lucid Motors", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "17": {"title": "Lucid Group (LCID Stock) Sets New EV Standard: Highest Efficiency and 30% Lower Emissions - CarbonCredits.com", "summary": "Lucid Group (LCID Stock) Sets New EV Standard: Highest Efficiency and 30% Lower Emissions CarbonCredits.com", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "18": {"title": "Lucid Group Partners with Graphite One: Ushering a New Era in Domestic Graphite Supply Chain - StocksToTrade", "summary": "Lucid Group Partners with Graphite One: Ushering a New Era in Domestic Graphite Supply Chain StocksToTrade", "provider": "Tue, 08 Jul 2025 16:05:00 GMT"}, "19": {"title": "Where Will Lucid Group Be in 10 Years? - The Motley Fool", "summary": "Where Will Lucid Group Be in 10 Years? The Motley Fool", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "20": {"title": "Rivian, Lucid to Benefit From Trump Tax Bill, BNP Paribas Says - The Business Download |", "summary": "Rivian, Lucid to Benefit From Trump Tax Bill, BNP Paribas Says The Business Download |", "provider": "Sat, 12 Jul 2025 19:04:54 GMT"}, "21": {"title": "EV maker Lucid's quarterly deliveries rise but miss estimates - Reuters", "summary": "EV maker Lucid's quarterly deliveries rise but miss estimates Reuters", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "22": {"title": "Is Lucid Group Stock a Millionaire Maker? - The Motley Fool", "summary": "Is Lucid Group Stock a Millionaire Maker? The Motley Fool", "provider": "Wed, 04 Jun 2025 07:00:00 GMT"}, "23": {"title": "Lucid Announces CEO Transition - Lucid Motors", "summary": "Lucid Announces CEO Transition Lucid Motors", "provider": "Tue, 25 Feb 2025 08:00:00 GMT"}, "24": {"title": "Lucid Announces Fourth Quarter and Full Year 2024 Financial Results - Lucid Motors", "summary": "Lucid Announces Fourth Quarter and Full Year 2024 Financial Results Lucid Motors", "provider": "Tue, 25 Feb 2025 08:00:00 GMT"}, "25": {"title": "Vontobel Holding Ltd. Acquires 289,880 Shares of Lucid Group, Inc. (NASDAQ:LCID) - MarketBeat", "summary": "Vontobel Holding Ltd. Acquires 289,880 Shares of Lucid Group, Inc. (NASDAQ:LCID) MarketBeat", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "26": {"title": "Is Lucid Group (LCID) the High Growth EV Stock to Invest In? - Yahoo Finance", "summary": "Is Lucid Group (LCID) the High Growth EV Stock to Invest In? Yahoo Finance", "provider": "Mon, 12 May 2025 07:00:00 GMT"}, "27": {"title": "Lucid Group: Navigating EV Challenges - StocksToTrade", "summary": "Lucid Group: Navigating EV Challenges StocksToTrade", "provider": "Thu, 03 Jul 2025 20:04:00 GMT"}, "28": {"title": "Lucid EV Production Hits 3,863 Units in Q2 2025: Key Production Metrics and Earnings Date Revealed - Stock Titan", "summary": "Lucid EV Production Hits 3,863 Units in Q2 2025: Key Production Metrics and Earnings Date Revealed Stock Titan", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "29": {"title": "Is Lucid Group a Millionaire-Maker Stock? - Yahoo Finance", "summary": "Is Lucid Group a Millionaire-Maker Stock? Yahoo Finance", "provider": "Tue, 10 Jun 2025 07:00:00 GMT"}, "30": {"title": "Lucid Air Sets Electric Range Record - The EV Report", "summary": "Lucid Air Sets Electric Range Record The EV Report", "provider": "Wed, 09 Jul 2025 10:00:00 GMT"}, "31": {"title": "Lucid Air Shatters EV Range Record: 749-Mile Alpine Journey Crushes Previous Mark by 160km - Stock Titan", "summary": "Lucid Air Shatters EV Range Record: 749-Mile Alpine Journey Crushes Previous Mark by 160km Stock Titan", "provider": "Tue, 08 Jul 2025 12:00:00 GMT"}, "32": {"title": "Is Lucid Group, Inc. (LCID) the Best Low Priced Stock to Invest in For the Long Term? - Yahoo Finance", "summary": "Is Lucid Group, Inc. (LCID) the Best Low Priced Stock to Invest in For the Long Term? Yahoo Finance", "provider": "Fri, 09 May 2025 07:00:00 GMT"}, "33": {"title": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS Title for Longest Distance on a Single Charge | THE SHOP - theshopmag.com", "summary": "Lucid Air Grand Touring Wins GUINNESS WORLD RECORDS Title for Longest Distance on a Single Charge | THE SHOP theshopmag.com", "provider": "Tue, 08 Jul 2025 19:14:34 GMT"}, "34": {"title": "Lucid Opens New Jersey Studio, Service, and Delivery Center for Area Customers - Lucid Motors", "summary": "Lucid Opens New Jersey Studio, Service, and Delivery Center for Area Customers Lucid Motors", "provider": "Thu, 08 May 2025 07:00:00 GMT"}, "35": {"title": "All You Need to Know About Lucid Group (LCID) Rating Upgrade to Buy - Yahoo Finance", "summary": "All You Need to Know About Lucid Group (LCID) Rating Upgrade to Buy Yahoo Finance", "provider": "Tue, 17 Jun 2025 07:00:00 GMT"}, "36": {"title": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees - Lucid Motors", "summary": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees Lucid Motors", "provider": "Fri, 11 Apr 2025 07:00:00 GMT"}, "37": {"title": "Lucid Announces Election of Douglas Grimm to Board of Directors - Lucid Motors", "summary": "Lucid Announces Election of Douglas Grimm to Board of Directors Lucid Motors", "provider": "Thu, 05 Jun 2025 07:00:00 GMT"}, "38": {"title": "Lucid Group (LCID) Stock: Can New SUV Turn Around Struggling EV Maker? - CoinCentral", "summary": "Lucid Group (LCID) Stock: Can New SUV Turn Around Struggling EV Maker? CoinCentral", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "39": {"title": "Benchmark Reiterates Buy Rating on Lucid Group Inc. (LCID) - StreetInsider", "summary": "Benchmark Reiterates Buy Rating on Lucid Group Inc. (LCID) StreetInsider", "provider": "Thu, 10 Jul 2025 13:28:42 GMT"}, "40": {"title": "Lucid Group sees a strong jump in second quarter deliveries (LCID:NASDAQ) - Seeking Alpha", "summary": "Lucid Group sees a strong jump in second quarter deliveries (LCID:NASDAQ) Seeking Alpha", "provider": "Thu, 03 Jul 2025 12:31:00 GMT"}, "41": {"title": "Lucid Stock Soars: What’s Behind the Rise? - StocksToTrade", "summary": "Lucid Stock Soars: What’s Behind the Rise? StocksToTrade", "provider": "Tue, 01 Jul 2025 07:00:00 GMT"}, "42": {"title": "With Growth Poised to Explode, Is Lucid Stock Finally a Buy? - The Motley Fool", "summary": "With Growth Poised to Explode, Is Lucid Stock Finally a Buy? The Motley Fool", "provider": "Sun, 22 Jun 2025 07:00:00 GMT"}, "43": {"title": "Lucid May Need To Cut 2025 Guidance (NASDAQ:LCID) - Seeking Alpha", "summary": "Lucid May Need To Cut 2025 Guidance (NASDAQ:LCID) Seeking Alpha", "provider": "Tue, 08 Jul 2025 01:17:00 GMT"}, "44": {"title": "Lucid Group: Poised For Growth (Rating Upgrade) - Seeking Alpha", "summary": "Lucid Group: Poised For Growth (Rating Upgrade) Seeking Alpha", "provider": "Wed, 28 May 2025 07:00:00 GMT"}, "45": {"title": "Lucid Group (NASDAQ:LCID) Shares Down 1.9% - What's Next? - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Shares Down 1.9% - What's Next? MarketBeat", "provider": "Fri, 11 Jul 2025 17:26:29 GMT"}, "46": {"title": "Where Will Lucid Group Be in 3 Years? - The Motley Fool", "summary": "Where Will Lucid Group Be in 3 Years? The Motley Fool", "provider": "Sat, 17 May 2025 07:00:00 GMT"}, "47": {"title": "Why Lucid Group Stock Is Soaring Today - The Globe and Mail", "summary": "Why Lucid Group Stock Is Soaring Today The Globe and Mail", "provider": "Tue, 08 Jul 2025 18:19:45 GMT"}, "48": {"title": "Lucid Group Vehicle Deliveries Rise - The Wall Street Journal", "summary": "Lucid Group Vehicle Deliveries Rise The Wall Street Journal", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "49": {"title": "Lucid Group (NASDAQ:LCID) Trading Up 2.1% - Here's Why - MarketBeat", "summary": "Lucid Group (NASDAQ:LCID) Trading Up 2.1% - Here's Why MarketBeat", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "50": {"title": "Cantor Fitzgerald Sticks to Their Hold Rating for Lucid Group (LCID) - The Globe and Mail", "summary": "Cantor Fitzgerald Sticks to Their Hold Rating for Lucid Group (LCID) The Globe and Mail", "provider": "Tue, 08 Jul 2025 14:54:00 GMT"}, "51": {"title": "Lucid Group Inc. (LCID): Among EV Penny Stocks From $10 to Under $1 - Yahoo Finance", "summary": "Lucid Group Inc. (LCID): Among EV Penny Stocks From $10 to Under $1 Yahoo Finance", "provider": "Tue, 22 Apr 2025 07:00:00 GMT"}, "52": {"title": "2 Reasons Lucid Group Stock Is a Buy Before August - The Motley Fool", "summary": "2 Reasons Lucid Group Stock Is a Buy Before August The Motley Fool", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "53": {"title": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees - Lucid Motors", "summary": "Lucid to Acquire Select Facilities and Assets Previously Belonging to Nikola Corporation, Will Extend Offers to 300+ Former Nikola Employees Lucid Motors", "provider": "Fri, 11 Apr 2025 07:00:00 GMT"}, "54": {"title": "Introducing the 2026 Lucid Gravity Grand Touring: A Force of Attraction Like Nothing Else in Nature - Lucid Motors", "summary": "Introducing the 2026 Lucid Gravity Grand Touring: A Force of Attraction Like Nothing Else in Nature Lucid Motors", "provider": "Tue, 15 Apr 2025 07:00:00 GMT"}, "55": {"title": "Where Will Lucid Group Stock Be in 5 Years? - Yahoo Finance", "summary": "Where Will Lucid Group Stock Be in 5 Years? Yahoo Finance", "provider": "Tue, 01 Jul 2025 07:00:00 GMT"}, "56": {"title": "Lucid Announces Q4 Production & Deliveries, Sets Date for Fourth Quarter 2024 Results - Lucid Motors", "summary": "Lucid Announces Q4 Production & Deliveries, Sets Date for Fourth Quarter 2024 Results Lucid Motors", "provider": "Mon, 06 Jan 2025 08:00:00 GMT"}, "57": {"title": "Zacks Industry Outlook Highlights Rivian Automotive and Lucid - Yahoo Finance", "summary": "Zacks Industry Outlook Highlights Rivian Automotive and Lucid Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "58": {"title": "Lucid (NASDAQ: LCID) Stock Price Prediction and Forecast 2025-2030 (July 2025) - 24/7 Wall St.", "summary": "Lucid (NASDAQ: LCID) Stock Price Prediction and Forecast 2025-2030 (July 2025) 24/7 Wall St.", "provider": "Wed, 02 Jul 2025 07:00:00 GMT"}, "59": {"title": "Should You Buy Lucid Stock While It's Below $3? - Yahoo Finance", "summary": "Should You Buy Lucid Stock While It's Below $3? Yahoo Finance", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}}, "Corning Incorporated": {"0": {"title": "Corning Inc.’s community golf tournament surpasses $1 million mark in fundraising: Impact - Corning Leader", "summary": "Corning Inc.’s community golf tournament surpasses $1 million mark in fundraising: Impact Corning Leader", "provider": "Fri, 11 Jul 2025 16:51:02 GMT"}, "1": {"title": "Corning (NYSE:GLW) Will Pay A Dividend Of $0.28 - simplywall.st", "summary": "Corning (NYSE:GLW) Will Pay A Dividend Of $0.28 simplywall.st", "provider": "Sun, 13 Jul 2025 13:00:50 GMT"}, "2": {"title": "Crossmark Global Holdings Inc. Buys 4,513 Shares of Owens Corning Inc (NYSE:OC) - MarketBeat", "summary": "Crossmark Global Holdings Inc. Buys 4,513 Shares of Owens Corning Inc (NYSE:OC) MarketBeat", "provider": "Sun, 13 Jul 2025 20:52:07 GMT"}, "3": {"title": "Corning Inc. golf tournament passes $1 million raised for the United Way of the Southern Tier since it started - WENY", "summary": "Corning Inc. golf tournament passes $1 million raised for the United Way of the Southern Tier since it started WENY", "provider": "Fri, 11 Jul 2025 22:14:00 GMT"}, "4": {"title": "Owens Corning Inc (OC) is Attracting Investor Attention: Here is What You Should Know - Yahoo Finance", "summary": "Owens Corning Inc (OC) is Attracting Investor Attention: Here is What You Should Know Yahoo Finance", "provider": "Wed, 09 Jul 2025 13:00:10 GMT"}, "5": {"title": "Governor Hochul Announces Corning to Invest More Than $315 Million and Create up to 300 Jobs at Semiconductor Glass Manufacturing Facility in North Country - Empire State Development (ESD) (.gov)", "summary": "Governor Hochul Announces Corning to Invest More Than $315 Million and Create up to 300 Jobs at Semiconductor Glass Manufacturing Facility in North Country Empire State Development (ESD) (.gov)", "provider": "Fri, 17 Jan 2025 08:00:00 GMT"}, "6": {"title": "Corning Is Just Getting Started (NYSE:GLW) - Seeking Alpha", "summary": "Corning Is Just Getting Started (NYSE:GLW) Seeking Alpha", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "7": {"title": "Corning-Painted Post school district receives major grant, lowers proposed budget for revote - WSKG", "summary": "Corning-Painted Post school district receives major grant, lowers proposed budget for revote WSKG", "provider": "Tue, 03 Jun 2025 07:00:00 GMT"}, "8": {"title": "Corning retirees honored for decades of service - WETM", "summary": "Corning retirees honored for decades of service WETM", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "9": {"title": "Citigroup Adjusts Price Target on Corning to $60 From $52, Maintains Buy Rating - MarketScreener", "summary": "Citigroup Adjusts Price Target on Corning to $60 From $52, Maintains Buy Rating MarketScreener", "provider": "Fri, 11 Jul 2025 12:56:27 GMT"}, "10": {"title": "How exploring the unknown keeps the innovations coming - Nature", "summary": "How exploring the unknown keeps the innovations coming Nature", "provider": "Wed, 25 Jun 2025 13:45:12 GMT"}, "11": {"title": "Corning Glass plant in St. Lawrence County is laying off employees - NCPR: North Country Public Radio", "summary": "Corning Glass plant in St. Lawrence County is laying off employees NCPR: North Country Public Radio", "provider": "Tue, 01 Jul 2025 17:42:52 GMT"}, "12": {"title": "Was Jim Cramer Right About Corning Incorporated (GLW)? - Insider Monkey", "summary": "Was Jim Cramer Right About Corning Incorporated (GLW)? Insider Monkey", "provider": "Fri, 30 May 2025 07:00:00 GMT"}, "13": {"title": "Lbp Am Sa Sells 6,489 Shares of Owens Corning Inc (NYSE:OC) - MarketBeat", "summary": "Lbp Am Sa Sells 6,489 Shares of Owens Corning Inc (NYSE:OC) MarketBeat", "provider": "Sun, 13 Jul 2025 08:14:29 GMT"}, "14": {"title": "Corning Inc. Service Awards Luncheon honors retirees from 50, 75 years - WENY", "summary": "Corning Inc. Service Awards Luncheon honors retirees from 50, 75 years WENY", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "15": {"title": "Federal funds locked in for Corning Inc. expansion, supporting $315M Upstate NY project - Corning Leader", "summary": "Federal funds locked in for Corning Inc. expansion, supporting $315M Upstate NY project Corning Leader", "provider": "Thu, 16 Jan 2025 08:00:00 GMT"}, "16": {"title": "Corning Incorporated named one of America’s Best Large Employers by Forbes - WETM", "summary": "Corning Incorporated named one of America’s Best Large Employers by Forbes WETM", "provider": "Tue, 08 Apr 2025 07:00:00 GMT"}, "17": {"title": "Robeco Schweiz AG Reduces Position in Owens Corning Inc (NYSE:OC) - MarketBeat", "summary": "Robeco Schweiz AG Reduces Position in Owens Corning Inc (NYSE:OC) MarketBeat", "provider": "Fri, 11 Jul 2025 11:30:52 GMT"}, "18": {"title": "Corning-Painted Post revised 2025-26 school budget will go to vote June 17: What to know - Corning Leader", "summary": "Corning-Painted Post revised 2025-26 school budget will go to vote June 17: What to know Corning Leader", "provider": "Tue, 03 Jun 2025 07:00:00 GMT"}, "19": {"title": "D.A. Davidson & CO. Invests $462,000 in Owens Corning Inc (NYSE:OC) - MarketBeat", "summary": "D.A. Davidson & CO. Invests $462,000 in Owens Corning Inc (NYSE:OC) MarketBeat", "provider": "Fri, 11 Jul 2025 08:31:09 GMT"}, "20": {"title": "Corning Inc. CEO Wendell Weeks discusses the company's outlook, honors employees - Corning Leader", "summary": "Corning Inc. CEO Wendell Weeks discusses the company's outlook, honors employees Corning Leader", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "21": {"title": "Corning-Painted Post school board president resigns, community concerned with rising costs, cuts to student programs - WSKG", "summary": "Corning-Painted Post school board president resigns, community concerned with rising costs, cuts to student programs WSKG", "provider": "Fri, 16 May 2025 07:00:00 GMT"}, "22": {"title": "$32M Chips Award for Corning’s Canton plant to create 130 new, good-paying jobs - North Country Now", "summary": "$32M Chips Award for Corning’s Canton plant to create 130 new, good-paying jobs North Country Now", "provider": "Fri, 08 Nov 2024 08:00:00 GMT"}, "23": {"title": "'I have great pride': Retired Corning Inc. employees reflect on careers at Service Awards - Corning Leader", "summary": "'I have great pride': Retired Corning Inc. employees reflect on careers at Service Awards Corning Leader", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "24": {"title": "Corning Raises Investment to $1.5 Billion in Michigan - Manufacturing.net", "summary": "Corning Raises Investment to $1.5 Billion in Michigan Manufacturing.net", "provider": "Fri, 02 May 2025 07:00:00 GMT"}, "25": {"title": "PRP Real Estate Investment Management acquires Corning Hickory industrial facility - JLL", "summary": "PRP Real Estate Investment Management acquires Corning Hickory industrial facility JLL", "provider": "Tue, 20 May 2025 07:00:00 GMT"}, "26": {"title": "Corning increases investment in manufacturing facility to meet solar-component demand - WNEM", "summary": "Corning increases investment in manufacturing facility to meet solar-component demand WNEM", "provider": "Tue, 29 Apr 2025 07:00:00 GMT"}, "27": {"title": "Corning Reports Strong Fourth-Quarter and Full-Year 2024 Financial Results, - Business Wire", "summary": "Corning Reports Strong Fourth-Quarter and Full-Year 2024 Financial Results, Business Wire", "provider": "Wed, 29 Jan 2025 08:00:00 GMT"}, "28": {"title": "Corning Incorporated (NYSE:GLW) Q1 2025 Earnings Call Transcript - MSN", "summary": "Corning Incorporated (NYSE:GLW) Q1 2025 Earnings Call Transcript MSN", "provider": "Tue, 29 Apr 2025 07:00:00 GMT"}, "29": {"title": "Is Corning Incorporated (GLW) the Best Electronic Components Stock to Buy Now? - Yahoo Finance", "summary": "Is Corning Incorporated (GLW) the Best Electronic Components Stock to Buy Now? Yahoo Finance", "provider": "Sat, 19 Apr 2025 07:00:00 GMT"}, "30": {"title": "Corning Inc. Awards $1.8M Grant to C-PP after the proposed school budget was recently rejected by voters - WENY", "summary": "Corning Inc. Awards $1.8M Grant to C-PP after the proposed school budget was recently rejected by voters WENY", "provider": "Sat, 31 May 2025 07:00:00 GMT"}, "31": {"title": "Corning Inc. raising new $900 million facility in Michigan. What's next for project. - Corning Leader", "summary": "Corning Inc. raising new $900 million facility in Michigan. What's next for project. Corning Leader", "provider": "Fri, 14 Feb 2025 08:00:00 GMT"}, "32": {"title": "Corning Inc. to grow facility in St. Lawrence County, NY - WETM", "summary": "Corning Inc. to grow facility in St. Lawrence County, NY WETM", "provider": "Fri, 17 Jan 2025 08:00:00 GMT"}, "33": {"title": "Corning Collaborates with Broadcom To Accelerate AI Data Center Processing Capacity - Business Wire", "summary": "Corning Collaborates with Broadcom To Accelerate AI Data Center Processing Capacity Business Wire", "provider": "Tue, 13 May 2025 07:00:00 GMT"}, "34": {"title": "Is Corning Incorporated (GLW) the Best Diversified Dividend Stock to Buy Now? - Yahoo Finance", "summary": "Is Corning Incorporated (GLW) the Best Diversified Dividend Stock to Buy Now? Yahoo Finance", "provider": "Thu, 23 Jan 2025 08:00:00 GMT"}, "35": {"title": "Corning increases new investment to $1.5B, adds 400 more jobs - Midland Daily News", "summary": "Corning increases new investment to $1.5B, adds 400 more jobs Midland Daily News", "provider": "Mon, 05 May 2025 07:00:00 GMT"}, "36": {"title": "Owens Corning Inc (OC) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "Owens Corning Inc (OC) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "37": {"title": "Corning, Suniva and Heliene Announce First ‘Made in America’ Solar Module Supply Chain - Business Wire", "summary": "Corning, Suniva and Heliene Announce First ‘Made in America’ Solar Module Supply Chain Business Wire", "provider": "Thu, 06 Mar 2025 08:00:00 GMT"}, "38": {"title": "Corning Inc. Named to Forbes and Fortune Lists - WENY", "summary": "Corning Inc. Named to Forbes and Fortune Lists WENY", "provider": "Mon, 07 Apr 2025 07:00:00 GMT"}, "39": {"title": "Corning Inc. named one of America's Best Large Employers in 2025. See where it ranked. - Corning Leader", "summary": "Corning Inc. named one of America's Best Large Employers in 2025. See where it ranked. Corning Leader", "provider": "Wed, 12 Mar 2025 07:00:00 GMT"}, "40": {"title": "Fortune recognizes Corning Incorporated as one of America’s Most Innovative Companies - WBNG", "summary": "Fortune recognizes Corning Incorporated as one of America’s Most Innovative Companies WBNG", "provider": "Mon, 07 Apr 2025 07:00:00 GMT"}, "41": {"title": "Corning invests $315M to upgrade semiconductor glass manufacturing facility in New York - Plant Services", "summary": "Corning invests $315M to upgrade semiconductor glass manufacturing facility in New York Plant Services", "provider": "Thu, 20 Feb 2025 08:00:00 GMT"}, "42": {"title": "Corning sees second-quarter core sales above estimates as AI boom aids demand - Reuters", "summary": "Corning sees second-quarter core sales above estimates as AI boom aids demand Reuters", "provider": "Tue, 29 Apr 2025 07:00:00 GMT"}, "43": {"title": "Groesbeck Investment Management Corp NJ Buys New Holdings in Owens Corning Inc (NYSE:OC) - MarketBeat", "summary": "Groesbeck Investment Management Corp NJ Buys New Holdings in Owens Corning Inc (NYSE:OC) MarketBeat", "provider": "Tue, 08 Jul 2025 07:00:00 GMT"}, "44": {"title": "AI Is Here, And It Needs Corning (NYSE:GLW) - Seeking Alpha", "summary": "AI Is Here, And It Needs Corning (NYSE:GLW) Seeking Alpha", "provider": "Sat, 26 Apr 2025 07:00:00 GMT"}, "45": {"title": "Corning increased solar Michigan facility investment to $1.5B - Manufacturing Dive", "summary": "Corning increased solar Michigan facility investment to $1.5B Manufacturing Dive", "provider": "Thu, 01 May 2025 07:00:00 GMT"}, "46": {"title": "Corning Incorporated (GLW) Announces Key Executive Changes - GuruFocus", "summary": "Corning Incorporated (GLW) Announces Key Executive Changes GuruFocus", "provider": "Thu, 01 May 2025 07:00:00 GMT"}, "47": {"title": "Revenues Tell The Story For Corning Incorporated (NYSE:GLW) - simplywall.st", "summary": "Revenues Tell The Story For Corning Incorporated (NYSE:GLW) simplywall.st", "provider": "Mon, 06 Jan 2025 08:00:00 GMT"}, "48": {"title": "Corning Upgrades High-Confidence Springboard Plan to Now Add More Than $4 Billion in Annualized Sales, and to Achieve Operating Margin of 20%, by End of 2026 (1) - Business Wire", "summary": "Corning Upgrades High-Confidence Springboard Plan to Now Add More Than $4 Billion in Annualized Sales, and to Achieve Operating Margin of 20%, by End of 2026 (1) Business Wire", "provider": "Tue, 18 Mar 2025 07:00:00 GMT"}, "49": {"title": "Corning Dividend Alert: $0.28 Per Share Coming This Fall - Key Dates for Income Investors - Stock Titan", "summary": "Corning Dividend Alert: $0.28 Per Share Coming This Fall - Key Dates for Income Investors Stock Titan", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "50": {"title": "Airspan Announces Agreement to Acquire Corning’s Wireless Business - Business Wire", "summary": "Airspan Announces Agreement to Acquire Corning’s Wireless Business Business Wire", "provider": "Thu, 20 Feb 2025 08:00:00 GMT"}, "51": {"title": "Corning Inc. awarded $32M in CHIPS funding for Canton plant, creating up to 130 manufacturing jobs - Central New York Business Journal", "summary": "Corning Inc. awarded $32M in CHIPS funding for Canton plant, creating up to 130 manufacturing jobs Central New York Business Journal", "provider": "Fri, 08 Nov 2024 08:00:00 GMT"}, "52": {"title": "Corning’s clean energy investment recognized in Business Facilities’ 2024 Impact Awards - Michigan Economic Development Corporation (MEDC)", "summary": "Corning’s clean energy investment recognized in Business Facilities’ 2024 Impact Awards Michigan Economic Development Corporation (MEDC)", "provider": "Thu, 09 Jan 2025 08:00:00 GMT"}, "53": {"title": "Tech company Corning, US solar manufacturers partner on American-made panel - Reuters", "summary": "Tech company Corning, US solar manufacturers partner on American-made panel Reuters", "provider": "Thu, 06 Mar 2025 08:00:00 GMT"}, "54": {"title": "Corning Incorporated (GLW): Among The Chip Stocks In Focus Amid Tech Selloff - Yahoo Finance", "summary": "Corning Incorporated (GLW): Among The Chip Stocks In Focus Amid Tech Selloff Yahoo Finance", "provider": "Fri, 07 Feb 2025 08:00:00 GMT"}, "55": {"title": "Owens Corning Inc (NYSE:OC) Receives Average Recommendation of \"Moderate Buy\" from Brokerages - MarketBeat", "summary": "Owens Corning Inc (NYSE:OC) Receives Average Recommendation of \"Moderate Buy\" from Brokerages MarketBeat", "provider": "Thu, 10 Jul 2025 07:00:00 GMT"}, "56": {"title": "Corning, Buell Motorcycles Expand In Michigan - Business Facilities Magazine", "summary": "Corning, Buell Motorcycles Expand In Michigan Business Facilities Magazine", "provider": "Wed, 21 May 2025 07:00:00 GMT"}, "57": {"title": "Expansion to Corning Glass plant in Canton could bring nearly 300 jobs - NCPR: North Country Public Radio", "summary": "Expansion to Corning Glass plant in Canton could bring nearly 300 jobs NCPR: North Country Public Radio", "provider": "Fri, 08 Nov 2024 08:00:00 GMT"}, "58": {"title": "Corning increasing investment, jobs at solar plant near Hemlock - abc12.com", "summary": "Corning increasing investment, jobs at solar plant near Hemlock abc12.com", "provider": "Tue, 29 Apr 2025 20:29:52 GMT"}, "59": {"title": "Corning Announces Strong First-Quarter 2025 Financial Results(1) and Reiterates Confidence in Springboard Plan - Business Wire", "summary": "Corning Announces Strong First-Quarter 2025 Financial Results(1) and Reiterates Confidence in Springboard Plan Business Wire", "provider": "Tue, 29 Apr 2025 07:00:00 GMT"}}, "Tesla, Inc.": {"0": {"title": "Musk Suggests Tesla Shareholders Will Vote on xAI Investment - Bloomberg", "summary": "Musk Suggests Tesla Shareholders Will Vote on xAI Investment Bloomberg", "provider": "Mon, 14 Jul 2025 00:09:00 GMT"}, "1": {"title": "Tesla: No Longer Just An Automotive Company But An AI Leader (Rating Upgrade) - Seeking Alpha", "summary": "Tesla: No Longer Just An Automotive Company But An AI Leader (Rating Upgrade) Seeking Alpha", "provider": "Sat, 12 Jul 2025 13:00:00 GMT"}, "2": {"title": "Jim Cramer Sees Potential Price Break in Tesla Stock - Yahoo Finance", "summary": "Jim Cramer Sees Potential Price Break in Tesla Stock Yahoo Finance", "provider": "Fri, 11 Jul 2025 15:52:18 GMT"}, "3": {"title": "Cathie Wood’s ARK ETF adjusts portfolio, Tesla stock leads buys - Investing.com", "summary": "Cathie Wood’s ARK ETF adjusts portfolio, Tesla stock leads buys Investing.com", "provider": "Sat, 12 Jul 2025 00:14:50 GMT"}, "4": {"title": "Elon Musk’s Companies Had a Busy Weekend. Tesla Investors Should Take Note. - Barron's", "summary": "Elon Musk’s Companies Had a Busy Weekend. Tesla Investors Should Take Note. Barron's", "provider": "Sun, 13 Jul 2025 17:13:00 GMT"}, "5": {"title": "Why Elon Musk may have reached the end of the road at Tesla - Yahoo Finance", "summary": "Why Elon Musk may have reached the end of the road at Tesla Yahoo Finance", "provider": "Sun, 13 Jul 2025 11:00:00 GMT"}, "6": {"title": "Former Tesla engineer says the way company handles legal disputes has a powerful flaw - San Francisco Chronicle", "summary": "Former Tesla engineer says the way company handles legal disputes has a powerful flaw San Francisco Chronicle", "provider": "Sat, 12 Jul 2025 11:10:21 GMT"}, "7": {"title": "Musk's Tesla marks formal India entry with Mumbai launch event - Reuters", "summary": "Musk's Tesla marks formal India entry with Mumbai launch event Reuters", "provider": "Fri, 11 Jul 2025 06:20:00 GMT"}, "8": {"title": "Tesla wants to bring its robotaxis to Phoenix. What to know - The Arizona Republic", "summary": "Tesla wants to bring its robotaxis to Phoenix. What to know The Arizona Republic", "provider": "Fri, 11 Jul 2025 13:48:28 GMT"}, "9": {"title": "Tesla (TSLA) pushes its shareholders annual meeting all the way to November, but why? - Electrek", "summary": "Tesla (TSLA) pushes its shareholders annual meeting all the way to November, but why? Electrek", "provider": "Thu, 10 Jul 2025 20:35:00 GMT"}, "10": {"title": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says - Fox Business", "summary": "Tesla vehicles to get Grok AI chatbot starting next week, Musk says Fox Business", "provider": "Thu, 10 Jul 2025 20:42:00 GMT"}, "11": {"title": "Elon Musk Promises Robotaxis In California, But Something's Wrong - CarBuzz", "summary": "Elon Musk Promises Robotaxis In California, But Something's Wrong CarBuzz", "provider": "Sun, 13 Jul 2025 13:55:00 GMT"}, "12": {"title": "Tesla, Inc. - Britannica", "summary": "Tesla, Inc. Britannica", "provider": "Thu, 10 Jul 2025 14:55:00 GMT"}, "13": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Sold by Weatherly Asset Management L. P. - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Sold by Weatherly Asset Management L. P. MarketBeat", "provider": "Sun, 13 Jul 2025 13:24:34 GMT"}, "14": {"title": "Tesla, Inc. (TSLA) Isn’t Being Targeted By Trump’s Copper Tariffs, Says Jim Cramer - Yahoo Finance", "summary": "Tesla, Inc. (TSLA) Isn’t Being Targeted By Trump’s Copper Tariffs, Says Jim Cramer Yahoo Finance", "provider": "Sat, 12 Jul 2025 18:42:54 GMT"}, "15": {"title": "Tesla Plans Robotaxi Expansion With San Francisco Deployment - MSN", "summary": "Tesla Plans Robotaxi Expansion With San Francisco Deployment MSN", "provider": "Sun, 13 Jul 2025 13:03:13 GMT"}, "16": {"title": "INVESTOR ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Tesla, Inc. - TSLA - PR Newswire", "summary": "INVESTOR ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Tesla, Inc. - TSLA PR Newswire", "provider": "Sat, 12 Jul 2025 14:02:56 GMT"}, "17": {"title": "Tesla investors ask: When’s the shareholder meeting? - MarketWatch", "summary": "Tesla investors ask: When’s the shareholder meeting? MarketWatch", "provider": "Wed, 09 Jul 2025 16:09:00 GMT"}, "18": {"title": "LRI Investments LLC Acquires 1,332 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "LRI Investments LLC Acquires 1,332 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 12:31:53 GMT"}, "19": {"title": "Elon Musk - Britannica", "summary": "Elon Musk Britannica", "provider": "Fri, 11 Jul 2025 16:15:00 GMT"}, "20": {"title": "Tesla Likely to Begin First Deliveries in India From August - Bloomberg", "summary": "Tesla Likely to Begin First Deliveries in India From August Bloomberg", "provider": "Fri, 11 Jul 2025 11:35:45 GMT"}, "21": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Sold by Reyes Financial Architecture Inc. - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Sold by Reyes Financial Architecture Inc. MarketBeat", "provider": "Sun, 13 Jul 2025 12:19:01 GMT"}, "22": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Secured Retirement Advisors LLC - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Secured Retirement Advisors LLC MarketBeat", "provider": "Sun, 13 Jul 2025 12:19:49 GMT"}, "23": {"title": "Cwm LLC Purchases 23,349 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Cwm LLC Purchases 23,349 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 11:43:27 GMT"}, "24": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Dock Street Asset Management Inc. - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Dock Street Asset Management Inc. MarketBeat", "provider": "Sun, 13 Jul 2025 11:43:27 GMT"}, "25": {"title": "TFR Capital LLC. Purchases 2,335 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "TFR Capital LLC. Purchases 2,335 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 11:43:28 GMT"}, "26": {"title": "TruNorth Capital Management LLC Boosts Holdings in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "TruNorth Capital Management LLC Boosts Holdings in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 10:53:12 GMT"}, "27": {"title": "New York State Common Retirement Fund Sells 112,326 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "New York State Common Retirement Fund Sells 112,326 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 10:21:29 GMT"}, "28": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Sold by Schechter Investment Advisors LLC - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Sold by Schechter Investment Advisors LLC MarketBeat", "provider": "Sun, 13 Jul 2025 10:15:47 GMT"}, "29": {"title": "Westmount Partners LLC Purchases 1,071 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Westmount Partners LLC Purchases 1,071 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 10:41:12 GMT"}, "30": {"title": "Tesla to offer shareholders chance to invest in xAI: Musk - Tioga Publishing", "summary": "Tesla to offer shareholders chance to invest in xAI: Musk Tioga Publishing", "provider": "Mon, 14 Jul 2025 02:28:04 GMT"}, "31": {"title": "Elon Musk tells Tesla analyst to 'shut up' over suggestions to limit his political activities - Fox Business", "summary": "Elon Musk tells Tesla analyst to 'shut up' over suggestions to limit his political activities Fox Business", "provider": "Wed, 09 Jul 2025 19:03:00 GMT"}, "32": {"title": "Tesla, Inc. (TSLA): \"This Thing Is A Juggernaut When It Comes To Humanoid,\" Says Jim Cramer - Yahoo Finance", "summary": "Tesla, Inc. (TSLA): \"This Thing Is A Juggernaut When It Comes To Humanoid,\" Says Jim Cramer Yahoo Finance", "provider": "Fri, 11 Jul 2025 07:47:25 GMT"}, "33": {"title": "Everything we know about Tesla's robotaxi launch in Austin - CNBC", "summary": "Everything we know about Tesla's robotaxi launch in Austin CNBC", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "34": {"title": "Mutual of America Capital Management LLC Has $84.39 Million Holdings in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Mutual of America Capital Management LLC Has $84.39 Million Holdings in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 10:35:09 GMT"}, "35": {"title": "Tesla: Here's What People Are Misunderstanding - Seeking Alpha", "summary": "Tesla: Here's What People Are Misunderstanding Seeking Alpha", "provider": "Sun, 13 Jul 2025 09:21:00 GMT"}, "36": {"title": "Tesla Plans Robotaxi Expansion With San Francisco Deployment (TSLA) - Bloomberg", "summary": "Tesla Plans Robotaxi Expansion With San Francisco Deployment (TSLA) Bloomberg", "provider": "Fri, 11 Jul 2025 00:29:00 GMT"}, "37": {"title": "Tesla plans shareholders vote on investment in Musk’s xAI - Tech in Asia", "summary": "Tesla plans shareholders vote on investment in Musk’s xAI Tech in Asia", "provider": "Mon, 14 Jul 2025 01:40:00 GMT"}, "38": {"title": "Tesla robotaxi incidents caught on camera in Austin draw regulators' attention - CNBC", "summary": "Tesla robotaxi incidents caught on camera in Austin draw regulators' attention CNBC", "provider": "Mon, 23 Jun 2025 07:00:00 GMT"}, "39": {"title": "Musk suggests Tesla shareholders should vote on possible xAI investment - Business Standard", "summary": "Musk suggests Tesla shareholders should vote on possible xAI investment Business Standard", "provider": "Mon, 14 Jul 2025 03:39:09 GMT"}, "40": {"title": "Tesla’s Sales In The U.S. Market Should Decline Sharply: New Law (NASDAQ:TSLA) - Seeking Alpha", "summary": "Tesla’s Sales In The U.S. Market Should Decline Sharply: New Law (NASDAQ:TSLA) Seeking Alpha", "provider": "Fri, 11 Jul 2025 19:24:00 GMT"}, "41": {"title": "Bradley & Co. Private Wealth Management LLC Has $2.62 Million Stock Position in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Bradley & Co. Private Wealth Management LLC Has $2.62 Million Stock Position in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sun, 13 Jul 2025 10:41:12 GMT"}, "42": {"title": "SpaceX to invest $2 billion in Musk's xAI startup, WSJ reports - Reuters", "summary": "SpaceX to invest $2 billion in Musk's xAI startup, WSJ reports Reuters", "provider": "Sun, 13 Jul 2025 08:46:27 GMT"}, "43": {"title": "Tesla, Inc. (NASDAQ:TSLA) Holdings Reduced by Ballentine Partners LLC - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Holdings Reduced by Ballentine Partners LLC MarketBeat", "provider": "Sat, 12 Jul 2025 12:21:18 GMT"}, "44": {"title": "Tesla stock slips after report EV maker is pausing Cybertruck and Model Y production - CNBC", "summary": "Tesla stock slips after report EV maker is pausing Cybertruck and Model Y production CNBC", "provider": "Tue, 17 Jun 2025 07:00:00 GMT"}, "45": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Kathmere Capital Management LLC - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Kathmere Capital Management LLC MarketBeat", "provider": "Sat, 12 Jul 2025 12:33:19 GMT"}, "46": {"title": "Tesla, Inc. (NASDAQ:TSLA) Stock Position Reduced by Brown Advisory Inc. - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Stock Position Reduced by Brown Advisory Inc. MarketBeat", "provider": "Sat, 12 Jul 2025 09:36:09 GMT"}, "47": {"title": "Platform Technology Partners Purchases 3,657 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Platform Technology Partners Purchases 3,657 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sat, 12 Jul 2025 13:19:37 GMT"}, "48": {"title": "Tesla Inc. (TSLA) Stock: India Entry, Robotaxis, Norway Surge Amid Political Headwinds - CoinCentral", "summary": "Tesla Inc. (TSLA) Stock: India Entry, Robotaxis, Norway Surge Amid Political Headwinds CoinCentral", "provider": "Sat, 12 Jul 2025 15:32:03 GMT"}, "49": {"title": "Focused Wealth Management Inc Has $6.05 Million Position in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Focused Wealth Management Inc Has $6.05 Million Position in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "50": {"title": "Alps Advisors Inc. Grows Stock Position in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Alps Advisors Inc. Grows Stock Position in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sat, 12 Jul 2025 09:56:29 GMT"}, "51": {"title": "Fort Sheridan Advisors LLC Reduces Position in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Fort Sheridan Advisors LLC Reduces Position in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "52": {"title": "Musk: Tesla to vote on xAI investment - breakingthenews.net", "summary": "Musk: Tesla to vote on xAI investment breakingthenews.net", "provider": "Mon, 14 Jul 2025 01:24:00 GMT"}, "53": {"title": "Cerity Partners LLC Buys 9,258 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Cerity Partners LLC Buys 9,258 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Fri, 11 Jul 2025 10:45:22 GMT"}, "54": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by B & T Capital Management DBA Alpha Capital Management - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by B & T Capital Management DBA Alpha Capital Management MarketBeat", "provider": "Sat, 12 Jul 2025 12:35:18 GMT"}, "55": {"title": "Kesler Norman & Wride LLC Sells 1,539 Shares of Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Kesler Norman & Wride LLC Sells 1,539 Shares of Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Sat, 12 Jul 2025 10:04:45 GMT"}, "56": {"title": "Tesla investors ask board to set date for overdue annual shareholder meeting - Reuters", "summary": "Tesla investors ask board to set date for overdue annual shareholder meeting Reuters", "provider": "Wed, 09 Jul 2025 19:03:47 GMT"}, "57": {"title": "Grok AI to be available in Tesla vehicles next week, Musk says - Reuters", "summary": "Grok AI to be available in Tesla vehicles next week, Musk says Reuters", "provider": "Thu, 10 Jul 2025 10:31:17 GMT"}, "58": {"title": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Xponance Inc. - MarketBeat", "summary": "Tesla, Inc. (NASDAQ:TSLA) Shares Bought by Xponance Inc. MarketBeat", "provider": "Fri, 11 Jul 2025 12:31:18 GMT"}, "59": {"title": "Diversify Wealth Management LLC Trims Stake in Tesla, Inc. (NASDAQ:TSLA) - MarketBeat", "summary": "Diversify Wealth Management LLC Trims Stake in Tesla, Inc. (NASDAQ:TSLA) MarketBeat", "provider": "Fri, 11 Jul 2025 12:31:18 GMT"}}, "Advanced Micro Devices, Inc.": {"0": {"title": "HSBC Upgrades Advanced Micro Devices (AMD) Stock to Buy from Hold - Yahoo Finance", "summary": "HSBC Upgrades Advanced Micro Devices (AMD) Stock to Buy from Hold Yahoo Finance", "provider": "Sun, 13 Jul 2025 05:12:56 GMT"}, "1": {"title": "AMD Gets a $140 Target From Goldman—but Faces Headwinds in AI Race - MSN", "summary": "AMD Gets a $140 Target From Goldman—but Faces Headwinds in AI Race MSN", "provider": "Sun, 13 Jul 2025 15:59:24 GMT"}, "2": {"title": "44th Anniversary Buy-and-Hold Pick: Advanced Micro Devices (AMD) - Schaeffer's Investment Research", "summary": "44th Anniversary Buy-and-Hold Pick: Advanced Micro Devices (AMD) Schaeffer's Investment Research", "provider": "Fri, 11 Jul 2025 12:00:08 GMT"}, "3": {"title": "Advanced Micro Devices (AMD) Maintains $32B FY25 Forecast Despite EPS Trim, Mizuho Stays Bullish - Insider Monkey", "summary": "Advanced Micro Devices (AMD) Maintains $32B FY25 Forecast Despite EPS Trim, Mizuho Stays Bullish Insider Monkey", "provider": "Thu, 10 Jul 2025 06:24:42 GMT"}, "4": {"title": "AMD Has A Strong Foundation For Future Growth (NASDAQ:AMD) - Seeking Alpha", "summary": "AMD Has A Strong Foundation For Future Growth (NASDAQ:AMD) Seeking Alpha", "provider": "Sun, 13 Jul 2025 10:01:00 GMT"}, "5": {"title": "Advanced Micro Devices Stock Gains 11% YTD: Time to Hold or Exit? - Zacks Investment Research", "summary": "Advanced Micro Devices Stock Gains 11% YTD: Time to Hold or Exit? Zacks Investment Research", "provider": "Tue, 08 Jul 2025 15:32:05 GMT"}, "6": {"title": "AMD Stock Is Rising Thursday: What's Going On? - Benzinga", "summary": "AMD Stock Is Rising Thursday: What's Going On? Benzinga", "provider": "Thu, 10 Jul 2025 18:58:28 GMT"}, "7": {"title": "AMD’s stock is rallying as analysts make their case for a 40% gain from here - MarketWatch", "summary": "AMD’s stock is rallying as analysts make their case for a 40% gain from here MarketWatch", "provider": "Thu, 10 Jul 2025 17:06:00 GMT"}, "8": {"title": "The Zacks Analyst Blog Highlights NVIDIA, SoundHound, Microsoft, Apple, Intel and Advanced Micro Devices - Nasdaq", "summary": "The Zacks Analyst Blog Highlights NVIDIA, SoundHound, Microsoft, Apple, Intel and Advanced Micro Devices Nasdaq", "provider": "Fri, 11 Jul 2025 09:05:00 GMT"}, "9": {"title": "Advanced Micro Devices (AMD) Maintains $32B FY25 Forecast Despite EPS Trim, Mizuho Stays Bullish - Yahoo Finance", "summary": "Advanced Micro Devices (AMD) Maintains $32B FY25 Forecast Despite EPS Trim, Mizuho Stays Bullish Yahoo Finance", "provider": "Thu, 10 Jul 2025 06:19:46 GMT"}, "10": {"title": "Advanced Micro Devices Earnings Preview: What to Expect - MSN", "summary": "Advanced Micro Devices Earnings Preview: What to Expect MSN", "provider": "Thu, 10 Jul 2025 14:43:52 GMT"}, "11": {"title": "Longriver Partners Fund’s Views on Advanced Micro Devices (AMD) - Insider Monkey", "summary": "Longriver Partners Fund’s Views on Advanced Micro Devices (AMD) Insider Monkey", "provider": "Thu, 10 Jul 2025 12:52:20 GMT"}, "12": {"title": "Advanced Micro Devices, Inc. (AMD) Is a Trending Stock: Facts to Know Before Betting on It - Yahoo Finance", "summary": "Advanced Micro Devices, Inc. (AMD) Is a Trending Stock: Facts to Know Before Betting on It Yahoo Finance", "provider": "Fri, 11 Jul 2025 13:00:02 GMT"}, "13": {"title": "Veteran analyst drops massive call on AMD stock - Yahoo Finance", "summary": "Veteran analyst drops massive call on AMD stock Yahoo Finance", "provider": "Fri, 11 Jul 2025 22:07:00 GMT"}, "14": {"title": "Advanced Micro Devices (AMD) Dips More Than Broader Market: What You Should Know - Yahoo Finance", "summary": "Advanced Micro Devices (AMD) Dips More Than Broader Market: What You Should Know Yahoo Finance", "provider": "Mon, 07 Jul 2025 21:45:04 GMT"}, "15": {"title": "HSBC says AMD's AI muscle could double its stock - Yahoo Finance", "summary": "HSBC says AMD's AI muscle could double its stock Yahoo Finance", "provider": "Fri, 11 Jul 2025 05:01:39 GMT"}, "16": {"title": "HSBC upgrades AMD to Buy due to 'AI GPU pipeline' (AMD:NASDAQ) - Seeking Alpha", "summary": "HSBC upgrades AMD to Buy due to 'AI GPU pipeline' (AMD:NASDAQ) Seeking Alpha", "provider": "Thu, 10 Jul 2025 13:41:00 GMT"}, "17": {"title": "AMD (AMD) Gets Citi Price Target Hike Ahead of Q2 Earnings - Yahoo Finance", "summary": "AMD (AMD) Gets Citi Price Target Hike Ahead of Q2 Earnings Yahoo Finance", "provider": "Thu, 10 Jul 2025 20:09:12 GMT"}, "18": {"title": "AMD At $135? That Just Might Be The Launchpad - Benzinga", "summary": "AMD At $135? That Just Might Be The Launchpad Benzinga", "provider": "Tue, 08 Jul 2025 19:18:35 GMT"}, "19": {"title": "MP Materials, Coreweave, Levi Strauss, United Airlines, And AMD: Why These 5 Stocks Are On Investors' Radars Today - Benzinga", "summary": "MP Materials, Coreweave, Levi Strauss, United Airlines, And AMD: Why These 5 Stocks Are On Investors' Radars Today Benzinga", "provider": "Fri, 11 Jul 2025 02:15:11 GMT"}, "20": {"title": "Can Advanced Micro Devices Aid Its Data Center Revenues With GPUs? - Yahoo Finance", "summary": "Can Advanced Micro Devices Aid Its Data Center Revenues With GPUs? Yahoo Finance", "provider": "Fri, 27 Jun 2025 07:00:00 GMT"}, "21": {"title": "Advanced Micro Devices, Inc. (AMD): Jim Cramer Shares Major Catalyst That Could Change Everything! - Insider Monkey", "summary": "Advanced Micro Devices, Inc. (AMD): Jim Cramer Shares Major Catalyst That Could Change Everything! Insider Monkey", "provider": "Sun, 29 Jun 2025 07:00:00 GMT"}, "22": {"title": "Performance Vs. Expectations: Rethinking Nvidia And AMD Valuations (NASDAQ:NVDA) - Seeking Alpha", "summary": "Performance Vs. Expectations: Rethinking Nvidia And AMD Valuations (NASDAQ:NVDA) Seeking Alpha", "provider": "Fri, 11 Jul 2025 13:58:00 GMT"}, "23": {"title": "Advanced Micro Devices, Inc. (AMD) GPUs Could Be Offered To China, Says Jim Cramer - Insider Monkey", "summary": "Advanced Micro Devices, Inc. (AMD) GPUs Could Be Offered To China, Says Jim Cramer Insider Monkey", "provider": "Wed, 25 Jun 2025 07:00:00 GMT"}, "24": {"title": "Advanced Micro Devices Inc. (NASDAQ: AMD) Price Prediction and Forecast 2025-2030 (June 2025) - 24/7 Wall St.", "summary": "Advanced Micro Devices Inc. (NASDAQ: AMD) Price Prediction and Forecast 2025-2030 (June 2025) 24/7 Wall St.", "provider": "Thu, 19 Jun 2025 07:00:00 GMT"}, "25": {"title": "Here is What to Know Beyond Why Advanced Micro Devices, Inc. (AMD) is a Trending Stock - Yahoo Finance", "summary": "Here is What to Know Beyond Why Advanced Micro Devices, Inc. (AMD) is a Trending Stock Yahoo Finance", "provider": "Wed, 18 Jun 2025 07:00:00 GMT"}, "26": {"title": "AMD stock: HSBC says it’s catching up to Nvidia – but is it really? - TradingView", "summary": "AMD stock: HSBC says it’s catching up to Nvidia – but is it really? TradingView", "provider": "Thu, 10 Jul 2025 19:35:08 GMT"}, "27": {"title": "Advanced Micro Devices, Inc. (AMD): They Have A Really Good AI Chip, Says Jim Cramer - Insider Monkey", "summary": "Advanced Micro Devices, Inc. (AMD): They Have A Really Good AI Chip, Says Jim Cramer Insider Monkey", "provider": "Fri, 27 Jun 2025 19:05:40 GMT"}, "28": {"title": "AMD Stock Surge: What’s Driving the Rally? - timothysykes.com", "summary": "AMD Stock Surge: What’s Driving the Rally? timothysykes.com", "provider": "Thu, 10 Jul 2025 13:19:00 GMT"}, "29": {"title": "AMD (AMD) Stock: AI Chip Buzz Lifts Shares, Analysts Watch $175-$215 - CoinCentral", "summary": "AMD (AMD) Stock: AI Chip Buzz Lifts Shares, Analysts Watch $175-$215 CoinCentral", "provider": "Sat, 12 Jul 2025 15:48:11 GMT"}, "30": {"title": "What's Going On With AMD Stock? - Benzinga", "summary": "What's Going On With AMD Stock? Benzinga", "provider": "Mon, 07 Jul 2025 19:37:38 GMT"}, "31": {"title": "Meta's Obsession With AI is Great News for AMD (NASDAQ:AMD) - Seeking Alpha", "summary": "Meta's Obsession With AI is Great News for AMD (NASDAQ:AMD) Seeking Alpha", "provider": "Wed, 09 Jul 2025 05:49:00 GMT"}, "32": {"title": "Better Artificial Intelligence (AI) Stock: Advanced Micro Devices vs. Micron Technology - Yahoo Finance", "summary": "Better Artificial Intelligence (AI) Stock: Advanced Micro Devices vs. Micron Technology Yahoo Finance", "provider": "Sat, 05 Jul 2025 07:00:00 GMT"}, "33": {"title": "Analyst Predicts AI Revenue Upside for Semiconductor Giant - Schaeffer's Investment Research", "summary": "Analyst Predicts AI Revenue Upside for Semiconductor Giant Schaeffer's Investment Research", "provider": "Thu, 10 Jul 2025 14:57:55 GMT"}, "34": {"title": "AMD to Report Fiscal Second Quarter 2025 Financial Results - GlobeNewswire", "summary": "AMD to Report Fiscal Second Quarter 2025 Financial Results GlobeNewswire", "provider": "Tue, 08 Jul 2025 20:15:55 GMT"}, "35": {"title": "Advanced Micro Devices (AMD) Gets $130 Price Target as BofA Calls It the “Next-Best AI Vendor” - Yahoo Finance", "summary": "Advanced Micro Devices (AMD) Gets $130 Price Target as BofA Calls It the “Next-Best AI Vendor” Yahoo Finance", "provider": "Mon, 16 Jun 2025 07:00:00 GMT"}, "36": {"title": "AMD Pops as Citi Lifts Target to $145 Ahead of Q2 Earnings - Yahoo Finance", "summary": "AMD Pops as Citi Lifts Target to $145 Ahead of Q2 Earnings Yahoo Finance", "provider": "Tue, 08 Jul 2025 12:35:32 GMT"}, "37": {"title": "Fresh AI Euphoria Boosts AMD Stock Momentum - Yahoo Finance", "summary": "Fresh AI Euphoria Boosts AMD Stock Momentum Yahoo Finance", "provider": "Sat, 28 Jun 2025 07:00:00 GMT"}, "38": {"title": "Is Advanced Micro Devices, Inc. (AMD) the Most Undervalued Growth Stock to Buy Now? - Yahoo Finance", "summary": "Is Advanced Micro Devices, Inc. (AMD) the Most Undervalued Growth Stock to Buy Now? Yahoo Finance", "provider": "Wed, 23 Apr 2025 07:00:00 GMT"}, "39": {"title": "Advanced Micro Devices, Inc. (AMD) Gains Boost As Bank Of America Raises Target On AI Deal Momentum - Yahoo Finance", "summary": "Advanced Micro Devices, Inc. (AMD) Gains Boost As Bank Of America Raises Target On AI Deal Momentum Yahoo Finance", "provider": "Wed, 14 May 2025 07:00:00 GMT"}, "40": {"title": "Advanced Micro Devices, Inc. (AMD) and HUMAIN Partner on $10B Global AI Infrastructure Expansion - Yahoo Finance", "summary": "Advanced Micro Devices, Inc. (AMD) and HUMAIN Partner on $10B Global AI Infrastructure Expansion Yahoo Finance", "provider": "Wed, 14 May 2025 07:00:00 GMT"}, "41": {"title": "Is Advanced Micro Devices Inc. (NASDAQ:AMD) a Stock That Should Double in 3 Years? - Yahoo Finance", "summary": "Is Advanced Micro Devices Inc. (NASDAQ:AMD) a Stock That Should Double in 3 Years? Yahoo Finance", "provider": "Wed, 30 Apr 2025 07:00:00 GMT"}, "42": {"title": "Why Advanced Micro Devices Stock Moved Higher Today - Yahoo Finance", "summary": "Why Advanced Micro Devices Stock Moved Higher Today Yahoo Finance", "provider": "Fri, 20 Jun 2025 07:00:00 GMT"}, "43": {"title": "AMD Stock Moves Higher Despite U.S. Chip Export Crackdown, Trump Tariff Escalation - Benzinga", "summary": "AMD Stock Moves Higher Despite U.S. Chip Export Crackdown, Trump Tariff Escalation Benzinga", "provider": "Tue, 08 Jul 2025 18:41:10 GMT"}, "44": {"title": "Truist Maintains Hold on AMD Amid Datacenter GPU Debate - MSN", "summary": "Truist Maintains Hold on AMD Amid Datacenter GPU Debate MSN", "provider": "Wed, 09 Jul 2025 23:06:43 GMT"}, "45": {"title": "Advanced Micro Devices (AMD) Stock Declines While Market Improves: Some Information for Investors - Yahoo Finance", "summary": "Advanced Micro Devices (AMD) Stock Declines While Market Improves: Some Information for Investors Yahoo Finance", "provider": "Mon, 30 Jun 2025 07:00:00 GMT"}, "46": {"title": "Advanced Micro Devices Inc (AMD) Q1 2025 Earnings Call Highlights: Strong Revenue Growth Amid ... - Yahoo Finance", "summary": "Advanced Micro Devices Inc (AMD) Q1 2025 Earnings Call Highlights: Strong Revenue Growth Amid ... Yahoo Finance", "provider": "Wed, 07 May 2025 07:00:00 GMT"}, "47": {"title": "Advanced Micro Devices (AMD): Future AI Inference Monster - Seeking Alpha", "summary": "Advanced Micro Devices (AMD): Future AI Inference Monster Seeking Alpha", "provider": "Sun, 15 Jun 2025 07:00:00 GMT"}, "48": {"title": "AMD is Pursuing Product Line Expansion: Will Margins Sustain? - Yahoo Finance", "summary": "AMD is Pursuing Product Line Expansion: Will Margins Sustain? Yahoo Finance", "provider": "Mon, 30 Jun 2025 07:00:00 GMT"}, "49": {"title": "AMD Bolsters AI Data Center Pitch With Full-Rack Systems - Investor's Business Daily", "summary": "AMD Bolsters AI Data Center Pitch With Full-Rack Systems Investor's Business Daily", "provider": "Thu, 12 Jun 2025 07:00:00 GMT"}, "50": {"title": "This AMD Analyst Turns Bullish; Here Are Top 5 Upgrades For Thursday - Benzinga", "summary": "This AMD Analyst Turns Bullish; Here Are Top 5 Upgrades For Thursday Benzinga", "provider": "Thu, 10 Jul 2025 13:58:22 GMT"}, "51": {"title": "'Everybody Is Chasing The Next AI Hype,' Says Investor. But They're Asking: What Are The Boring Stocks With 'Tech-Like Returns?' - AutoZone (NYSE:AZO), Advanced Micro Devices (NASDAQ:AMD) - Benzinga", "summary": "'Everybody Is Chasing The Next AI Hype,' Says Investor. But They're Asking: What Are The Boring Stocks With 'Tech-Like Returns?' - AutoZone (NYSE:AZO), Advanced Micro Devices (NASDAQ:AMD) Benzinga", "provider": "Fri, 11 Jul 2025 01:01:00 GMT"}, "52": {"title": "AMD Announces Q2 Earnings Date and CFO Presentation at Citi Global TMT Conference - Stock Titan", "summary": "AMD Announces Q2 Earnings Date and CFO Presentation at Citi Global TMT Conference Stock Titan", "provider": "Tue, 08 Jul 2025 20:15:00 GMT"}, "53": {"title": "AMD vs. Micron Technology: Which Semiconductor Stock Has More Upside? - Yahoo Finance", "summary": "AMD vs. Micron Technology: Which Semiconductor Stock Has More Upside? Yahoo Finance", "provider": "Thu, 03 Jul 2025 07:00:00 GMT"}, "54": {"title": "Is Advanced Micro Devices, Inc. (AMD) the Best Augmented Reality Stock to Buy According to Hedge Funds? - Yahoo Finance", "summary": "Is Advanced Micro Devices, Inc. (AMD) the Best Augmented Reality Stock to Buy According to Hedge Funds? Yahoo Finance", "provider": "Thu, 01 May 2025 07:00:00 GMT"}, "55": {"title": "Advanced Micro Devices shares snapped six-session winning streak (NASDAQ:AMD) - Seeking Alpha", "summary": "Advanced Micro Devices shares snapped six-session winning streak (NASDAQ:AMD) Seeking Alpha", "provider": "Mon, 30 Jun 2025 07:00:00 GMT"}, "56": {"title": "AMD's Rally Has Just Begun (NASDAQ:AMD) - Seeking Alpha", "summary": "AMD's Rally Has Just Begun (NASDAQ:AMD) Seeking Alpha", "provider": "Fri, 27 Jun 2025 07:00:00 GMT"}, "57": {"title": "Advanced Micro Devices, Inc. (AMD) Started With a Buy Rating by Investment Bank - Yahoo Finance", "summary": "Advanced Micro Devices, Inc. (AMD) Started With a Buy Rating by Investment Bank Yahoo Finance", "provider": "Wed, 30 Apr 2025 07:00:00 GMT"}, "58": {"title": "Wells Fargo Backs Advanced Micro Devices Inc. (AMD) After ZT Sale, Eyes AI Future - Yahoo Finance", "summary": "Wells Fargo Backs Advanced Micro Devices Inc. (AMD) After ZT Sale, Eyes AI Future Yahoo Finance", "provider": "Tue, 20 May 2025 07:00:00 GMT"}, "59": {"title": "Arm Sees 14-Fold Growth In Data Center Customers Since 2021 Amid Strategic Expansion To PC Market: Report - Benzinga", "summary": "Arm Sees 14-Fold Growth In Data Center Customers Since 2021 Amid Strategic Expansion To PC Market: Report Benzinga", "provider": "Thu, 10 Jul 2025 13:06:43 GMT"}}}