{"Tesla": {"0": {"title": "Tesla earnings: 3 things to watch for", "summary": "tesla earnings: 3 things to watch for tesla (tsla) reports its second quarter results on wednesday, july 23. yahoo finance senior autos reporter pras subramanian shares three things he is watching for. to watch more expert insights and analysis on the latest market action, check out more market catalysts here.", "provider": "Yahoo Finance Video"}, "1": {"title": "Luxury carmaker fires shot at Tesla in robotaxi wars", "summary": "luxury carmaker fires shot at tesla in robotaxi wars a quiet pivot might make a loud impact down the road.", "provider": "TheStreet"}, "2": {"title": "Chinese graphite is crucial to electric car batteries. Trump just put a 93.5% tariff on it", "summary": "chinese graphite is crucial to electric car batteries. trump just put a 93.5% tariff on it the trump administration is imposing a substantial tariff on a raw material that is critical for electric vehicle batteries, which could significantly raise the cost of building evs in the united states.", "provider": "CNN Business"}, "3": {"title": "Tesla Just Lost Another Sales Exec. How Should You Play TSLA Stock Now Before July 23?", "summary": "tesla just lost another sales exec. how should you play tsla stock now before july 23? tesla stock is facing new volatility after the latest senior leadership exit, adding pressure ahead of its next earnings update.", "provider": "Barchart"}, "4": {"title": "Tesla Stock Rises as U.S. Hits China With 160% Graphite Tariff", "summary": "tesla stock rises as u.s. hits china with 160% graphite tariff china graphite hit with major tariff, ev makers brace for impact", "provider": "GuruFocus.com"}, "5": {"title": "Elon Musk's Tesla Achieving Full Autonomy Would Be 'Good For Society' But Bad For Insurance Companies, Says Warren Buffett: 'If Accidents Get Reduced...'", "summary": "elon musk's tesla achieving full autonomy would be 'good for society' but bad for insurance companies, says warren buffett: 'if accidents get reduced...' berkshire hathaway inc.'s (nyse:brk) ceo, warren buffett, says that if accidents are reduced because of elon musk's tesla inc. (nasdaq:tsla) achieving full autonomy, it'll be good for society. check out the current price of tsla stock here. what ...", "provider": "Benzinga"}, "6": {"title": "Tesla Next Move Could Shock the Market--Analysts Say Don't Miss It", "summary": "tesla next move could shock the market--analysts say don't miss it tesla frenzy continues: barclays pins hope on robotaxis", "provider": "GuruFocus.com"}, "7": {"title": "Trump Aims Tariff Double Whammy at Industries, Nations by Aug. 1", "summary": "trump aims tariff double whammy at industries, nations by aug. 1 (bloomberg) -- president donald trump is readying plans for industry-specific tariffs to kick in alongside his country-by-country duties in two weeks, ramping up his push to reshape the us’s standing in the global trading system by penalizing purchases from abroad.most read from bloombergthe dutch intersection is coming to save your lifemumbai facelift is inspired by 200-year-old new york blueprintadvocates fear us agents are using ‘wellness checks’ on children as a prelude to arrestsla homeless", "provider": "Bloomberg"}, "8": {"title": "What Analysts Think of Tesla Stock Ahead of Earnings", "summary": "what analysts think of tesla stock ahead of earnings tesla is slated to report second-quarter results after the market closes on wednesday, after deliveries fell short of estimates earlier this month.", "provider": "Investopedia"}, "9": {"title": "A Weak Dollar Has Added Heft to S&P 500 Earnings. A Flip Could Be Coming.", "summary": "a weak dollar has added heft to s&p 500 earnings. a flip could be coming. a weakening dollar has provided a solid lift to early second-quarter earnings, but it could be masking softness in domestic demand and potential pressures on profit margins as tariffs increase over the coming months.  the greenback has fallen nearly 9.5% so far this year and is pinned near the lowest levels since 2022 amid a mixture of slowing growth prospects, rising fiscal deficits and worries over the safety of longer term investment in american assets.  data from apollo global suggests companies within the benchmark generate around 41% of their total revenue from outside the u.s., and a weaker dollar increases their value when it comes to financial reporting.", "provider": "Barrons.com"}}, "Advanced Micro Devices, Inc.": {"0": {"title": "What the China export easing means for Nvidia, AMD, and other chips stocks", "summary": "what the china export easing means for nvidia, amd, and other chips stocks a potential green light in ai chip sales to china could reset the global semiconductor market.", "provider": "Yahoo Finance"}, "1": {"title": "NVIDIA, AMD to Resume AI Chip Sales to China Following US-China Trade Deal", "summary": "nvidia, amd to resume ai chip sales to china following us-china trade deal nvidia corporation (nasdaq:nvda) is one of the best us stocks to buy according to billionaires. on july 14, nvidia announced its intention to resume sales of its h20 ai chip to china. the reversal comes after nvidia ceo jensen huang met with president donald trump at the white house last week. huang has consistently argued […]", "provider": "Insider Monkey"}, "2": {"title": "Trump’s U-Turn on Nvidia Spurs Talk of Grand Bargain With China", "summary": "trump’s u-turn on nvidia spurs talk of grand bargain with china (bloomberg) -- only a few years ago, the biden administration declared export controls a “new strategic asset” to help the us maintain “as large a lead as possible” over china in advanced technology. president donald trump is now upending that approach.most read from bloombergthe dutch intersection is coming to save your lifeadvocates fear us agents are using ‘wellness checks’ on children as a prelude to arrestsla homelessness drops for second yearmanhattan, chicago murder rates drop in 2025, of", "provider": "Bloomberg"}, "3": {"title": "TSMC Stock Rises. Outlook Is Bright as the AI Chips Boom Outweighs Tariff Fears.", "summary": "tsmc stock rises. outlook is bright as the ai chips boom outweighs tariff fears. taiwan semiconductor manufacturing reported a 61% rise in quarterly profit as it benefits from demand for artificial-intelligence processors.", "provider": "Barrons.com"}, "4": {"title": "Nvidia Stock Gains. Why  Taiwan Semi’s Outlook Is Good News for the Chip Maker.", "summary": "nvidia stock gains. why  taiwan semi’s outlook is good news for the chip maker. nvidia was gaining after key partner taiwan semiconductor manufacturing gave an upbeat outlook on artificial-intelligence processor demand.", "provider": "Barrons.com"}, "5": {"title": "Insider Trading Alert: Here's Who Bought Nvidia and AMD Stock Before the U.S. Chip Deal with China", "summary": "insider trading alert: here's who bought nvidia and amd stock before the u.s. chip deal with china lawmakers loaded up on ai stocks days before the u.s. reversed its chip policy with china — and you can track every move with barchart tools.", "provider": "Barchart"}, "6": {"title": "2025: Wall Street's Steep Ascent Up the Wall of Worry", "summary": "2025: wall street's steep ascent up the wall of worry it's been a turbulent year, but 2025 has once again proven wall street's ability to climb the proverbial \"wall of worry.\" from the initial deepseek shock and the tariff scares, the market has demonstrated remarkable resilience.", "provider": "Zacks"}, "7": {"title": "Can Growing Adoption of Tomahawk Ultra Boost Broadcom's AI Revenues?", "summary": "can growing adoption of tomahawk ultra boost broadcom's ai revenues? avgo's tomahawk ultra chip aims to drive ai revenues higher with faster adoption among hyperscalers and oems.", "provider": "Zacks"}, "8": {"title": "TSMC Raises 2025 Outlook in a Big Boost for AI Demand Hopes", "summary": "tsmc raises 2025 outlook in a big boost for ai demand hopes (bloomberg) -- taiwan semiconductor manufacturing co. raised its outlook for 2025 revenue growth, shoring up investors’ confidence in the momentum of the global ai spending spree.most read from bloombergthe dutch intersection is coming to save your lifeadvocates fear us agents are using ‘wellness checks’ on children as a prelude to arrestsla homelessness drops for second yearmanhattan, chicago murder rates drop in 2025, officials saythe world’s biggest contract chipmaker on thursday forecast sal", "provider": "Bloomberg"}, "9": {"title": "TSMC Just Reignited the AI Boom -- Here's What Wall Street Missed", "summary": "tsmc just reignited the ai boom -- here's what wall street missed chip giant lifts forecast, crushes earnings, and signals the ai data center spree is nowhere near done", "provider": "GuruFocus.com"}}, "Palantir Technologies Inc.": {"0": {"title": "Billionaire Stanley Druckenmiller Sold His Entire Stake in Palantir and Has Loaded Up on These 2 Exceptional Stocks for 3 Consecutive Quarters", "summary": "billionaire stanley druckenmiller sold his entire stake in palantir and has loaded up on these 2 exceptional stocks for 3 consecutive quarters duquesne family office's billionaire chief dumped his fund's stake in wall street's artificial intelligence (ai) darling in favor of two reasonably cheap stocks that have taken off in recent years.", "provider": "Motley Fool"}, "1": {"title": "PLTR: Palantir Soars to All-Time High on AI Momentum", "summary": "pltr: palantir soars to all-time high on ai momentum palantir stock jumps to historic high before earnings", "provider": "GuruFocus.com"}, "2": {"title": "Mizuho Sees New Upside in Palantir Growth", "summary": "mizuho sees new upside in palantir growth upgrade to neutral follows stronger execution across key segments", "provider": "GuruFocus.com"}, "3": {"title": "Why Market Leader Watchlists Are For More Than Just Stock Shopping", "summary": "why market leader watchlists are for more than just stock shopping how a watchlist of top stocks can help monitor trends and risk — even if you're not investing in them.", "provider": "Investor's Business Daily"}, "4": {"title": "Why BigBear.ai Stock Is Skyrocketing Today", "summary": "why bigbear.ai stock is skyrocketing today bigbear.ai stock is surging thursday amid a day of bullish momentum for the broader market.  while there haven't been any major new developments for the company, investors are continuing to bet on defense artificial intelligence (ai) stocks.  the company's share price was up 13.6% as of 2 p.m. et amid a 0.5% jump for the s&p 500 (snpindex: ^gspc) and a 0.7% jump for the nasdaq composite (nasdaqindex: ^ixic).", "provider": "Motley Fool"}, "5": {"title": "Palantir Technologies (PLTR) Advances Federal And Clinical AI Solutions With New Collaborations", "summary": "palantir technologies (pltr) advances federal and clinical ai solutions with new collaborations palantir technologies (pltr) has recently forged partnerships with knightscope inc. for entry into the u.s. federal marketplace and with velocity clinical research to enhance clinical trial efficiency. these collaborations coincide with the company's 61% share price increase over the past quarter. this rise aligns with palantir's heightened revenue growth guidance and positive earnings report, which showed increased sales and net income. amid a generally buoyant stock market, where the nasdaq...", "provider": "Simply Wall St."}, "6": {"title": "As Palantir Makes a Big Bet on AI-Powered Weather, Is PLTR Stock a Buy, Sell, or Hold?", "summary": "as palantir makes a big bet on ai-powered weather, is pltr stock a buy, sell, or hold? palantir is getting in on the weather business, and it may be a bigger deal than you think.", "provider": "Barchart"}, "7": {"title": "3 Unusually Active Cash-Secured Puts in Quality Companies for Attractive Income", "summary": "3 unusually active cash-secured puts in quality companies for attractive income there were 433 unusually active put options on wednesday, including 34 with vol/oi ratios of 10.0 or more. many were higher-risk, money-losing businesses. however, there were three quality companies worth selling cash-secured puts for attractive income.", "provider": "Barchart"}, "8": {"title": "Palantir Hits New High Ahead Of Q2 Earnings Report", "summary": "palantir hits new high ahead of q2 earnings report palantir stock on thursday hit an all-time high ahead of its second quarter earnings report on aug. 4. palantir has advanced over 100% in 2025.", "provider": "Investor's Business Daily"}, "9": {"title": "Knightscope Joins Palantir's FedStart Program To Expand Federal AI Security Solutions", "summary": "knightscope joins palantir's fedstart program to expand federal ai security solutions knightscope inc. (nasdaq:kscp) has signed a two-year agreement with palantir technologies inc. (nasdaq:pltr) to join palantir’s fedstart program. the agreement aims to expand knightscope’s presence in the u.s. federal market, particularly in national security and public safety. the partnership provides knightscope access to essential accreditations, including fedramp high and dod impact level 5, enabling secure operations in federal environments. knightscope will also receive support for authori", "provider": "Benzinga"}}, "RTX Corporation": {"0": {"title": "RTX, Boeing to Benefit From Defense Demand, Improved Supply Chains, Morgan Stanley Says", "summary": "rtx, boeing to benefit from defense demand, improved supply chains, morgan stanley says rtx (rtx) and boeing (ba) are poised to benefit as supply chain constraints ease, aircraft productio", "provider": "MT Newswires"}, "1": {"title": "AAR Q4 Earnings Surpass Estimates, Sales Increase Year Over Year", "summary": "aar q4 earnings surpass estimates, sales increase year over year air posts strong q4 with eps up 31.8% and sales jumping 14.9%, fueled by improved operating margin.", "provider": "Zacks"}, "2": {"title": "Should You Buy, Sell or Hold RTX Stock Ahead of Q2 Earnings Release?", "summary": "should you buy, sell or hold rtx stock ahead of q2 earnings release? rtx faces mixed signals ahead of q2 earnings, with solid sales momentum offset by valuation and low roe concerns.", "provider": "Zacks"}, "3": {"title": "Seeking Clues to RTX (RTX) Q2 Earnings? A Peek Into Wall Street Projections for Key Metrics", "summary": "seeking clues to rtx (rtx) q2 earnings? a peek into wall street projections for key metrics besides wall street's top-and-bottom-line estimates for rtx (rtx), review projections for some of its key metrics to gain a deeper understanding of how the company might have fared during the quarter ended june 2025.", "provider": "Zacks"}, "4": {"title": "1 Cash-Producing Stock with Competitive Advantages and 2 to Avoid", "summary": "1 cash-producing stock with competitive advantages and 2 to avoid while strong cash flow is a key indicator of stability, it doesn’t always translate to superior returns. some cash-heavy businesses struggle with inefficient spending, slowing demand, or weak competitive positioning.", "provider": "StockStory"}, "5": {"title": "Lockheed Q2 Earnings on the Horizon: Buy or Sell Ahead of Results?", "summary": "lockheed q2 earnings on the horizon: buy or sell ahead of results? lmt's q2 sales are likely to have risen across all segments, but dismal earnings expectations and weak price performance raise caution.", "provider": "Zacks"}, "6": {"title": "The Zacks Analyst Blog Highlights GE Aerospace, RTX and Howmet Aerospace", "summary": "the zacks analyst blog highlights ge aerospace, rtx and howmet aerospace ge is poised for a q2 beat as engine demand, defense strength, and portfolio reshaping fuel 19% eps growth.", "provider": "Zacks"}, "7": {"title": "Should GE Aerospace Stock be in Your Portfolio Pre-Q2 Earnings?", "summary": "should ge aerospace stock be in your portfolio pre-q2 earnings? ge stock soars 43.8% in three months as q2 earnings approach, fueled by engine demand and defense strength.", "provider": "Zacks"}, "8": {"title": "RTX (RTX) Surpasses Market Returns: Some Facts Worth Knowing", "summary": "rtx (rtx) surpasses market returns: some facts worth knowing the latest trading day saw rtx (rtx) settling at $149.28, representing a +1.64% change from its previous close.", "provider": "Zacks"}, "9": {"title": "RTX's Raytheon Unit Secures a Contract to Aid RAM GMLS Program", "summary": "rtx's raytheon unit secures a contract to aid ram gmls program raytheon's $74 million contract win boosts rtx's missile defense role as ram gmls expands global naval deployment.", "provider": "Zacks"}}, "Home Depot, Inc. (The)": {"0": {"title": "The Zacks Analyst Blog Highlights Exxon Mobil, Home Depot, IBM and Friedman Industries", "summary": "the zacks analyst blog highlights exxon mobil, home depot, ibm and friedman industries xom, hd, ibm, and frd show resilience with production, digital strategy, ai growth, and capital discipline amid macro headwinds.", "provider": "Zacks"}, "1": {"title": "This REIT Stock, A Fund Favorite, Offers A Constantly Growing Yield", "summary": "this reit stock, a fund favorite, offers a constantly growing yield for income investors, fund favorite netstreit is a strong reit stock to consider with a 4.8% yield that is constantly growing.", "provider": "Investor's Business Daily"}, "2": {"title": "Better Stock to Buy Right Now: Costco vs. Home Depot", "summary": "better stock to buy right now: costco vs. home depot with an unmatched customer value proposition, costco continues to grow its same-store sales.  demand for home depot’s wares has taken a hit, but management is making moves to grow its business with professional contractors and tradespeople.  two top retail companies that come to mind are costco (nasdaq: cost) and home depot (nyse: hd).", "provider": "Motley Fool"}, "3": {"title": "Q1 Rundown: Home Depot (NYSE:HD) Vs Other Home Furnishing and Improvement Retail Stocks", "summary": "q1 rundown: home depot (nyse:hd) vs other home furnishing and improvement retail stocks looking back on home furnishing and improvement retail stocks’ q1 earnings, we examine this quarter’s best and worst performers, including home depot (nyse:hd) and its peers.", "provider": "StockStory"}, "4": {"title": "Top Analyst Reports for Exxon Mobil, Home Depot & IBM", "summary": "top analyst reports for exxon mobil, home depot & ibm xom, hd, and ibm face distinct macro pressures, but ai, permian strength, and digital upgrades continue to fuel long-term growth.", "provider": "Zacks"}, "5": {"title": "How A Negative Outlook On Home Depot Stock Can Turn Into A Profit", "summary": "how a negative outlook on home depot stock can turn into a profit home depot stock dropped more than 3% tuesday, painting a fairly negative picture. here's one way to profit from this retail giant.", "provider": "Investor's Business Daily"}, "6": {"title": "1 Dow Jones Stock to Target This Week and 2 to Avoid", "summary": "1 dow jones stock to target this week and 2 to avoid while the dow jones (^dji) represents industry leaders, not every stock in the index is a safe bet. some are facing headwinds like declining demand, rising costs, or disruptive new competitors.", "provider": "StockStory"}, "7": {"title": "Here's Why Home Depot (HD) Fell More Than Broader Market", "summary": "here's why home depot (hd) fell more than broader market home depot (hd) reached $358.64 at the closing of the latest trading day, reflecting a -3.1% change compared to its last close.", "provider": "Zacks"}, "8": {"title": "Stocks Fade as Expectations are Trimmed for Fed Rate Cut in September", "summary": "stocks fade as expectations are trimmed for fed rate cut in september the s&p 500 index ($spx ) (spy ) on tuesday closed down -0.40%, the dow jones industrials index ($dowi ) (dia ) closed down -0.98%, and the nasdaq 100 index ($iuxx ) (qqq ) closed up +0.13%. september e-mini s&p futures (esu25 ) fell -0.50%, and september e-mini nasdaq futures...", "provider": "Barchart"}, "9": {"title": "Why You Should Be Investing in Coca-Cola, Home Depot and 6 More of Your Favorite Brands", "summary": "why you should be investing in coca-cola, home depot and 6 more of your favorite brands here are some of the reasons why you may want to consider investing in the stocks of your favorite brands.", "provider": "GOBankingRates"}}, "Netflix, Inc.": {"0": {"title": "Why Netflix might want to 'pivot' to take on YouTube", "summary": "why netflix might want to 'pivot' to take on youtube netflix (nflx) stock is sliding despite topping second quarter estimates and raising full-year guidance. citi managing director jason bazinet joins market catalysts to explain why he has a neutral rating on the stock and to discuss the different avenues netflix could take to continue growing. to watch more expert insights and analysis on the latest market action, check out more market catalysts&nbsp;here.", "provider": "Yahoo Finance Video"}, "1": {"title": "Waller calls for rate cut, GENIUS Act, Netflix earnings: 3 Things", "summary": "waller calls for rate cut, genius act, netflix earnings: 3 things here are some of the latest stories wall street is watching on friday, july 18. federal reserve chair jerome powell is defending the fed’s $2.5 billion headquarters renovation amid criticism from the white house. it comes as federal reserve governor christopher waller made a call for the central bank to cut rates at its july meeting. president trump is set to sign the genius act, creating a stablecoin regulatory framework. netflix (nflx) topped wall street’s revenue and earnings estimates and raised its full-year revenue guidance, though shares slipped slightly after a big recent rally. to watch more expert insights and analysis on the latest market action, check out more morning brief: market sunrise here.", "provider": "Yahoo Finance Video"}, "2": {"title": "Netflix Falls, But Q2 Called Warmup For Big Content Release Period", "summary": "netflix falls, but q2 called warmup for big content release period netflix stock analysts are looking past the streaming video leader's modest second-quarter beat to a brighter second half of 2025.", "provider": "Investor's Business Daily"}, "3": {"title": "Stock Market Today: Dow In The Red As Tariff Concerns Crop Up; AI Play Soars (Live Coverage)", "summary": "stock market today: dow in the red as tariff concerns crop up; ai play soars (live coverage) the dow jones industrial average pared its loss but remained in the red on friday afternoon, with tariff concerns resurfacing as president donald trump reportedly pushes for steeper levies from the european union.  decliners on the stock market today included american express and netflix.  the dow was off 0.4%, trimming its decline to roughly 190 points.", "provider": "Investor's Business Daily"}, "4": {"title": "Netflix Positioned for 'Strong Launch Point' in 2026, UBS Says", "summary": "netflix positioned for 'strong launch point' in 2026, ubs says netflix (nflx) reported late thursday q2 results that were better-than-expected and raised its full-", "provider": "MT Newswires"}, "5": {"title": "Today's Market: Dow Falls Sharply After Trump Seeks Massive EU Levies", "summary": "today's market: dow falls sharply after trump seeks massive eu levies stocks retreat on trump's aggressive eu tariff plan", "provider": "GuruFocus.com"}, "6": {"title": "These Stocks Are Moving the Most Today: Netflix, Sarepta, Amex, Norfolk Southern, Interactive Brokers, Talen, Schwab, and More", "summary": "these stocks are moving the most today: netflix, sarepta, amex, norfolk southern, interactive brokers, talen, schwab, and more second-quarter profit jumps 46% at netflix, while a report says union pacific is in early-stage talks to buy smaller railroad rival norfolk southern.", "provider": "Barrons.com"}, "7": {"title": "Netflix Earnings Show That YouTube Is the Streamer to Fear", "summary": "netflix earnings show that youtube is the streamer to fear the streaming company has survived an onslaught of well-heeled competition from disney, amazon, apple, and more.", "provider": "Barrons.com"}, "8": {"title": "Nvidia Rally Shows Signs of Overheating as Gains Blow Past 80%", "summary": "nvidia rally shows signs of overheating as gains blow past 80% (bloomberg) -- nvidia corp. traders keep getting reasons to buy the stock, but the breakneck rally is showing signs of overheating.most read from bloombergthe dutch intersection is coming to save your lifemumbai facelift is inspired by 200-year-old new york blueprintadvocates fear us agents are using ‘wellness checks’ on children as a prelude to arrestsla homelessness drops for second yearmanhattan, chicago murder rates drop in 2025, officials saythe chipmaker’s 14-day relative strength index br", "provider": "Bloomberg"}, "9": {"title": "Netflix (NFLX) Completes US$18 Billion Buyback; Reports Strong Q2 Earnings Growth", "summary": "netflix (nflx) completes us$18 billion buyback; reports strong q2 earnings growth netflix (nflx) saw a notable 31% increase in its share price over the last quarter, a move that aligns somewhat with the positive broader market trends. key drivers included the company's share buyback program, where it repurchased 1.5 million shares, and strong second-quarter earnings results showing increased sales and net income. despite a 5% drop following the earnings announcement, the stock remains buoyant, benefiting from an improved revenue outlook and the market's overall optimism...", "provider": "Simply Wall St."}}, "Coinbase Global, Inc.": {"0": {"title": "Trump signs stablecoin bill into law, capping string of 'Crypto Week' victories", "summary": "trump signs stablecoin bill into law, capping string of 'crypto week' victories president trump signed into law a bill that establishes the first federal framework for dollar-backed stablecoins, a major victory for an industry that has pushed for more favorable oversight in washington, d.c.", "provider": "Yahoo Finance"}, "1": {"title": "OpenAI gets Wall Street attention, crypto craze rages on: Opening Bid top takeaways", "summary": "openai gets wall street attention, crypto craze rages on: opening bid top takeaways the market's in search of its next big thing.", "provider": "Yahoo Finance"}, "2": {"title": "Chevron-Hess deal, BP, crypto stocks: Trending Tickers", "summary": "chevron-hess deal, bp, crypto stocks: trending tickers chevron (cvx) gets the green light to move forward with its $53 billion acquisition of hess (hes), after an arbitration panel rejected exxonmobil's (xom) claim in a dispute over assets in guyana. bp (bp) is offloading its us onshore wind business to lls power, signaling a shift back toward oil and gas. crypto-related exchanges coinbase (coin) and robinhood (hood) are rising as president trump prepares to sign a stablecoin regulation bill, the genius act, into law. to watch more expert insights and analysis on the latest market action, check out more morning brief: market sunrise here.", "provider": "Yahoo Finance Video"}, "3": {"title": "Stocks to Watch Recap: Chevron, Amex, 3M, Robinhood", "summary": "stocks to watch recap: chevron, amex, 3m, robinhood ↘️ chevron (cvx): an arbitration panel cleared the way for chevron to close its $53 billion purchase of hess, after exxon mobil (xom) tried to pre-empt the deal. chevron stock rallied early, then pared gains and turned 0.", "provider": "The Wall Street Journal"}, "4": {"title": "Crypto sector breaches $4 trillion in market value during pivotal week", "summary": "crypto sector breaches $4 trillion in market value during pivotal week (reuters) -the crypto sector's market value hit $4 trillion on friday, according to coingecko, marking a milestone that reflects its shift from a nascent asset class to a central part of the global investment landscape.  a wave of renewed optimism, regulatory clarity in key markets and rising institutional flows have catapulted the crypto sector to a new valuation peak.  the u.s. house of representatives passed a bill on thursday to create a regulatory framework for u.s.-dollar-pegged cryptocurrency tokens, known as stablecoins, sending the bill to president donald trump, who is expected to sign it into law.", "provider": "Reuters"}, "5": {"title": "Trump Signs GENIUS Act Into Law, Elevating First Major Crypto Effort to Become Policy", "summary": "trump signs genius act into law, elevating first major crypto effort to become policy president donald trump made it official during a white house ceremony, affixing a signature to the stablecoin regulation bill before a crowd of crypto insiders.", "provider": "CoinDesk"}, "6": {"title": "Coinbase Stock and Robinhood Rise After Crypto Bill Victory. MicroStrategy and Block Also on the Move.", "summary": "coinbase stock and robinhood rise after crypto bill victory. microstrategy and block also on the move. shares of  coinbase global  and  robinhood markets  rallied friday on the heels of a regulatory win that could usher in the wider adoption of cryptocurrencies in the u.s.  house representatives passed the clarity act in a 294-134 vote on thursday.  the bill establishes a regulatory framework for digital assets by distinguishing between securities and commodities and assigning oversight responsibilities to the securities and exchange commission and commodity futures trading commission accordingly.", "provider": "Barrons.com"}, "7": {"title": "Coinbase, Robinhood stocks hit all-time highs as Trump set to sign key legislation", "summary": "coinbase, robinhood stocks hit all-time highs as trump set to sign key legislation coinbase and robinhood are among the leading trading platforms listing cryptocurrencies.", "provider": "TheStreet"}, "8": {"title": "Why Coinbase (COIN) Stock Is Trading Up Today", "summary": "why coinbase (coin) stock is trading up today shares of blockchain infrastructure company coinbase (nasdaq:coin) jumped 3.8% in the afternoon session after the broader cryptocurrency market rallied as the u.s. house of representatives passed three crypto-related bills, including the genius act, which aims to create a regulatory framework for stablecoins.", "provider": "StockStory"}, "9": {"title": "Podcast: After House Passes Crypto Bills, What Happens Next?", "summary": "podcast: after house passes crypto bills, what happens next? the house of representatives passed three bills thursday aimed to set up regulations for cryptocurrencies. one of the bills included standards for stablecoin and is set to become the first u.s. crypto legislation once president trump signs it into law, as he indicated he would.", "provider": "The Wall Street Journal"}}, "Robinhood Markets, Inc.": {"0": {"title": "Trump signs stablecoin bill into law, capping string of 'Crypto Week' victories", "summary": "trump signs stablecoin bill into law, capping string of 'crypto week' victories president trump signed into law a bill that establishes the first federal framework for dollar-backed stablecoins, a major victory for an industry that has pushed for more favorable oversight in washington, d.c.", "provider": "Yahoo Finance"}, "1": {"title": "Chevron-Hess deal, BP, crypto stocks: Trending Tickers", "summary": "chevron-hess deal, bp, crypto stocks: trending tickers chevron (cvx) gets the green light to move forward with its $53 billion acquisition of hess (hes), after an arbitration panel rejected exxonmobil's (xom) claim in a dispute over assets in guyana. bp (bp) is offloading its us onshore wind business to lls power, signaling a shift back toward oil and gas. crypto-related exchanges coinbase (coin) and robinhood (hood) are rising as president trump prepares to sign a stablecoin regulation bill, the genius act, into law. to watch more expert insights and analysis on the latest market action, check out more morning brief: market sunrise here.", "provider": "Yahoo Finance Video"}, "2": {"title": "Square Parent Block Jumps On S&P 500 News; Robinhood Snubbed Yet Again", "summary": "square parent block jumps on s&p 500 news; robinhood snubbed yet again square-parent block will join the s&p 500 before wednesday's open. block stock jumped. robinhood and applovin were snubbed yet again.", "provider": "Investor's Business Daily"}, "3": {"title": "Stocks to Watch Recap: Chevron, Amex, 3M, Robinhood", "summary": "stocks to watch recap: chevron, amex, 3m, robinhood ↘️ chevron (cvx): an arbitration panel cleared the way for chevron to close its $53 billion purchase of hess, after exxon mobil (xom) tried to pre-empt the deal. chevron stock rallied early, then pared gains and turned 0.", "provider": "The Wall Street Journal"}, "4": {"title": "Crypto sector breaches $4 trillion in market value during pivotal week", "summary": "crypto sector breaches $4 trillion in market value during pivotal week (reuters) -the crypto sector's market value hit $4 trillion on friday, according to coingecko, marking a milestone that reflects its shift from a nascent asset class to a central part of the global investment landscape.  a wave of renewed optimism, regulatory clarity in key markets and rising institutional flows have catapulted the crypto sector to a new valuation peak.  the u.s. house of representatives passed a bill on thursday to create a regulatory framework for u.s.-dollar-pegged cryptocurrency tokens, known as stablecoins, sending the bill to president donald trump, who is expected to sign it into law.", "provider": "Reuters"}, "5": {"title": "Coinbase Stock and Robinhood Rise After Crypto Bill Victory. MicroStrategy and Block Also on the Move.", "summary": "coinbase stock and robinhood rise after crypto bill victory. microstrategy and block also on the move. shares of  coinbase global  and  robinhood markets  rallied friday on the heels of a regulatory win that could usher in the wider adoption of cryptocurrencies in the u.s.  house representatives passed the clarity act in a 294-134 vote on thursday.  the bill establishes a regulatory framework for digital assets by distinguishing between securities and commodities and assigning oversight responsibilities to the securities and exchange commission and commodity futures trading commission accordingly.", "provider": "Barrons.com"}, "6": {"title": "Why Robinhood (HOOD) Stock Is Up Today", "summary": "why robinhood (hood) stock is up today shares of financial services company robinhood (nasdaq:hood) jumped 4.3% in the afternoon session after the house passed the genius act, a bill aimed at providing regulatory guidelines for the cryptocurrency market.", "provider": "StockStory"}, "7": {"title": "Robinhood, AppLovin Could Soon Join S&P 500 as Hess Deal Creates Opening in Index", "summary": "robinhood, applovin could soon join s&p 500 as hess deal creates opening in index there has been ongoing speculation that  robinhood  and  applovin  could join the  because they are the largest u.s. companies based on market capitalization that aren’t already in the benchmark index.  applovin is valued at $123 billion and robinhood at $93 billion.  both stocks were higher in early trading friday, with applovin up 2.5% at $373 and robinhood 4.4% higher at $110.", "provider": "Barrons.com"}, "8": {"title": "'You Never Want To Take The Highest Offer': Robinhood CEO's AI Startup Raises $100M, Hits $875M Valuation With Backing From Kleiner Perkins", "summary": "'you never want to take the highest offer': robinhood ceo's ai startup raises $100m, hits $875m valuation with backing from kleiner perkins robinhood (nasdaq:hood) ceo vlad tenev is stepping beyond trading apps with a new venture: harmonic ai, a startup aiming to create what it calls \"mathematical superintelligence.\" the company last month announced the closing of a $100 million series b funding round, bringing its valuation to $875 million. tenev co-founded palo alto-based harmonic in 2023 alongside ceo tudor achim, a former executive at autonomous driving company helm.ai. though he is not running the company day to day, tenev serv", "provider": "Benzinga"}, "9": {"title": "3 Crypto Stocks to Watch as the House Passes the GENIUS Act", "summary": "3 crypto stocks to watch as the house passes the genius act glxy, hood and riot rally as the genius act clears the house, setting the stage for sweeping u.s. stablecoin regulation.", "provider": "Zacks"}}}