{"Microsoft": {"0": {"title": "Nvidia becomes first company to close above $4 trillion mark", "summary": "nvidia becomes first company to close above $4 trillion mark nvidia became the first company to close above the $4 trillion mark on thursday.", "provider": "Yahoo Finance"}, "1": {"title": "He Worked At Microsoft, Amperity And Apptio — Now His 9-Person Startup Just Sold Technology To Intuit To Transform Mid-Market Sales [CORRECTED]", "summary": "he worked at microsoft, amperity and apptio — now his 9-person startup just sold technology to intuit to transform mid-market sales [corrected] editor's note: this article has been updated to reflect intuit's business relationship with relevvo. intuit (nasdaq:intu) has just acquired technology from relevvo, a small seattle startup that built an ai platform designed to help business-to-business companies find and connect with high-intent buyers faster than traditional sales methods allow. relevvo said in the blog post announcing the deal that its technology will enhance intuit's ability to serve mid-market customers with greater precisio", "provider": "Benzinga"}, "2": {"title": "Cloud AI Update - Presidio Partners With AWS To Advance AI Innovation", "summary": "cloud ai update - presidio partners with aws to advance ai innovation presidio has been recognized as a partner innovation alliance partner within the aws generative ai innovation center, emphasizing its leadership in ai innovation through strategic collaboration with amazon web services. this partnership highlights presidio's capabilities in advancing generative ai solutions for complex business challenges, assisting organizations in achieving real-world applications through collaboration with aws's ai/ml experts. by participating in this initiative, presidio...", "provider": "Simply Wall St."}, "3": {"title": "Nvidia Shows Why It Is Still A Magnificent Seven Name", "summary": "nvidia shows why it is still a magnificent seven name nvidia stock showed why it's still king, by putting itself in a league of its own wednesday.  the ibd sector leader reached a milestone that no other publicly traded company has done before — hitting a market capitalization of $4 trillion.  it bypassed valuations for fellow magnificent seven names microsoft and apple, which are both over $3 trillion.", "provider": "Investor's Business Daily"}, "4": {"title": "Warren Buffett Doesn't Own Nvidia — But His 3 Picks Are Better", "summary": "warren buffett doesn't own nvidia — but his 3 picks are better it's tempting to look enviously at investors who own nvidia. but warren buffett can take comfort that he's doing on some s&p 500 picks.", "provider": "Investor's Business Daily"}, "5": {"title": "Accenture, Microsoft join forces to develop AI-driven cybersecurity solutions", "summary": "accenture, microsoft join forces to develop ai-driven cybersecurity solutions the partnership seeks to help organisations tackle advanced threats, optimise technology tools, and lower operational costs.", "provider": "Retail Banker International"}, "6": {"title": "Improved Demand for Azure Services Boosted Microsoft (MSFT) in Q2", "summary": "improved demand for azure services boosted microsoft (msft) in q2 mar vista investment partners, llc, an investment management company, released its “mar vista u.s. quality premier strategy” second-quarter 2025 investor letter. a copy of the letter can be downloaded here. the first half of 2025 concluded on a remarkable note, with u.s. stocks bouncing back from earlier volatility to reach new record highs. the s&p […]", "provider": "Insider Monkey"}, "7": {"title": "Is This Magnificent 7 Stock Still Worth the Hype in 2025?", "summary": "is this magnificent 7 stock still worth the hype in 2025? meta has enjoyed its time in the spotlight. does the mega-cap tech stock have any star power left?", "provider": "Barchart"}, "8": {"title": "Accenture, Microsoft partner to tackle cyber threats with AI", "summary": "accenture, microsoft partner to tackle cyber threats with ai the partnership will enhance cybersecurity with solutions in soc modernisation, data security, migration, and identity management.", "provider": "Verdict"}, "9": {"title": "Top Mutual Fund Boosts Returns Focusing On 'Company Not Country'", "summary": "top mutual fund boosts returns focusing on 'company not country' the marsico global fund gives co-manager james \"jimmy\" marsico the freedom to scout the globe for the best stocks for a top mutual fund.", "provider": "Investor's Business Daily"}}, "Nvidia": {"0": {"title": "What's next for Nvidia? CEO Jensen Huang spotted at WH", "summary": "what's next for nvidia? ceo jensen huang spotted at wh nvidia (nvda) ceo was spotted by various reporters at the white house on thursday, which could be the catalyst for the artificial intelligence (ai) chipmaker ahead of its earnings report. yahoo finance tech editor dan howley breaks down the latest. to watch more expert insights and analysis on the latest market action, check out more morning brief here.", "provider": "Yahoo Finance Video"}, "1": {"title": "Nvidia becomes first company to close above $4 trillion mark", "summary": "nvidia becomes first company to close above $4 trillion mark nvidia became the first company to close above the $4 trillion mark on thursday.", "provider": "Yahoo Finance"}, "2": {"title": "Nvidia has 2 big 'upside opportunities' fueling long-term growth", "summary": "nvidia has 2 big 'upside opportunities' fueling long-term growth nvidia's (nvda) future still looks bright with new artificial intelligence (ai), robotics, and software opportunities on the horizon. yahoo finance technology editor dan howley and technalysis research president bob o'donnell join market domination to explain why nvidia still has an edge despite growing competition from advanced micro devices (amd) and other tech giants building their own chips. to watch more expert insights and analysis on the latest market action, check out more market domination&nbsp;here.", "provider": "Yahoo Finance Video"}, "3": {"title": "Vertiv falls, Autodesk & PTC deal reports, Intel's Mobileye stake", "summary": "vertiv falls, autodesk & ptc deal reports, intel's mobileye stake here are some of the stories wall street is watching on thursday, july 10. vertiv (vrt) shares are falling after amazon web services (amzn) announced its own cooling system designed for nvidia's high-performance ai systems. autodesk (adsk) is seeing its stock slip on a bloomberg report that the company is considering buying ptc (ptc). mobileye (mbly) is trading slightly lower after intel (intc) unloaded part of its stake in the company. stay up to date on the latest market action, minute-by-minute, with yahoo finance's market minute.", "provider": "Yahoo Finance Video"}, "4": {"title": "Nvidia captures the market zeitgeist, WK Kellogg bakes up a big deal, and Delta soars: Opening Bid takeaways", "summary": "nvidia captures the market zeitgeist, wk kellogg bakes up a big deal, and delta soars: opening bid takeaways there is more happening in markets right now than nvidia hitting a bit milestone.", "provider": "Yahoo Finance"}, "5": {"title": "Stock Market Today: Dow Falls 200 Points On Trump Tariff News; Nvidia, Palantir Lead Nasdaq 100 (Live Coverage)", "summary": "stock market today: dow falls 200 points on trump tariff news; nvidia, palantir lead nasdaq 100 (live coverage) the dow jones index dropped 300 points friday on trump tariff news. nvidia-backed coreweave tumbled.", "provider": "Investor's Business Daily"}, "6": {"title": "Nvidia Hits Record High After CEO Meets with Trump", "summary": "nvidia hits record high after ceo meets with trump nvidia ceo jensen huang met with president trump at the white house yesterday. the meeting is just days before huang leaves for china. he has been vocal about the need for us companies to access the world's largest semiconductor market. mandeep singh of bloomberg intelligence joins bloomberg open interest with the latest details.", "provider": "Bloomberg"}, "7": {"title": "Alibaba Risks Deepening $100 Billion Rout as Turf War Heats Up", "summary": "alibaba risks deepening $100 billion rout as turf war heats up (bloomberg) -- a protracted battle in china’s food-delivery market has chopped $100 billion in market value from alibaba group holding ltd., with no end in sight for damage to profits and investor confidence.most read from bloombergsinger akon’s failed futuristic city in senegal ends up a $1 billion resortwhy did cars get so hard to see out of?are tourists ruining europe? how locals are pushing backcan americans just stop building new highways?how german cities are rethinking women’s safety — wi", "provider": "Bloomberg"}, "8": {"title": "Nvidia CEO Meets Trump Ahead of China Trip", "summary": "nvidia ceo meets trump ahead of china trip nvidia corp. chief executive officer&nbsp;jensen huang&nbsp;met with president&nbsp;donald trump&nbsp;at the white house on thursday, days before a planned trip to china by the head of the world's most valuable chipmaker, according to people familiar with the matter. bloomberg's ed ludlow reports.", "provider": "Bloomberg"}, "9": {"title": "It's No Nvidia, But Top Funds Get 'Fanatical' About This Breakout Stock — Again", "summary": "it's no nvidia, but top funds get 'fanatical' about this breakout stock — again as nvidia earns a $4 trillion market cap and record high, us foods joins nvidia on this elite list as it eyes a breakout.", "provider": "Investor's Business Daily"}}, "Apple": {"0": {"title": "Stock Market Today: Dow Falls 200 Points On Trump Tariff News; Nvidia, Palantir Lead Nasdaq 100 (Live Coverage)", "summary": "stock market today: dow falls 200 points on trump tariff news; nvidia, palantir lead nasdaq 100 (live coverage) the dow jones index dropped 300 points friday on trump tariff news. nvidia-backed coreweave tumbled.", "provider": "Investor's Business Daily"}, "1": {"title": "Alibaba Risks Deepening $100 Billion Rout as Turf War Heats Up", "summary": "alibaba risks deepening $100 billion rout as turf war heats up (bloomberg) -- a protracted battle in china’s food-delivery market has chopped $100 billion in market value from alibaba group holding ltd., with no end in sight for damage to profits and investor confidence.most read from bloombergsinger akon’s failed futuristic city in senegal ends up a $1 billion resortwhy did cars get so hard to see out of?are tourists ruining europe? how locals are pushing backcan americans just stop building new highways?how german cities are rethinking women’s safety — wi", "provider": "Bloomberg"}, "2": {"title": "US Judge drops anti-competitive lawsuit against Apple, Visa, Mastercard", "summary": "us judge drops anti-competitive lawsuit against apple, visa, mastercard the plaintiffs alleged that the companies conspired to prevent competition and caused merchants to incur higher transaction fees.", "provider": "Electronic Payments"}, "3": {"title": "Apple: Citi says June demand pull-in leads to more uncertainties in H2", "summary": "apple: citi says june demand pull-in leads to more uncertainties in h2 investing.com -- apple’s stronger-than-expected june-quarter iphone sales may have come at a cost to the second half of the year, according to a note from citi analysts.", "provider": "Investing.com"}, "4": {"title": "Cloud AI Update - Presidio Partners With AWS To Advance AI Innovation", "summary": "cloud ai update - presidio partners with aws to advance ai innovation presidio has been recognized as a partner innovation alliance partner within the aws generative ai innovation center, emphasizing its leadership in ai innovation through strategic collaboration with amazon web services. this partnership highlights presidio's capabilities in advancing generative ai solutions for complex business challenges, assisting organizations in achieving real-world applications through collaboration with aws's ai/ml experts. by participating in this initiative, presidio...", "provider": "Simply Wall St."}, "5": {"title": "Why This Public-Private Tech Darling Is Currently Among The Best Names To Watch", "summary": "why this public-private tech darling is currently among the best names to watch ubiquiti stock has advanced around 20% in the 2025 stock market with more than 90% of shares in the hands of ceo robert pera.", "provider": "Investor's Business Daily"}, "6": {"title": "Nvidia Shows Why It Is Still A Magnificent Seven Name", "summary": "nvidia shows why it is still a magnificent seven name nvidia stock showed why it's still king, by putting itself in a league of its own wednesday.  the ibd sector leader reached a milestone that no other publicly traded company has done before — hitting a market capitalization of $4 trillion.  it bypassed valuations for fellow magnificent seven names microsoft and apple, which are both over $3 trillion.", "provider": "Investor's Business Daily"}, "7": {"title": "What Gives Apple (AAPL) a Competitive Edge?", "summary": "what gives apple (aapl) a competitive edge? mar vista investment partners, llc, an investment management company, released its “mar vista u.s. quality premier strategy” second-quarter 2025 investor letter. a copy of the letter can be downloaded here. the first half of 2025 concluded on a remarkable note, with u.s. stocks bouncing back from earlier volatility to reach new record highs. the s&p […]", "provider": "Insider Monkey"}, "8": {"title": "Is This Magnificent 7 Stock Still Worth the Hype in 2025?", "summary": "is this magnificent 7 stock still worth the hype in 2025? meta has enjoyed its time in the spotlight. does the mega-cap tech stock have any star power left?", "provider": "Barchart"}, "9": {"title": "Dan Ives Says Apple (AAPL) Must Acquire Perplexity—Here’s Why It’s a ‘No-Brainer’", "summary": "dan ives says apple (aapl) must acquire perplexity—here’s why it’s a ‘no-brainer’ apple inc. (nasdaq:aapl) is one of the ai stocks making waves on wall street. on july 9, wedbush reiterated its “outperform” rating on the stock and maintained its price target at $270.00. the rating affirmation reflects continued confidence in apple’s potential. according to the firm, apple should make the move to acquire perplexity ai inc. so […]", "provider": "Insider Monkey"}}, "Amazon": {"0": {"title": "Nvidia becomes first company to close above $4 trillion mark", "summary": "nvidia becomes first company to close above $4 trillion mark nvidia became the first company to close above the $4 trillion mark on thursday.", "provider": "Yahoo Finance"}, "1": {"title": "Stock Market Today: Dow Falls 200 Points On Trump Tariff News; Nvidia, Palantir Lead Nasdaq 100 (Live Coverage)", "summary": "stock market today: dow falls 200 points on trump tariff news; nvidia, palantir lead nasdaq 100 (live coverage) the dow jones index dropped 300 points friday on trump tariff news. nvidia-backed coreweave tumbled.", "provider": "Investor's Business Daily"}, "2": {"title": "Alphyn Capital Management’s Comments on Amazon.com (AMZN)", "summary": "alphyn capital management’s comments on amazon.com (amzn) alphyn capital management, an investment management firm, released its second-quarter 2025 investor letter. a copy of the letter can be downloaded here. the master account of the fund returned 12.4% net in the second quarter compared to 10.9% for the s&p 500 index. as of the second quarter of 2025, the top ten holdings accounted […]", "provider": "Insider Monkey"}, "3": {"title": "Intel Offloads RealSense as Tesla, Amazon Drive Robotics Gold Rush", "summary": "intel offloads realsense as tesla, amazon drive robotics gold rush intel spins off realsense: $50m bet on the next ai robotics boom", "provider": "GuruFocus.com"}, "4": {"title": "Vertiv Stock Is Falling Again. Amazon Launches a Cooling Competitor for AI Servers.", "summary": "vertiv stock is falling again. amazon launches a cooling competitor for ai servers. shares of  vertiv holdings  a leader in data-center cooling solutions, extended losses friday after  amazon.com  amazon web services announced the development of a new cooling system of its own.  the infrastructure can be installed in new and existing data centers designed for power-hungry artificial-intelligence computing, the company said.  vertiv  stock sank 6% on on thursday, after falling as low as 14% earlier in the session.", "provider": "Barrons.com"}, "5": {"title": "Amazon.com (AMZN) Faces Challenges in AI Leadership", "summary": "amazon.com (amzn) faces challenges in ai leadership longriver investment partners released its “longriver partners fund” second-quarter 2025 investor letter. a copy of the letter can be downloaded here. in the quarter, the fund returned 11.7% (net), bringing the year-to-date return to 11.4%. this compares to the benchmark, the msci ac world usd net index, which returned 11.5% for the quarter and 10.0% […]", "provider": "Insider Monkey"}, "6": {"title": "The Ultimate Growth Stock to Buy With $1,000 Right Now", "summary": "the ultimate growth stock to buy with $1,000 right now amazon is benefiting from growth in ai cloud services and advertising.  the company has $66 billion in cash to use toward future growth.  amazon's stock valuation is at its lowest level in years, making its shares a good value.", "provider": "Motley Fool"}, "7": {"title": "Is This Magnificent 7 Stock Still Worth the Hype in 2025?", "summary": "is this magnificent 7 stock still worth the hype in 2025? meta has enjoyed its time in the spotlight. does the mega-cap tech stock have any star power left?", "provider": "Barchart"}, "8": {"title": "Prediction: These 2 No-Brainer Growth Stocks Will Beat the Market in the Next 10 Years", "summary": "prediction: these 2 no-brainer growth stocks will beat the market in the next 10 years amazon's advertising, cloud computing, and ai businesses provide it with attractive prospects ahead.  shopify should benefit from the expanding e-commerce market thanks to the valuable services it offers.  in my view, that description applies to amazon (nasdaq: amzn) and shopify (nasdaq: shop), two e-commerce leaders.", "provider": "Motley Fool"}, "9": {"title": "Dimon Calls Out Market’s Tariff Complacency. Why Nvidia, Bitcoin Point to a FOMO Trade and 5 Other Things to Know Today.", "summary": "dimon calls out market’s tariff complacency. why nvidia, bitcoin point to a fomo trade and 5 other things to know today. trump allies attack fed’s powell over hq renovation, amazon’s rival to musk’s spacex is deploying satellites, and more news to start your day.", "provider": "Barrons.com"}}, "Alphabet": {"0": {"title": "2 Undervalued AI Stocks Poised for Explosive Growth", "summary": "2 undervalued ai stocks poised for explosive growth these stocks are the rare ai companies trading at a reasonable valuation.", "provider": "Motley Fool"}, "1": {"title": "Cloud AI Update - Presidio Partners With AWS To Advance AI Innovation", "summary": "cloud ai update - presidio partners with aws to advance ai innovation presidio has been recognized as a partner innovation alliance partner within the aws generative ai innovation center, emphasizing its leadership in ai innovation through strategic collaboration with amazon web services. this partnership highlights presidio's capabilities in advancing generative ai solutions for complex business challenges, assisting organizations in achieving real-world applications through collaboration with aws's ai/ml experts. by participating in this initiative, presidio...", "provider": "Simply Wall St."}, "2": {"title": "Do Options Traders Know Something About Alphabet Stock We Don't?", "summary": "do options traders know something about alphabet stock we don't? investors need to pay close attention to googl stock based on the movements in the options market lately.", "provider": "Zacks"}, "3": {"title": "Market Chatter: Alphabet's Google to Give Major Discount on Cloud Computing to US Government", "summary": "market chatter: alphabet's google to give major discount on cloud computing to us government alphabet's (goog, googl) google will give a significant discount on cloud computing services for the", "provider": "MT Newswires"}, "4": {"title": "Uber, Lyft Facing Disruption as Tesla Seeks to Expand Robotaxi Services, Wedbush Says", "summary": "uber, lyft facing disruption as tesla seeks to expand robotaxi services, wedbush says uber technologies (uber) and lyft (lyft) are facing disruption \"slowly, then all at once,\" as tesla", "provider": "MT Newswires"}, "5": {"title": "Is This Magnificent 7 Stock Still Worth the Hype in 2025?", "summary": "is this magnificent 7 stock still worth the hype in 2025? meta has enjoyed its time in the spotlight. does the mega-cap tech stock have any star power left?", "provider": "Barchart"}, "6": {"title": "Protecting Your Alphabet Position as Regulators Close In", "summary": "protecting your alphabet position as regulators close in a deep dive into alphabet's legal landscape, prospects and how a long-term oriented investor can hedge short-term price swings", "provider": "GuruFocus.com"}, "7": {"title": "Social Buzz: Wallstreetbets Stocks Mixed Pre-Bell Friday; Strategy to Advance, Robinhood Markets to Decline", "summary": "social buzz: wallstreetbets stocks mixed pre-bell friday; strategy to advance, robinhood markets to decline the most-talked-about stocks in the reddit subforum wallstreetbets were mixed hours before friday's", "provider": "MT Newswires"}, "8": {"title": "TD Cowen Reiterates Buy on Alphabet (GOOGL) Ahead of Earnings—Here’s Why", "summary": "td cowen reiterates buy on alphabet (googl) ahead of earnings—here’s why alphabet inc. (nasdaq:googl) is one of the ai stocks making waves on wall street. on july 9, td cowen analyst john blackledge reiterated a “buy” rating on the stock with a $195.00 price target. the rating affirmation comes ahead of the company’s second-quarter 2025 earnings report. “goog 2q25 preview: expect solid search & youtube growth amid […]", "provider": "Insider Monkey"}, "9": {"title": "Dan Ives Says Apple (AAPL) Must Acquire Perplexity—Here’s Why It’s a ‘No-Brainer’", "summary": "dan ives says apple (aapl) must acquire perplexity—here’s why it’s a ‘no-brainer’ apple inc. (nasdaq:aapl) is one of the ai stocks making waves on wall street. on july 9, wedbush reiterated its “outperform” rating on the stock and maintained its price target at $270.00. the rating affirmation reflects continued confidence in apple’s potential. according to the firm, apple should make the move to acquire perplexity ai inc. so […]", "provider": "Insider Monkey"}}, "Tesla": {"0": {"title": "Tesla, EV buyers need to act now if they want $7,500 tax credit", "summary": "tesla, ev buyers need to act now if they want $7,500 tax credit buyers interested in a tesla ev or any ev sold in the us need to act fast if they want to secure a federal government tax credit.", "provider": "Yahoo Finance"}, "1": {"title": "Tesla robotaxi, AbbVie licenses Glenmark cancer drug, McDonald's", "summary": "tesla robotaxi, abbvie licenses glenmark cancer drug, mcdonald's yahoo finance anchor julie hyman examines some of the top headlines on wall street on thursday, july 10 in this episode of market minute. tesla (tsla) ceo elon musk says the company plans to expand its robotaxi rollout to san francisco in the coming months. glenmark (glenmark.ns, glenmark.bo) is set to license its cancer drug to abbvie (abbv), sending shares of both companies higher. mcdonald's (mcd) was upgraded to buy from neutral by goldman sachs analysts, saying the fast-food restaurant is well-positioned to serve value-seeking consumers. stay up to date on the latest market action, minute-by-minute, with yahoo finance's market minute.", "provider": "Yahoo Finance Video"}, "2": {"title": "Experts Predict Whether Tesla Stock Can Make You Rich by 2035", "summary": "experts predict whether tesla stock can make you rich by 2035 if you hope to get rich off tesla stock over the next decade, be prepared for periods of volatility. but is it still a good investment for the long term?", "provider": "GOBankingRates"}, "3": {"title": "Bitcoin Pegs Record; ETFs, Miners Basing Ahead Of Crypto Week Legislation Blitz", "summary": "bitcoin pegs record; etfs, miners basing ahead of crypto week legislation blitz the house will consider three digital asset bills during \"crypto week.\" bitcoin notches record above $118,800.", "provider": "Investor's Business Daily"}, "4": {"title": "Tesla Stock Drops. There’s Bad News on Batteries.", "summary": "tesla stock drops. there’s bad news on batteries. panasonic is boosting output less rapidly at a new battery plant in de soto, kansas, according to the nikkei.", "provider": "Barrons.com"}, "5": {"title": "Tesla Q2 Earnings Preview: What to Expect From Upcoming Report", "summary": "tesla q2 earnings preview: what to expect from upcoming report tesla set to post sharp earnings drop: all eyes on q2 results july 23", "provider": "GuruFocus.com"}, "6": {"title": "Uber, Lyft Facing Disruption as Tesla Seeks to Expand Robotaxi Services, Wedbush Says", "summary": "uber, lyft facing disruption as tesla seeks to expand robotaxi services, wedbush says uber technologies (uber) and lyft (lyft) are facing disruption \"slowly, then all at once,\" as tesla", "provider": "MT Newswires"}, "7": {"title": "These Stocks Are Moving the Most Today: Nvidia, MicroStrategy, Boeing, Tesla, Levi Strauss, AMC, and More", "summary": "these stocks are moving the most today: nvidia, microstrategy, boeing, tesla, levi strauss, amc, and more nvidia stock slips after the chip maker ends thursday’s session with a market cap above $4 trillion, while microstrategy and coinbase rise as bitcoin sets a record high of more than $118,000.", "provider": "Barrons.com"}, "8": {"title": "David Sacks Calls Universal Basic Income A Leftist Fantasy. As Trump's AI Czar, He Says 'Everyone On Welfare' Just Isn't Realistic", "summary": "david sacks calls universal basic income a leftist fantasy. as trump's ai czar, he says 'everyone on welfare' just isn't realistic investor david sacks, president donald trump's artificial intelligence czar, is back in the spotlight after blasting the idea of universal basic income and warning against global efforts to regulate ai. he says the growing enthusiasm for ubi is more political fiction than serious policy. sacks: the left’s ai fantasy involves “everyone on welfare” “the future of ai has become a rorschach test where everyone sees what they want,” sacks posted on x on june 3. “the left envisions a post-economic ord", "provider": "Benzinga"}, "9": {"title": "Tesla Aims to Bring Robotaxi to California, Arizona", "summary": "tesla aims to bring robotaxi to california, arizona tesla inc.&nbsp;is aiming to bring its driverless taxis to california and arizona as the carmaker plots an expansion on the heels of last month's limited&nbsp;rollout&nbsp;in austin. ceo elon musk has been under pressure to focus more on the automaker and less on politics. matthew bloxham of bloomberg intelligence has more.", "provider": "Bloomberg"}}}