{"Microsoft": {"0": {"title": "Meta reportedly poaches Apple's AI talent: It's 'do or die'", "summary": "meta reportedly poaches apple's ai talent: it's 'do or die' meta (meta) has reportedly poached a top artificial intelligence (ai) engineer from apple (aapl), according to a report from bloomberg. d.a. davidson's head of technology research, gil luria, and siebert financial's chief investment officer, mark malek, join market catalysts to discuss meta's position in the ai race and where it stands in the competition for the best open-source ai model compared to other \"maximalist\" players, like openai (opai.pvt) and xai (xaai.pvt). to watch more expert insights and analysis on the latest market action, check out more market catalysts here.", "provider": "Yahoo Finance Video"}, "1": {"title": "US government confirms arrest of Chinese national accused of stealing COVID research and mass-hacking email servers", "summary": "us government confirms arrest of chinese national accused of stealing covid research and mass-hacking email servers accused hacker and chinese national xu zewei was arrested in italy at the request of u.s. prosecutors.", "provider": "TechCrunch"}, "2": {"title": "Is Microsoft Stock A Buy In July? What The Fundamentals And Stock Chart Say Now", "summary": "is microsoft stock a buy in july? what the fundamentals and stock chart say now is microsoft stock a buy in july?  microsoft stock remains one of the \"magnificent seven\" tech giants, with 7.43 billion shares outstanding and a stock market value of nearly $3.7 trillion.  first off, should you even pay attention to microsoft stock?", "provider": "Investor's Business Daily"}, "3": {"title": "In a blow to Google Cloud, Replit partners with Microsoft", "summary": "in a blow to google cloud, replit partners with microsoft replit is one of the breakout stars of the vibe coding world. this partnership is a good deal for both companies.", "provider": "TechCrunch"}, "4": {"title": "3 Reasons Why Growth Investors Shouldn't Overlook Microsoft (MSFT)", "summary": "3 reasons why growth investors shouldn't overlook microsoft (msft) microsoft (msft) could produce exceptional returns because of its solid growth attributes.", "provider": "Zacks"}, "5": {"title": "1 Hypergrowth Stock to Buy and Hold Through 2030", "summary": "1 hypergrowth stock to buy and hold through 2030 if you're looking for one hypergrowth stock to buy and hold until 2030, microsoft might be your best bet.", "provider": "Barchart"}, "6": {"title": "3 Reasons to Buy Microsoft Stock Despite 11.7x P/S Premium Valuation", "summary": "3 reasons to buy microsoft stock despite 11.7x p/s premium valuation microsoft's explosive $13b ai revenues surge 175% yoy, justifies 11.76x p/s premium. azure cloud market share gain makes msft a must-buy for 2025.", "provider": "Zacks"}, "7": {"title": "CoreWeave Stock Was a Market Darling. Then These Analysts Downgraded the Shares.", "summary": "coreweave stock was a market darling. then these analysts downgraded the shares. while  coreweave  has gone from strength to strength since its ipo this year, the artificial-intelligence cloud company’s deal to buy data-center infrastructure partner  core scientific  is arousing skepticism on wall street.  coreweave shares have surged fourfold since the march initial public offering, which proved disappointing at first.  it said monday it would acquire core scientific in an all-stock deal to boost its data-center capacity.", "provider": "Barrons.com"}, "8": {"title": "Can Google Cloud's Growing Clientele Push the GOOGL Stock Higher?", "summary": "can google cloud's growing clientele push the googl stock higher? googl is strengthening its competitive position in the search and cloud with the infusion of ai amid challenging macroeconomic conditions.", "provider": "Zacks"}, "9": {"title": "Siemens and Microsoft join forces to enhance IoT", "summary": "siemens and microsoft join forces to enhance iot the collaboration integrates siemens’ digital building platform, building x, with microsoft azure iot operations enabled by azure arc.", "provider": "Verdict"}}, "Nvidia": {"0": {"title": "Why Goldman Sachs and BofA lifted their S&P 500 targets", "summary": "why goldman sachs and bofa lifted their s&p 500 targets goldman sachs (gs) analysts lift their s&p 500 (^gspc) target to 6,600 from 6,100, citing federal reserve rate cuts, bond weakness, and investors' willingness to look past near-term challenges. bank of america (bac) analysts also increased their target, but see little upside from current levels. yahoo finance senior reporter allie canal outlines the top calls on wall street and takes a closer look at valuation in the big tech sector, including names like nvidia (nvda), alphabet (goog, googl), and meta (meta). to watch more expert insights and analysis on the latest market action, check out more morning brief here.", "provider": "Yahoo Finance Video"}, "1": {"title": "The 'new normal' of growth stock dominance", "summary": "the 'new normal' of growth stock dominance the pandemic decade is ushering in a new era of overperformance for large caps and growth stocks.", "provider": "Yahoo Finance"}, "2": {"title": "These Stocks Moved the Most Today: Tesla, Amazon, Moderna, Fair Isaac, Exxon, Sunrun, SoFi, Datadog, and More", "summary": "these stocks moved the most today: tesla, amazon, moderna, fair isaac, exxon, sunrun, sofi, datadog, and more stocks were mixed on tuesday after president donald trump said he wouldn’t delay the date when his tariffs will take effect.  ceo elon musk announced over the weekend that he would form a new political party, and his return to politics prompted investors to sell the stock.  musk strongly opposed trump’s tax-and-spending bill that was signed into law friday.", "provider": "Barrons.com"}, "3": {"title": "Nvidia Stock Rises. Here’s How Far Away It Is From a $4 Trillion Market Value.", "summary": "nvidia stock rises. here’s how far away it is from a $4 trillion market value. the chip maker’s shares have been rallying since late april, putting its valuation on the brink of an all-time high.", "provider": "Barrons.com"}, "4": {"title": "Mistral is reportedly in talks to raise $1B", "summary": "mistral is reportedly in talks to raise $1b french ai startup mistral is in talks to raise up to $1 billion in equity from investors including abu dhabi’s mgx fund, reports bloomberg.", "provider": "TechCrunch"}, "5": {"title": "Recursion Pharmaceuticals (RXRX) Drops on Profit-Taking", "summary": "recursion pharmaceuticals (rxrx) drops on profit-taking recursion pharmaceuticals, inc. (nasdaq:rxrx) is one of the 10 stocks crash hard alongside wall street. recursion pharmaceuticals dropped its share prices by 6.45 percent on monday to close at $4.93 apiece as investors appeared to have booked profits following four straight days of gains. in recent news, the company unveiled boltz-2, touted as the next-generation […]", "provider": "Insider Monkey"}, "6": {"title": "AI Infrastructure Drives $750 Billion in Data Center Investment", "summary": "ai infrastructure drives $750 billion in data center investment the increase in ai expenditures is good news for nvidia, which is the market leader for ai computing hardware and solutions.", "provider": "Barrons.com"}, "7": {"title": "Intel Cuts Over 500 Jobs in Oregon as Part of Layoff Plan", "summary": "intel cuts over 500 jobs in oregon as part of layoff plan (bloomberg) -- intel corp. is cutting more than 500 positions in oregon as part of a layoff plan that’s ultimately expected to affect roughly 20% of the chipmaker’s staff.most read from bloombergare tourists ruining europe? how locals are pushing backcan americans just stop building new highways?denver city hall takes a page from nasaphiladelphia trash piles up as garbage workers’ strike drags onthe oregon job reduction will hit facilities in aloha and hillsboro starting on july 15, intel said i", "provider": "Bloomberg"}, "8": {"title": "Analyst sends bold message on Nvidia stock amid Trump’s new tariffs", "summary": "analyst sends bold message on nvidia stock amid trump’s new tariffs here’s what could be next for nvidia stock.", "provider": "TheStreet"}, "9": {"title": "Jim Cramer has a 'very positive' response to new acquisition deal", "summary": "jim cramer has a 'very positive' response to new acquisition deal nvidia-backed ai cloud company coreweave announced it is acquiring the bitcoin mining firm core scientific.", "provider": "TheStreet"}}, "Apple": {"0": {"title": "Apple names new COO, Jeff Williams to transition out of role", "summary": "apple names new coo, jeff williams to transition out of role apple (aapl) has announced that chief operating officer jeff williams will transition out of his role, though he will be staying with the company until his retirement. sabih khan, apple’s senior vice president of operations, will assume the coo position later this month. yahoo finance tech editor dan howley reports the latest. to watch more expert insights and analysis on the latest market action, check out more asking for a trend here.", "provider": "Yahoo Finance Video"}, "1": {"title": "'Thoughtful' investing is key amid tariff news: BlackRock's Chaudhuri", "summary": "'thoughtful' investing is key amid tariff news: blackrock's chaudhuri earnings optimism may be overdone as tech faces tariff pressure and margin risk. yahoo finance technology editor dan howley and gargi chaudhuri, blackrock's chief investment and portfolio strategist for the americas, join opening bid to weigh the impact of tariffs on apple (aapl) and inflation, and to discuss where investors should be positioned. to watch more expert insights and analysis on the latest market action, check out more opening bid&nbsp;here.", "provider": "Yahoo Finance Video"}, "2": {"title": "Cisco's AI-fueled gains, Apple loses top AI engineer to Meta", "summary": "cisco's ai-fueled gains, apple loses top ai engineer to meta the ai revolution has driven market gains in recent years, with the emerging tech promising productivity gains. morning brief market sunrise host ramzan karmali takes a closer look at two stocks that have benefited from ai-related gains: cisco (csco) and meta (meta). the team also examines recent reports that meta has poached a top executive and ai engineer, ruoming pang, from apple (aapl), according to ac report from bloomberg. check out yahoo finance's interview with cisco's president and chief product officer, jeetu patel, here. to watch more expert insights and analysis on the latest market action, check out more morning brief: market sunrise here.", "provider": "Yahoo Finance Video"}, "3": {"title": "Velvet Latte Anyone? How China’s Luckin Coffee Is Taking on Starbucks.", "summary": "velvet latte anyone? how china’s luckin coffee is taking on starbucks. on thursday morning, chloe chan rode her scooter a couple blocks up from the home she was catsitting at in manhattan to pick up her first iced coconut latte from  luckin coffee  as a consumer of chinese media, chan knew how popular the coffee was in china, so a first taste was a no-brainer for her.  chinese chain luckin coffee opened its first two u.s. stores in new york city’s greenwich village and north of madison square neighborhoods last monday.  since then, the company has rolled out several promotional campaigns including $1.99 cent beverages for first-time customers and a chance for one person to win free daily coffee for a year by downloading the app.", "provider": "Barrons.com"}, "4": {"title": "Apple’s Operations Chief Jeff Williams to Exit This Month", "summary": "apple’s operations chief jeff williams to exit this month apple’s chief operating officer plans to hand the role off this month and retire later this year after roughly a decade as the tech giant’s no. 2 under chief executive tim cook.", "provider": "The Wall Street Journal"}, "5": {"title": "Apple names insider Sabih Khan as COO", "summary": "apple names insider sabih khan as coo apple on tuesday named insider sabih khan as its chief operating officer, taking over from jeff williams, as part of a long-planned succession. khan, who has been with apple for 30 years and is currently the senior vice president of operations, will take on the new role later this month, the iphone maker said in a statement. before joining apple's procurement group in 1995, he worked as an applications development engineer and key account technical leader at ge plastics.", "provider": "Reuters"}, "6": {"title": "Nvidia Stock Rises. Here’s How Far Away It Is From a $4 Trillion Market Value.", "summary": "nvidia stock rises. here’s how far away it is from a $4 trillion market value. the chip maker’s shares have been rallying since late april, putting its valuation on the brink of an all-time high.", "provider": "Barrons.com"}, "7": {"title": "Apple's Top AI Executive Ruoming Pang Departs for Meta's Superintelligence Team", "summary": "apple's top ai executive ruoming pang departs for meta's superintelligence team apple ai leader ruoming pang has left the company to join meta.", "provider": "GuruFocus.com"}, "8": {"title": "Apple's AI Model Executive Shifts to Meta", "summary": "apple's ai model executive shifts to meta apple's ai ambitions take another hit as a key executive in ai models leaves for meta. bloomberg's mark gurman joins caroline hyde on \"bloomberg tech\" to discuss.", "provider": "Bloomberg"}, "9": {"title": "Sector Update: Tech Stocks Rise Late Afternoon", "summary": "sector update: tech stocks rise late afternoon tech stocks rose late tuesday afternoon, with the technology select sector spdr fund (xlk) gaining 0", "provider": "MT Newswires"}}, "Amazon": {"0": {"title": "Walmart ramps up e-commerce to rival Amazon's Prime Day event", "summary": "walmart ramps up e-commerce to rival amazon's prime day event walmart (wmt) is trying to outpace amazon (amzn) this year with \"walmart deals week,\" a six-day savings event (two days longer than amazon's prime day sales event). yahoo finance senior reporter brooke dipalma breaks down walmart's latest push to grow its e-commerce and grocery businesses. to watch more expert insights and analysis on the latest market action, check out more market domination&nbsp;here.", "provider": "Yahoo Finance Video"}, "1": {"title": "CoreWeave double downgrade, Amazon Prime Day spending decline", "summary": "coreweave double downgrade, amazon prime day spending decline yahoo finance's john hyland takes a closer look at what's driving us stock moves on yahoo finance's market minute. us stocks (^dji, ^gspc, ^ixic) are wavering as traders assess trade risk after president trump said he will not extend the august 1 tariff deadline. coreweave (crwv) was double downgraded on wall street after the company announced an all-stock deal with core scientific (corz), with both mizuho and stifel lowering their ratings to neutral. amazon (amzn) saw a 14% decline in early hours sales during day one of its prime day event, according to data from momentum commerce. the company is also extending its event to four days from two last year. stay up to date on the latest market action, minute-by-minute, with yahoo finance's market minute.", "provider": "Yahoo Finance Video"}, "2": {"title": "Amazon Prime Day sales kick off: What investors are watching", "summary": "amazon prime day sales kick off: what investors are watching amazon's (amzn) longest prime day sale is underway, starting tuesday, july 8 and running until friday, july 11. yahoo finance senior reporter allie canal examines amazon stock's price action and what the market could learn about the health of the consumer from the sale. to watch more expert insights and analysis on the latest market action, check out more opening bid here.", "provider": "Yahoo Finance Video"}, "3": {"title": "Retailer check-in: How Trump's new tariffs impact the sector", "summary": "retailer check-in: how trump's new tariffs impact the sector as us president trump announces tariff rates for key trading partners, yahoo finance senior reporter brooke dipalma outlines how retailers like best buy (bby) and lululemon (lulu) are navigating tariff uncertainty, as others like amazon (amzn) and target (tgt) run sales. to watch more expert insights and analysis on the latest market action, check out more morning brief here.", "provider": "Yahoo Finance Video"}, "4": {"title": "Stocks to Watch Recap: Freeport-McMoRan, First Solar, Amazon, Moderna", "summary": "stocks to watch recap: freeport-mcmoran, first solar, amazon, moderna ↗️ freeport-mcmoran (fcx): shares of the copper mining company advanced 2.5% after president trump announced that a 50% tariff was coming on imports of the industrial metal. ↘️ sunrun (run), enphase energy (enph), first solar (fslr): solar stocks fell tuesday after the white house said it would enforce the halt to clean-electricity tax credits faster than expected.", "provider": "The Wall Street Journal"}, "5": {"title": "These Stocks Moved the Most Today: Tesla, Amazon, Moderna, Fair Isaac, Exxon, Sunrun, SoFi, Datadog, and More", "summary": "these stocks moved the most today: tesla, amazon, moderna, fair isaac, exxon, sunrun, sofi, datadog, and more stocks were mixed on tuesday after president donald trump said he wouldn’t delay the date when his tariffs will take effect.  ceo elon musk announced over the weekend that he would form a new political party, and his return to politics prompted investors to sell the stock.  musk strongly opposed trump’s tax-and-spending bill that was signed into law friday.", "provider": "Barrons.com"}, "6": {"title": "A Slow Start to Amazon's Prime Day", "summary": "a slow start to amazon's prime day amazon's prime day kicks off to a slower than expected start as early spending drops 14% compared to 2024. bloomberg's spencer soper joins caroline hyde on \"bloomberg tech\" to discuss the tariff impact on retailers and shoppers.", "provider": "Bloomberg"}, "7": {"title": "GenAI as a shopping assistant set to explode during Prime Day sales", "summary": "genai as a shopping assistant set to explode during prime day sales a new report estimates that ai will be a larger-than-ever part of the online shopping process during amazon’s prime day sale, which began tuesday morning. amazon’s annual sale, which this year spans four days (july 8-11), is predicted to drive $23.8 billion in online spending across u.s. e-commerce retailers, as other businesses run their own […]", "provider": "TechCrunch"}, "8": {"title": "US FTC demands better policing of 'Made in USA' claims, sends warning letters", "summary": "us ftc demands better policing of 'made in usa' claims, sends warning letters (reuters) -the u.s. federal trade commission on tuesday called on amazon.com and walmart to crack down on third-party sellers that make deceptive \"made in usa\" claims on the retailing giants' online marketplaces. in letters to amazon and walmart, the ftc said it had learned of several instances where third-party sellers falsely claimed their products were made in the united states. the ftc urged both companies to take \"corrective action\" against sellers whose \"made in usa\" claims violate federal law and amazon's and walmart's codes of conduct.", "provider": "Reuters"}, "9": {"title": "How Robots Are Helping Amazon Deliver on Prime Day", "summary": "how robots are helping amazon deliver on prime day amazon robotics vice president scott dresser explains how robots are helping amazon employees deliver on prime day. he speaks on \"bloomberg the close.\"", "provider": "Bloomberg"}}, "Alphabet": {"0": {"title": "Meta reportedly poaches Apple's AI talent: It's 'do or die'", "summary": "meta reportedly poaches apple's ai talent: it's 'do or die' meta (meta) has reportedly poached a top artificial intelligence (ai) engineer from apple (aapl), according to a report from bloomberg. d.a. davidson's head of technology research, gil luria, and siebert financial's chief investment officer, mark malek, join market catalysts to discuss meta's position in the ai race and where it stands in the competition for the best open-source ai model compared to other \"maximalist\" players, like openai (opai.pvt) and xai (xaai.pvt). to watch more expert insights and analysis on the latest market action, check out more market catalysts here.", "provider": "Yahoo Finance Video"}, "1": {"title": "Apple Loses Top AI Models Exec to Meta's Hiring Spree", "summary": "apple loses top ai models exec to meta's hiring spree apple inc.'s top executive in charge of artificial intelligence models is leaving for meta platforms inc., another setback in the iphone maker's struggling ai efforts. ruoming pang, a distinguished engineer and manager in charge of the company's apple foundation models team, is departing, according to people with knowledge of the matter. pang, who joined apple from alphabet inc. in 2021, is the latest big hire for meta's new superintelligence group, said the people, who declined to be named discussing unannounced personnel moves. to secure pang, meta offered a package worth tens of millions of dollars per year, the people said. meta chief executive officer mark zuckerberg has been on a hiring spree, bringing on major ai leaders including scale ai's alexandr wang, startup founder daniel gross and former github ceo nat friedman with high compensation. bloomberg's mark gurman reports on the latest with the tech giants.", "provider": "Bloomberg"}, "2": {"title": "A Waymo Taxi Took Me for a Ride. I’m Ready to Try Tesla.", "summary": "a waymo taxi took me for a ride. i’m ready to try tesla. self-driving taxi rides really aren’t all that scary—at least waymo’s weren’t. i haven’t ridden in a tesla robo-taxi, but i have a self-driving model y.", "provider": "Barrons.com"}, "3": {"title": "Waymo Begins Offering Teen Accounts, Starting in Metro Phoenix", "summary": "waymo begins offering teen accounts, starting in metro phoenix (bloomberg) -- alphabet inc.’s waymo is launching a new account type that lets teenagers hail a robotaxi and ride alone, expanding its rider base while continuing to test its service in more us cities.most read from bloombergare tourists ruining europe? how locals are pushing backcan americans just stop building new highways?denver city hall takes a page from nasaphiladelphia trash piles up as garbage workers’ strike drags onteens from 14 to 17 can have a user profile paired to a parent’s accoun", "provider": "Bloomberg"}, "4": {"title": "Waymo Tests Bring NYC One Step Closer to Autonomous Taxis", "summary": "waymo tests bring nyc one step closer to autonomous taxis (bloomberg) -- waymo’s first self-driving taxis arrived in new york city this week to begin collecting data with a human behind the wheel as the company seeks a permit for autonomous testing.most read from bloombergare tourists ruining europe? how locals are pushing backcan americans just stop building new highways?denver city hall takes a page from nasaphiladelphia trash piles up as garbage workers’ strike drags onthe alphabet inc.-owned company plans to gather data as its cars are driven manua", "provider": "Bloomberg"}, "5": {"title": "3 Reasons to Buy Microsoft Stock Despite 11.7x P/S Premium Valuation", "summary": "3 reasons to buy microsoft stock despite 11.7x p/s premium valuation microsoft's explosive $13b ai revenues surge 175% yoy, justifies 11.76x p/s premium. azure cloud market share gain makes msft a must-buy for 2025.", "provider": "Zacks"}, "6": {"title": "Uber Traders Shrug Off Robotaxi Risks as Stock Powers to Record", "summary": "uber traders shrug off robotaxi risks as stock powers to record (bloomberg) -- uber technologies inc. investors are brushing aside potential threats from self-driving competition to bet that the company has plenty of room to expand in the near term.most read from bloombergare tourists ruining europe? how locals are pushing backcan americans just stop building new highways?denver city hall takes a page from nasaphiladelphia trash piles up as garbage workers’ strike drags onuber shares have rallied more than 60% to a record this year as partnerships with robot", "provider": "Bloomberg"}, "7": {"title": "Can Google Cloud's Growing Clientele Push the GOOGL Stock Higher?", "summary": "can google cloud's growing clientele push the googl stock higher? googl is strengthening its competitive position in the search and cloud with the infusion of ai amid challenging macroeconomic conditions.", "provider": "Zacks"}, "8": {"title": "Can Adobe Stock Hit $660 in 2025?", "summary": "can adobe stock hit $660 in 2025? adobe has taken a hit, but with a $660 target on the table, can it bounce back this year?", "provider": "Barchart"}, "9": {"title": "Elon Musk Tops the Richest List. Here’s How Much His Wealth Has Dropped This Year.", "summary": "elon musk tops the richest list. here’s how much his wealth has dropped this year. elon musk, the tesla ceo and former trump ally, has lost $69 billion, but still tops the richest list so far this year.", "provider": "Barrons.com"}}, "Tesla": {"0": {"title": "Why Elon Musk told Tesla bull Dan Ives to 'shut up'", "summary": "why elon musk told tesla bull dan ives to 'shut up' wedbush's dan ives is known for being bullish on tesla's (tsla) stock. but in a post on x, ives suggested three steps the ev maker's board should take to help rein in ceo elon musk, who recently announced plans to launch a new \"america party.\" musk did respond to ives, writing, \"shut up, dan.\" yahoo finance senior autos reporter pras subramanian and barron's senior market analysis writer paul la monica discuss the exchange and what it all means for tesla shares. to watch more expert insights and analysis on the latest market action, check out more market domination here.", "provider": "Yahoo Finance Video"}, "1": {"title": "Commentary: Why Elon Musk should stick to business", "summary": "commentary: why elon musk should stick to business third parties like the one musk wants to form almost always fail. there's a better template for billionaires who want to be political bosses.", "provider": "Yahoo Finance"}, "2": {"title": "Samsung, Uber gains, Shein IPO: Trending Tickers", "summary": "samsung, uber gains, shein ipo: trending tickers samsung (005930.ks) shares are under pressure after the company warned of a profit drop due to us restrictions on exports to china. uber (uber) shares extend gains after closing monday's session at a record high, with tesla's (tsla) decline potentially fueling uber's rise. shein reportedly filed for an initial public offering (ipo) with the hong kong exchange, according to reports from the financial times. to watch more expert insights and analysis on the latest market action, check out more morning brief: market sunrise here.", "provider": "Yahoo Finance Video"}, "3": {"title": "Dow Jones Futures: Stocks Quiet Amid Trump Tariffs; Elon Musk Tells Tesla Bull To 'Shut Up'", "summary": "dow jones futures: stocks quiet amid trump tariffs; elon musk tells tesla bull to 'shut up' the major indexes were quiet, while copper prices spiked on trump tariffs. some leaders struggled, but amd and some other ai plays thrived. elon musk told a longtime tesla bull to \"shut up.\"", "provider": "Investor's Business Daily"}, "4": {"title": "Equities Mostly Fall as Trump Plans 50% Tariffs on Copper Imports", "summary": "equities mostly fall as trump plans 50% tariffs on copper imports wall street's major equity indexes mostly fell tuesday as president donald trump announced plans to", "provider": "MT Newswires"}, "5": {"title": "Analyst's Bold Call on Tesla's Top Seat Through 2030", "summary": "analyst's bold call on tesla's top seat through 2030 new pay plan would boost his voting power and tether political antics", "provider": "GuruFocus.com"}, "6": {"title": "Loss of EV credits 'will impact Tesla revenue,' says market expert", "summary": "loss of ev credits 'will impact tesla revenue,' says market expert story: the dispute between republican president donald trump and tesla ceo elon musk escalated on saturday when the space and automotive billionaire announced the formation of a new political party, saying trump’s tax-cut and spending bill would bankrupt america.the sweeping legislation approved by congress and signed by trump means $7,500 tax credits for buying or leasing new electric vehicles will end on september 30, as well as a $4,000 used ev credit that has helped boost green vehicle sales in recent years.sissel said musk’s public feud with the administration \"will have negative impacts on tesla specifically. if you look at the 'big, beautiful bill,' the cafe credits that incentivize fuel economy and that were positive and actually had a specific and measurable impact on revenue at tesla are no longer in place, and this will impact tesla revenue.\"", "provider": "Reuters Videos"}, "7": {"title": "These Stocks Moved the Most Today: Tesla, Amazon, Moderna, Fair Isaac, Exxon, Sunrun, SoFi, Datadog, and More", "summary": "these stocks moved the most today: tesla, amazon, moderna, fair isaac, exxon, sunrun, sofi, datadog, and more stocks were mixed on tuesday after president donald trump said he wouldn’t delay the date when his tariffs will take effect.  ceo elon musk announced over the weekend that he would form a new political party, and his return to politics prompted investors to sell the stock.  musk strongly opposed trump’s tax-and-spending bill that was signed into law friday.", "provider": "Barrons.com"}, "8": {"title": "Tesla Stock Rises. The Musk-Trump ‘Soap Opera Must End.’", "summary": "tesla stock rises. the musk-trump ‘soap opera must end.’ wedbush analyst dan ives wrote that the ev maker’s directors need to set ground rules for the ceo regarding his political activities.", "provider": "Barrons.com"}, "9": {"title": "Tesla Stock Bull Says 'Tesla Board Needs To Act Now' But Elon Musk Says This", "summary": "tesla stock bull says 'tesla board needs to act now' but elon musk says this in the aftermath of tesla falling sharply in monday's stock market action, with the ev giant leading the downside among s&p 500 stocks, a longtime tesla stock bull called on tuesday for the tesla board of directors to \"act now\" as ceo elon musk appears to be continuing to focus on politics.  wedbush securities analyst dan ives outlined on tuesday \"three steps\" the tesla board should take as musk looks to increase his involvement u.s. politics following the tesla head's weekend announcement that he is forming the \"america party\" to challenge president donald trump and the two-party system.", "provider": "Investor's Business Daily"}}}